{
  "posts": [
    {
      "id": "1",
      "title": "How To Create A Better Budget",
      "url": "https://www.youtube.com/watch?v=5ywZibui2Jc",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "Test, test, good morning everyone!",
        "4.32": "I welcome you to another day with the Financial Coconut.",
        "7.68": "In our podcast, we'll be debunking financial myths, discovering best financial practices,",
        "12.76": "discussing financial strategies that fits our unique life.",
        "16.64": "You get it!",
        "17.64": "Ultimately empowering us to create a life we love, while managing our finances well.",
        "22.56": "So whether you're interested in the pursuit of the common narrative, getting a degree,",
        "26.24": "finding a job, setting up a family and live happily ever after.",
        "29.2": "Or you're an avid FIRE believer, F-I-R-E, for those who are new to the term, FIRE means",
        "34.8": "Financial Independence Retire Early.",
        "37.12": "Or you're just quirky, like me, questioning and trying to create a life you love.",
        "41.84": "There should be something for you here.",
        "44.16": "So whether you're on your way to work, to school, chilling by the beach or just cuddling,",
        "48.36": "snuggling in bed, today's topic is 3 things you should include in your budget.",
        "56.8": "Following the previous episode of Dangerous Spending Myths, I talked about 3 different",
        "62.24": "spending myths that to me are extremely dangerous if you're trying to become more financially",
        "66.96": "literate and drive yourself towards financial independence and early retirement.",
        "73.16": "And so if you have not caught the topic, you know, have not caught that podcast, you may",
        "77.44": "want to check out the previous series.",
        "79.48": "But I want to elaborate a little bit more on that last point that I said last week,",
        "84.44": "which is I believe that spending smart is so much more important than not spending.",
        "92.64": "And not spending is not going to get you rich, in my view.",
        "95.56": "We can calculate.",
        "97.12": "And it's not going to get you really, really wealthy.",
        "99.96": "But then again, you don't need to be really wealthy to live a great life.",
        "104.52": "But to me, that is a very weird underlying spending myth that many of us have.",
        "109.64": "So today I've decided that, yeah, then I should talk a little bit about my budget.",
        "114.92": "How do I spend my money?",
        "116.4": "And 3 things that I feel it's not included in many people's budget.",
        "120.88": "And why you should include these 3 things in your budget.",
        "124.92": "How do we spend smart?",
        "126.4": "How do we spend better to be able to then attain what we want and to be able to be smarter",
        "133.2": "with our finances?",
        "134.52": "Once again, it's not about not spending, it's about spending smart.",
        "138.32": "More parents and more family and more.",
        "141.0": "All of us should talk more about how do we spend?",
        "144.0": "How do we spend better?",
        "145.0": "How do we become smart spenders?",
        "147.4": "And the first thing that I want you to include in your budget, not surprisingly, is a book fund.",
        "155.28": "Hehe.",
        "156.28": "Throughout my podcast, I've consistently talked about you read books, read books, read books.",
        "163.28": "Go to the library, get free books or buy books or buy this book, get that book.",
        "168.16": "You get the idea.",
        "169.16": "I believe that reading has its beauty.",
        "172.48": "Honestly, I didn't start out reading.",
        "175.76": "I don't come from a family of avid readers.",
        "177.96": "We don't read everyday.",
        "178.96": "We watch cartoons, Digimon, Pokemon, growing up, card capture Sakura, right?",
        "185.68": "So we don't read a lot.",
        "188.0": "And how did I picked up reading was when I joined a scam, the accidental scam that I",
        "193.16": "joined.",
        "194.16": "And I was assigned a mentor.",
        "195.16": "So my mentor said, hey, you got to read this books.",
        "197.84": "Come to think of it, scam also got mentor.",
        "201.2": "Yeah, I know I've not talked about that yet.",
        "203.56": "We'll talk about it in a later episode.",
        "205.8": "But yes, that is the good thing that came out of it.",
        "208.64": "I picked up the habit of reading and I've realized that it is not because I don't like",
        "212.88": "to read.",
        "213.88": "I used to think I don't like to read.",
        "215.4": "It was just because I've not found something that I love reading.",
        "220.04": "And I don't like to read fantasy.",
        "222.44": "I don't like to read stories because I just cannot imagine.",
        "227.56": "I'm just not wired that way.",
        "229.6": "And I've not cultivated the capacity to imagine based on just reading lines.",
        "235.96": "So I fell in love with reading nonfiction, a lot of biographies, a lot of different kind",
        "241.96": "of success books that some people call self-help, all those kind of stuff.",
        "247.24": "I fell in love with reading them.",
        "250.84": "I've consistently read over the years.",
        "253.08": "I've got great friends that have great books.",
        "255.04": "They're always spending on books and always lending it to me.",
        "259.28": "But I also spend on my books.",
        "261.2": "I spend on a few books that are pretty pricey and not many people buy them like my investing",
        "266.76": "books.",
        "267.76": "Average are going to like 50, 60, hundreds of dollars.",
        "272.16": "You get the idea.",
        "273.32": "Some of the books are a little bit more expensive.",
        "275.64": "And yes, if you can get it from the library, go ahead.",
        "278.2": "But you realize that the library has its limits at times.",
        "282.12": "If you really want to learn something, learn something fast, and just so happen that the",
        "285.76": "library doesn't have the book or the book is consistently being leased out, you could",
        "290.24": "save with the library of course.",
        "291.96": "But if it's not available, you may want to consider spending a little bit and buy.",
        "296.44": "I think it's cool.",
        "297.44": "And a book is a good gift also.",
        "298.92": "If you buy the book and you like the book, you can always gift it to someone.",
        "302.8": "It's like gifting knowledge.",
        "304.44": "I like it.",
        "305.44": "I like that way.",
        "306.44": "I've been gifting books for a really long time and I enjoy it.",
        "310.76": "I'm going to further emphasize as to why I believe you should read books.",
        "316.44": "These days there are many ways to learn.",
        "317.92": "You could go on the internet, watch some videos on YouTube, or listen to my podcast, listen",
        "323.36": "to other podcasts.",
        "324.36": "If you're listening on Spotify, you realize that hey, there are tons of good podcasts",
        "328.32": "here and of course, even in SoundCloud, there are many other places that have great podcasts.",
        "333.96": "I think in our part of the world, we're not listening to enough podcasts.",
        "338.36": "So maybe you want to listen to more.",
        "339.76": "I get it.",
        "340.76": "Videos, audios, great way to learn.",
        "343.96": "So many platforms, Udemy, Skillshare, all these different places, amazing ways to learn.",
        "350.32": "But why I think books are still very fundamental, because think about it, where do all these",
        "355.04": "people get their knowledge?",
        "357.36": "Many of them got it from books.",
        "360.4": "Why?",
        "361.6": "Books take a long time to publish and it takes a lot of capital to publish books.",
        "366.52": "So to be able to get a publisher to publish, there's a whole process of proofreading, of",
        "373.6": "editing and making sure everything is accurate and up to standard, which is why to me, books",
        "381.08": "have the most rigorous process of putting information together, rather than podcast,",
        "388.32": "rather than video.",
        "389.68": "All these are great platforms.",
        "390.96": "Don't get me wrong, I'm a podcaster.",
        "393.8": "But where do we get our knowledge?",
        "396.2": "We get from books.",
        "397.2": "So I think you should read books because they're the most rigorous.",
        "400.76": "And that's why you should add a book fund into your monthly spending.",
        "405.04": "Why not?",
        "406.04": "Read some books, pick up something.",
        "408.48": "And you don't need to read self-help or investing books all the time.",
        "414.72": "Start with something that you love.",
        "416.24": "Pick up a book about coffee, pick up a book about tea, pick up a book about photography.",
        "421.2": "Photography books are quite expensive.",
        "423.56": "So pick up a book about something you love and start there.",
        "427.2": "It's a great place to learn.",
        "428.2": "The content is a lot more rigorous than what you get online.",
        "431.8": "And it's not that expensive.",
        "432.8": "One of the cheapest ways to learn are by books.",
        "435.68": "So I feel one of the things that you should include in your budget is a book fund.",
        "440.68": "Do it.",
        "441.68": "And the next thing that I feel you should include in your budget is this thing that",
        "445.64": "I call an exploration fund.",
        "448.44": "Yeah, yeah.",
        "450.68": "Exploration explore what, right?",
        "453.0": "How many of you on the other end have ever came across this thought that, oh my goodness,",
        "457.36": "I'm so bored.",
        "459.28": "Work is so boring.",
        "460.28": "It's the same thing again and again and again.",
        "463.48": "And I'm burning out.",
        "464.48": "I want to try something new.",
        "465.56": "I want to take on a different job.",
        "466.84": "I want to shift my career.",
        "467.84": "I want to change this.",
        "468.84": "I want to do that.",
        "470.2": "I'm quite sure at least 80 to 90% of you guys have experienced something like that.",
        "476.16": "It's fair, especially when you're really good at what you do.",
        "479.08": "And to me, that is where boredom comes from.",
        "483.72": "You're so good at what you do.",
        "485.12": "You've been doing it again and again and again and again and again and again.",
        "487.64": "You get bored.",
        "488.64": "It's like playing games, right?",
        "490.0": "You play a game.",
        "491.0": "At first, very exciting.",
        "492.32": "But after a while, you know how to play the game.",
        "494.2": "Oh my goodness, so boring now.",
        "496.44": "Sian already, right?",
        "497.44": "You want to quit the game.",
        "498.6": "And then you find another game and it looks interesting.",
        "500.76": "And then you realize, oh, this game, even easier to crack.",
        "503.98": "After a while, you get bored.",
        "505.56": "You delete it.",
        "506.56": "Same idea.",
        "507.56": "So when you get bored, when you get so good at something, you become bored.",
        "511.18": "And you think that you want to change it.",
        "512.94": "You think that you want to make progress, which is fair.",
        "517.18": "But in a job setting or in your financial health, many a times, that may not be the",
        "521.38": "wisest choice.",
        "523.42": "If you really feel that you want to move on from your job, cool, go ahead.",
        "527.1": "If you really feel that you want to take on something new, you want to start a new challenge,",
        "530.22": "you want to start a new startup, you want to start working.",
        "535.74": "You want to start a company, you want to change a department, you want to promote and progress,",
        "538.62": "create cool stuff, do what you believe.",
        "541.5": "But recognize that many a times, it is just our underlying boredom disturbing us.",
        "548.38": "And to me, I believe that there is an underlying desire for progress in all of us.",
        "554.78": "That is why we get to where we are.",
        "556.94": "That's why the human civilization is where we are today.",
        "560.02": "And I stand by it.",
        "561.74": "Because if you think about it, even if people tell you, oh, I'm retired, they're actually",
        "565.1": "making progress in other aspects of life.",
        "567.22": "They're trying to make progress in their relationships, they're trying to make progress in their health,",
        "571.82": "they're trying to make progress in their interests, they're trying to become a hobbyist.",
        "576.26": "We're all wanting to make progress.",
        "578.02": "We all need to work, we all want to make progress, we just focus on different things at different",
        "582.62": "time in life.",
        "584.1": "So to me, we get bored.",
        "586.14": "And we don't exactly need to change our job or quit our job just because we are bored.",
        "591.34": "We just need to solve that boredom.",
        "594.38": "So include an exploration fund.",
        "596.9": "It could be $100, it could be $50, depending on what is comfortable in your budget.",
        "603.98": "And explore something.",
        "605.18": "Buy a new board game, go for a new class, pick up a new sport, try a new thing.",
        "612.14": "Yeah, that is the idea of exploration, trying something that you've never tried before.",
        "617.22": "And that will make sure you're not bored at all.",
        "619.1": "You will never get bored if you can consistently explore.",
        "622.06": "It is because when we start working, we dedicate so much of our lives to work.",
        "626.86": "We dedicate 8 hours, 10 hours, 12 hours, my goodness, I have friends who work in accounting,",
        "632.46": "big 4, like 16 hours to work, almost every day I work.",
        "637.66": "Yeah, and we dedicate so much time to work, after that we go home, we sleep, we end up",
        "642.38": "not socialising with our friends as much, we start to skip the gym, we start to do this,",
        "647.58": "we start to drop a lot of things that we used to have.",
        "650.86": "And that's why we get bored very easily, alright, because there's nothing new in our life,",
        "655.18": "every day is just work, ma.",
        "656.78": "So why not spend a little bit of budget to explore?",
        "660.06": "Give yourself that $50, that $100, do spontaneous things, go rock climbing, go for, learn how",
        "665.74": "to dance, pick up a ballet, or, you know, join a new board game group, buy a new board",
        "671.5": "game, go for archery, or learn how to code, play chess, anything and everything under",
        "678.38": "the sky, there's so many platforms that you can do.",
        "681.02": "I would recommend you to use meetup.com, search on Eventbrite, I think Facebook have a lot",
        "686.3": "of good events also, but set aside a budget for you to do random things and for you to",
        "690.46": "explore.",
        "691.1": "That will make your life a lot more exciting, a lot more fun, and less bored.",
        "695.18": "You will not really need to keep changing jobs.",
        "697.9": "And why do I try to let you realise this thing?",
        "701.58": "Because if you stick to something long enough, you level up, you become that much better",
        "708.46": "and you get to progress.",
        "711.1": "Yes, of course you can always change your job and progress, or you can start a new company",
        "715.5": "and progress, fair.",
        "716.94": "But I think some governing fundamentals is that if you stick to something long enough,",
        "721.82": "you become an expert, you become that good at it, you can start to see more things, the",
        "726.06": "ins and the outs, and you get more opportunities because you are that good at it.",
        "730.46": "So don't always change your job just because you are bored.",
        "733.42": "Recognise that you are bored because you are not exploring and set aside a budget, go and",
        "737.82": "try something new and explore.",
        "739.42": "Fair?",
        "739.98": "Yeah, give it a shot and let me know what you have tried, let me know interesting things",
        "744.06": "that you have done.",
        "745.02": "Email me or Facebook message me, okay?",
        "747.34": "I want to get some ideas as to what kind of interesting things I can do.",
        "751.5": "Singapore, KL, anywhere, I am open to ideas.",
        "755.02": "The last thing that I feel you should include in your budget is something I call giving.",
        "761.9": "Yeah, yeah, a bit cheesy, a lot of people say you must give back to society, give to",
        "766.06": "charity, give all those kind of different things.",
        "769.26": "But in my view, giving is just something that allows me to realise certain fundamentals",
        "775.26": "of society, certain fundamentals of life.",
        "779.34": "That everything is but a gift.",
        "781.42": "If we realise it is all in a circle, we are where we are because we are given an opportunity,",
        "786.3": "we are where we are because we are given a good education, we are where we are because",
        "790.46": "our parents had a good time at night and gave birth to us.",
        "794.38": "So everything is a process of giving and it is a cycle.",
        "798.14": "Many a times if we keep taking and taking and taking and we stop giving, we realise",
        "802.46": "that this is a cycle, we stop realising that we are so connected in actuality to people",
        "809.02": "around us, to things around us, to the environment and to every little thing.",
        "813.98": "We are all connected and giving helps you to do that.",
        "818.38": "I am not saying giving in a sense that you need to buy a rice, buy a huge 25kg of rice",
        "824.06": "to donate to the temple or go to invest to donate to a charity, to go for different kind",
        "831.1": "of causes, you don't need to do that.",
        "833.26": "Giving is just giving.",
        "835.58": "You could buy a gift, maybe your colleagues, they have worked really hard, buy them a gift,",
        "844.06": "maybe it can be a bubble tea, oh my goodness, why did I say bubble tea?",
        "847.82": "Oh yeah, it is just an act of giving.",
        "850.54": "Or maybe it is the cleaning auntie downstairs that is always cleaning the tables and making",
        "857.34": "sure the hawker centre is clean or decently clean.",
        "860.22": "Trust me, they don't make a lot, we will talk about that in another episode.",
        "863.82": "But yeah, buy them a coffee, buy them a loaf of bread, give them some biscuits, just give",
        "869.1": "something.",
        "869.9": "You don't need to go the really extra mile to give, do little acts of giving.",
        "875.34": "Oh, give your mum a hug, yeah I have not given my mum a hug in a long time, I probably should.",
        "880.94": "Just anything, just give.",
        "883.98": "And honestly, giving, you don't really need a lot of money but why not set aside a budget",
        "888.14": "to give, give more and realise that everything is a cycle.",
        "892.7": "The more you give, the more gifts are going around, the chances of you getting more gifts,",
        "897.34": "hey, a lot higher.",
        "899.02": "And there is one initiative in Tampines where I grew up, I want to talk about, it is this",
        "905.9": "initiative called My Kind Fridge.",
        "908.62": "Essentially, it is some people that donated their fridge and the town council has allowed",
        "916.22": "them to put these fridges at certain locations in Tampines, which uses the town council electricity,",
        "924.94": "it is a place where you can give your vegetables, you buy extra veggies, you can give, you buy",
        "931.74": "extra oatmeal, you can give, you cook extra pastries, cakes, you can give and you can",
        "937.82": "just put inside the fridge and most of the time, these fridges are located in places",
        "943.34": "that have more older generation or rental houses, you know, people that will appreciate",
        "951.18": "good things that you, great food and good things that you give them.",
        "954.78": "So yeah, I want to point this out and I feel it is a great initiative and I feel that more",
        "959.26": "estates should do it and Tampines should expand this My Kind Fridge initiative.",
        "963.9": "So search about them online, they have a few news around and if you are around, you are",
        "969.1": "near a kind fridge and you are shopping for vegetables, buying chicken, why not do a little",
        "974.14": "bit more, right?",
        "975.98": "So, that is the three things that I feel you should include in your budget.",
        "980.46": "A book fund, exploration fund and a giving fund.",
        "984.7": "And with that, I hope you learned something today, share with me what you have done.",
        "988.7": "See ya!",
        "992.14": "Test, test.",
        "993.1": "Hey, I hope you learned something useful today and truly appreciate that you took time off",
        "997.1": "to better your life with The Financial Coconut.",
        "999.5": "Knowledge is that much more powerful and interesting when shared, debated and discussed.",
        "1003.98": "I hope you will share what you have gained with people you love and I want to hear from you.",
        "1007.98": "Give me some questions and help me along with building a community of financially savvy",
        "1011.82": "coconuts.",
        "1012.54": "I hope together, we can fulfill our curious minds and our desire for clarity.",
        "1016.86": "Email me at thefinancialcoconut at gmail.com or message me on Facebook at The Financial",
        "1022.3": "Coconut.",
        "1022.94": "I will do my best to address your questions in our future podcast series, especially if",
        "1027.1": "many people are concerned about the same topic.",
        "1029.34": "With that, have a great day ahead, stay tuned next week and always remember, personal finance",
        "1034.62": "can be chilled, clear and sustainable for all."
      }
    },
    {
      "id": "2",
      "title": "Have Fun In Singapore On A Budget",
      "url": "https://www.youtube.com/watch?v=Lyh3npaUn8c",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "So many financial gurus or financial educators always tell you that you're not going to spend",
        "5.84": "less, you're going to spend less, cut your expenses because that's the only thing that's",
        "9.6": "truly within your control and they're not wrong.",
        "13.36": "To cut back on drinking, cut back on gatherings out there and essentially just consume less.",
        "19.68": "You're going to get more surplus, you're going to be able to invest more, going to be able",
        "23.44": "to save more and prepare for retirement.",
        "25.9": "You may even be able to retire early, get your house earlier and buy things that may",
        "31.94": "be more impactful for the longer term.",
        "35.02": "So all these are not wrong but it's really painful spending less from time to time.",
        "39.06": "It's like, oh my god, I'm on a budget, oh I'm on a budget.",
        "42.42": "So many people get turned off by this word budget.",
        "45.26": "It's like, oh shit, no man, don't tell me to go on a budget thing.",
        "49.86": "And there's a lot of assumption that when things are on a budget, it's going to be sub-quality,",
        "54.26": "it's going to be painful, it's going to be like a chore.",
        "58.3": "But today I'm going to debunk all that and talk about how we're going to have fun on",
        "62.06": "a budget in Singapore.",
        "65.78": "So good morning everyone, I welcome you to another day with the Financial Coconut.",
        "69.78": "In our podcast, we'll be debunking financial myths, discovering best financial practices,",
        "74.86": "discussing financial strategies that fits our unique life.",
        "78.44": "You get it.",
        "79.44": "Ultimately empowering us to create a life we love while managing our finances well.",
        "83.74": "And today's topic, how to have fun on a budget in Singapore.",
        "88.42": "Some say the world's most expensive city.",
        "91.54": "Yeah.",
        "92.54": "Growing up in Singapore, you may or may not have felt that things were really expensive.",
        "99.34": "And honestly, when I was growing up, I didn't feel it because there was no mode for comparison.",
        "103.66": "It was just like, oh, okay, this is how things were.",
        "106.42": "These are how prices are.",
        "108.26": "But when I started traveling and I had more access to a lot more information, I realized",
        "113.38": "that in Singapore, things are truly pricey relative to many other of our neighboring",
        "118.5": "countries because we don't grow our stuff.",
        "121.6": "We import many things and we tax certain things.",
        "125.18": "You know, that's why alcohol is really expensive.",
        "127.94": "Cigarettes are really expensive.",
        "128.94": "You know, food items in general are expensive.",
        "131.94": "We have a lot of people living on a small island.",
        "135.6": "So honestly, without the housing scheme, without the HDB scheme, most people will never be",
        "140.22": "able to afford houses because private condominiums are going at like a million, close to two.",
        "146.02": "And HDB is getting really expensive also.",
        "149.14": "From what I found out from my dad when he first got his first HDB, that was about 20",
        "153.58": "odd years ago, it was a four room flat for 109,000 in Tampines.",
        "160.82": "And today, my goodness, houses average are going at about four, five, 600,000.",
        "167.14": "If you want to do like 300,000, you got to go really, really far out to Sembawang or something.",
        "172.94": "But yeah, housing is just one thing.",
        "174.54": "And then there's like transportation.",
        "177.04": "Most people don't own a car because it's really expensive.",
        "181.38": "Most people just take the public transport.",
        "183.06": "It's more efficient, cheap, and relatively cheap.",
        "186.58": "And yeah, you get the idea.",
        "188.4": "So it is not wrong to say that many things in Singapore are expensive.",
        "192.9": "One of the most important thing to do is to watch our budget.",
        "197.92": "But that's not to say that being a little bit more penny pinching means you're going",
        "202.94": "to reduce your quality of life.",
        "205.5": "In the past, I remember when I was in school and I see people bring lunch boxes to school",
        "210.42": "and I'll judge them as like, hey, well, I was so...",
        "214.06": "You know no money to buy food, must pack food from home.",
        "217.82": "But now when I see people bring food to the office, I'll be like, oh my, you're so lucky",
        "222.34": "you managed to find time to do good food and bring a great lunch box to work.",
        "228.54": "So it's a mindset shift and it really depends on how you value different things.",
        "233.18": "And when I learned to value things like quality and health and many other different things",
        "239.78": "on other than just price, which I talk a little bit about.",
        "244.82": "One of the spending myths that we have today is that more expensive means better.",
        "249.64": "So yeah, backtrack to the episode on spending myths and to me that is like, oh, so terrible",
        "255.32": "because we don't factor in things like branding, we don't factor in things like rent, we don't",
        "260.16": "factor in things like, you know, many other different small elements that all these businesses",
        "265.32": "have to put in to command that price.",
        "268.32": "But many a times, if you're just looking at quality, you can do a lot of great things",
        "271.72": "on your own.",
        "273.08": "So yeah, don't be fooled by the whole idea of more expensive means better.",
        "277.64": "It really depends on how you value things and yeah, I personally believe that if you",
        "283.0": "go down to revalue the way we look at things, you come to a lot more emotional calm when",
        "288.76": "looking at different aspects of life.",
        "291.6": "And so when I look at this, I come to a question like, hmm, so how do I have fun in Singapore",
        "297.24": "then?",
        "298.24": "If everything is so expensive and I'm on a budget, how am I going to have fun?",
        "302.32": "So of course there are a lot of interesting places like the museum that you can go is",
        "306.24": "free.",
        "307.24": "National Arts Council gives free museum pass to everybody that's a Singaporean.",
        "311.24": "And there are a lot of activities out there that are free.",
        "314.6": "A lot of events going around and yeah, great places to go about.",
        "319.16": "But there are some things that you may not have thought about and I want to share with",
        "322.6": "you some things that I do, which I thought was really, really fun.",
        "325.4": "And the first thing I do is I'll join an interest group, a social community in fact, on meetup.com.",
        "332.9": "So I know I've talked about meetup.com and I want to share with you some of my experiences",
        "336.58": "on meetup.com.",
        "338.02": "So I've joined a few meetups and it's really, really fun.",
        "341.02": "One of the most memorable meetup that I've joined was this board game meetup group.",
        "346.5": "And what happened was I needed to pay $5 for a four-hour session at this board game place",
        "353.54": "in Marina South MRT station.",
        "358.82": "It's organised by an interest group where it's filled with board game lovers and it's",
        "363.14": "amazing because they all know how to play.",
        "365.5": "I was like one of the few noobs.",
        "367.34": "I knew nothing.",
        "368.34": "And I went there, all I did was pay $5 and I met like 40, 60 people.",
        "372.54": "They're all playing board games and many of them come as an individual.",
        "375.74": "And when I think about it, oh my goodness, it was very, very difficult to gather four",
        "380.3": "or five people to go to a board game cafe and play.",
        "383.26": "But on this meetup group, I managed to just pay a minimal, even cheaper than how I'll",
        "388.26": "usually pay at the board game cafe and be able to play all these different games with",
        "393.7": "all these different people that knew so much about board games and they taught me all these",
        "398.42": "different games and it was really fun.",
        "400.1": "So it was like a great social activity and it's a lot, very, very affordable.",
        "404.54": "And because it is an interest group, they're not profit-driven.",
        "407.3": "Although it is at a place which is a board game, which is kind of like a board game cafe,",
        "411.54": "more like a board game community area.",
        "414.62": "So it's kind of like a collaboration with that space and the interest group.",
        "419.22": "But because the interest group is not profit-driven, they managed to strike a deal with the board",
        "423.06": "game space owner.",
        "426.34": "And yeah, everyone was paying minimal to get maximum amount of joy.",
        "430.06": "I was like, wow, it's cool, man.",
        "431.7": "$5, I can do so.",
        "432.98": "I can have a great afternoon on the weekend, meet so many people and play board games.",
        "438.26": "I thought that was cool.",
        "440.02": "And there were a lot of other groups that I joined.",
        "442.66": "Some of the groups were ramen group.",
        "444.7": "So essentially, it's just a bunch of people that really love eating ramen and they go",
        "448.38": "out and have fun together by eating ramen, go to different places and have ramen together.",
        "452.9": "I was like, hey, it's pretty nice, man.",
        "454.98": "Yeah, I just get to try different, different ramen.",
        "457.94": "It's not exactly cheap, cheap per se, but there's a lot of social activity around and",
        "462.66": "you don't need to spend a lot of money.",
        "464.22": "Just over a bowl of ramen, people chat about all sorts of stuff.",
        "468.22": "And on meetup.com, I think there are a lot of interesting groups.",
        "471.58": "I saw one that was about social dancing and there was another one about language.",
        "475.86": "You could gather with a bunch of people that are interested in Japanese lessons, learning",
        "480.78": "Japanese and just have fun together, talk, speak in Japanese and be able to use that",
        "488.5": "language that you're interested in.",
        "490.18": "So to me, it's like, wow, I don't need to spend much money because all these interest",
        "494.06": "groups are not profit driven.",
        "496.22": "They are interest driven.",
        "497.22": "They're just trying to gather people that are interested on the same thing to come together",
        "500.66": "and have fun, connect and be better together.",
        "503.74": "So on a budget, wow, great stuff.",
        "506.34": "Five dollars, ten dollars, twenty dollars, nothing much.",
        "508.74": "And you can do great things on the weekend.",
        "510.42": "So why not pick up the app meetup.com, join the interest group and have fun.",
        "515.5": "Go and do it.",
        "516.5": "And let me know if you found any interesting things on the app or join any interesting",
        "520.88": "social groups that I could then recommend to friends and family and maybe some of you",
        "525.1": "guys here too.",
        "526.9": "And the next point that I feel many people have not used a lot is to make use of public",
        "533.18": "spaces.",
        "534.18": "Yeah, I get it.",
        "536.54": "You may not like public spaces because many times they are out in the open, they may be",
        "540.42": "a bit warm and we live in the tropics, it gets a little warm.",
        "544.7": "So yeah, I get it.",
        "546.9": "But have you thought of picnicking during the evening?",
        "550.54": "There's a lot of media that shows you that you need to picnic early in the morning, everyone",
        "556.1": "wakes up early in the morning, go for a picnic.",
        "558.54": "And I was like, oh my goodness, in Singapore you don't do that because if you meet up at",
        "562.74": "8, by the time it's 10, it's going to be super warm.",
        "565.42": "You want to stay away from all these grass patches.",
        "569.42": "But have you tried picnicking on the evening?",
        "571.42": "I've tried it and I loved it.",
        "573.18": "So it's like sunset and my friends were just gathering around and we're all just chatting",
        "576.82": "and everybody bring a little bit of food and just have fun.",
        "580.7": "The Botanical Gardens is beautiful, McRitchie, it's very nice.",
        "584.3": "We have a lot of public spaces around that are beautifully done, so why not make use",
        "589.74": "of it?",
        "590.74": "And if the circumstances doesn't allow you to go out in the morning, then go out in the",
        "594.46": "evening.",
        "595.46": "Nobody says that you cannot go picnic in the evening, nobody says you cannot go for a stroll",
        "598.9": "in the evening if you're trying to avoid the sun.",
        "602.34": "So we have great beaches, we have great parks and I feel extremely underutilised.",
        "607.9": "When I ask my friends, hey, you want to go to the beach or you want to go to the parks",
        "611.5": "or you want to go to the gardens, many people will be like, are you sure?",
        "615.86": "So boring.",
        "617.42": "But when I look at it, all these are just great places to hang out and connect.",
        "622.42": "I don't need to do another activity just to...",
        "625.22": "I don't need to go to a cafe or go to a movie.",
        "630.34": "Once in a while I do that, but it's not like an every week thing.",
        "632.66": "I'm amazed how people go for cafe hops.",
        "637.7": "One afternoon they do three, four cafes.",
        "639.66": "I'm like, are you serious?",
        "640.66": "You're going to spend a ton and most of these cafes, they suck.",
        "645.06": "They don't make great coffee, they don't make great pastry, many things are outsourced.",
        "649.34": "I will do an episode to share with you more about why I don't think you should go to a",
        "652.9": "cafe and why you shouldn't start a cafe, but that's in a later stage.",
        "657.52": "So yeah, make use of public spaces.",
        "659.02": "Go to the library, go to the parks, go to the beach.",
        "661.82": "In some way you are paying for it because you pay taxes.",
        "665.5": "But in many other ways, it's kind of free.",
        "667.3": "Since you already paid taxes for it, why not use it?",
        "669.74": "It's great stuff.",
        "670.74": "If you're on a budget, you can still do a lot of things.",
        "673.74": "And actually many of these interest groups make use of public spaces.",
        "677.22": "So yeah, other than joining an interest group, other than making use of public spaces, one",
        "681.74": "thing you could do, which I feel we've not been doing a lot, is to potluck at your friend's",
        "685.82": "place.",
        "686.82": "Yeah, to me it's like, it used to be a thing.",
        "689.22": "I don't know about you, but when I was younger, we would always hang out at my friend's place,",
        "692.7": "different friends.",
        "694.7": "School days, right?",
        "696.38": "After exams, we would just stay overnight at one of my friend's place, play games, play",
        "701.02": "mahjong, sing song overnight, whatever, do all sorts of random things.",
        "705.66": "And it feels as if as we grow older, we stop hanging out at our friend's place.",
        "710.7": "It feels like we need to go out there and find a place together.",
        "714.9": "And to me it's like, oh, why not just go to a friend's place?",
        "718.94": "It's great, right?",
        "719.94": "We have had great experiences doing that.",
        "721.78": "It makes things really affordable.",
        "723.66": "You don't need to pay for all the premium outside because of space, and just hang out",
        "727.42": "and chill, and you can be all shabby and simple and basic and just hang around.",
        "734.02": "So I've been actively trying to do that more.",
        "736.98": "And yeah, it's really, really nice.",
        "738.1": "I always try to get my friends to come over to my place and try to get them to open up",
        "742.54": "their space for us together.",
        "745.66": "Some people, like when I'm a host, I will make sure I tell my friends that you can come",
        "749.78": "over, feel free.",
        "750.78": "I love having you coming over.",
        "752.82": "I have great tea.",
        "753.82": "You don't need to go out there and spend a lot of money on very terrible teas that have",
        "758.54": "aroma oils, spices to make the tea taste better.",
        "762.74": "I have a lot of good teas at home.",
        "764.54": "You should come to my place to drink.",
        "766.26": "But if you come to my place to drink, you've got to help me to clean up.",
        "769.74": "Let's say we're going to cook at my place.",
        "772.34": "You're going to do a party at my place.",
        "774.74": "You've got to help me to clean up.",
        "776.34": "If not, that will be the last time.",
        "778.22": "So I make it really clear that as a host, I gladly welcome you.",
        "781.94": "Because I stay alone, I don't want to clean up everything on my own.",
        "786.14": "So if you want to come to my place, cool stuff, come.",
        "788.14": "I love it.",
        "789.14": "But we've got to clean up together.",
        "790.42": "So if you're a host, make it clear to your friends that, hey, my mom's home or my parents",
        "795.54": "are home.",
        "796.54": "So after a certain time, we've got to be a little bit quieter.",
        "798.18": "We've got to clean up the place.",
        "799.94": "Or if you're a guest, then yeah, why not just help out with your friends?",
        "805.14": "I think it's great fun, great childhood fun, having a potluck at a friend's place, having",
        "809.14": "a gathering at a friend's place, bringing some beer over at a friend's place.",
        "813.14": "It's like we've forgotten that many a times we are just trying to find the next space",
        "817.74": "when actually we can just go to our friend's place and hang out or come to my place if",
        "821.74": "you're my friend.",
        "822.74": "So, yeah, I hope you get a good idea that actually you can have a lot of fun on a budget.",
        "828.14": "Because if you think about it, we've done it for a really long time.",
        "830.54": "When we were younger, we were always having fun on a budget.",
        "833.14": "When you're young in school, you're always on a budget.",
        "836.04": "So why not continue to do that?",
        "837.86": "We don't need to escalate our lifestyle just because we have more money.",
        "842.86": "In actuality, I'm not sure if that's really escalating because going to the cafe and paying",
        "847.46": "that kind of premium for something that is not nice, and you've got to dress up and stuff,",
        "852.26": "I mean, it depends on your priority.",
        "854.26": "But when I look at it, you can always join an interest group, you can always make use",
        "859.38": "of public spaces, and you can always hang out at your friend's place, have a potluck,",
        "863.1": "do something, hang out at your friend's place.",
        "865.66": "And you can always have fun on a budget in Singapore.",
        "868.66": "So I hope you learned something, and if you have any interesting things that you do on",
        "872.86": "a weekend or when you're on a budget, how do you have fun in Singapore, feel free to",
        "876.66": "email me, talk to me, and I want to share with more people.",
        "879.66": "Hope you learned something, and see ya!",
        "883.66": "Hey, I hope you learned something useful today and truly appreciate your tip time off to",
        "887.66": "better your life with a financial coconut.",
        "889.66": "Knowledge is that much more powerful and interesting when shared, debated, and discussed.",
        "894.66": "I hope you will share what you've gained with people you love, and I want to hear from you.",
        "898.66": "Give me some questions and help me along with building a community of financially savvy coconuts.",
        "902.66": "I hope together we can fulfill our curious minds and our desire for clarity.",
        "906.66": "Email me at thefinancialcoconut at gmail.com, or message me on Facebook at The Financial Coconut.",
        "912.66": "I will do my best to address your questions in future podcast series, especially if many",
        "917.66": "people are concerned about the same topic.",
        "920.66": "With that, have a great day ahead, stay tuned next week, and always remember,",
        "924.66": "personal finance can be chill, clear, and sustainable for all.",
        "950.66": "Thanks for watching!"
      }
    },
    {
      "id": "3",
      "title": "Saving Hacks In Singapore",
      "url": "https://www.youtube.com/watch?v=28Bv7xKTHjg",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "So it's a new year, you have this plan to save a certain amount of money and you start",
        "5.2": "off great.",
        "6.2": "First month, second month.",
        "7.2": "And then suddenly, there's a friend that comes along and says, hey, you wanna take a trip",
        "12.44": "to Turkey?",
        "13.44": "And then you'll be like, oh, I'm not sure, but, but, oh, who knows who else is going,",
        "19.2": "you know, that guy's going too.",
        "20.2": "And it's like, oh, okay, okay, okay, okay.",
        "22.2": "Then you go and then suddenly, your whole savings plan collapse.",
        "27.32": "I think that's pretty common amongst me and my friends when we were younger.",
        "32.32": "And, you know, it's pretty normal because you just started making money.",
        "36.0": "You want to have fun.",
        "37.0": "You want to do your thing.",
        "38.0": "And I get it.",
        "40.2": "But if your goal this year is to save some money and create a savings safety net for",
        "45.28": "yourself, then I have some tips for you.",
        "48.6": "And today we're going to start by talking about smart savings strategy.",
        "54.72": "So good morning, everyone.",
        "56.92": "I welcome you to another day with the Financial Coconut.",
        "59.2": "In our podcast, we'll be debunking financial myths, discovering best financial practices,",
        "64.04": "discussing financial strategies that fits our unique life.",
        "68.04": "You get it.",
        "69.04": "Ultimately, empowering us to create a life we love while managing our finances well.",
        "74.04": "So today's topic is smart savings strategies.",
        "79.76": "We're going to work really hard and we're really smart to get to our savings goal this",
        "84.56": "year.",
        "85.56": "So it's the start of the year and you're ready to begin everything afresh.",
        "93.4": "Every year, this cycle repeats.",
        "95.4": "And I'm pretty sure one of that goal in your list, it's savings.",
        "100.2": "You want to save a certain amount of money because you're young.",
        "103.52": "You want to be able to prepare a nest for the future and you want to be able to save",
        "108.2": "some money so that you can create a safety net for yourself and maybe even develop a",
        "113.2": "fund for certain big ticket purchases down the road.",
        "116.96": "I get it.",
        "117.96": "Cool stuff.",
        "118.96": "You just got a job, you have some excess money, you want to be smart of your savings.",
        "122.32": "Yeah.",
        "123.32": "By the same time, because you're new, you start making some money, you're easily tempted.",
        "127.64": "You want to buy this thing, you want to do that thing.",
        "130.6": "And yeah, it's very normal because you just started making money and you want to be able",
        "135.56": "to use it.",
        "136.56": "So it's nice.",
        "137.92": "And then on the other end, there are some people that are so afraid to spend and they",
        "143.16": "have a very unhealthy relationship with their money and it pains them when they save but",
        "148.84": "they still save.",
        "149.84": "So I have a friend who told me recently, he's like, you know, I really try to save but every",
        "154.32": "time I save, my heart cringes.",
        "156.04": "It's like, oh, it's so painful.",
        "158.12": "I just keep saving and it affects my quality of life.",
        "161.6": "So she has saved to a level where it affects her quality of life.",
        "164.92": "That means she's not comfortable with whatever she's doing.",
        "168.16": "And to me, that is very unhealthy as well.",
        "170.72": "So how do we reach a point where we are healthily saving money and working towards our goal",
        "177.28": "but at the same time, taking care of ourselves?",
        "179.92": "I think that is where we are looking at.",
        "182.88": "And definitely, it's not easy.",
        "184.92": "It takes time to be able to figure out what actually fits my life, what is something that",
        "189.76": "I appreciate.",
        "190.76": "It's not all just about cutting back expenses when you have surpluses but actually finding",
        "196.0": "out how much do you want to save and how do we go about doing it every month.",
        "200.32": "What is the monthly contribution that we need to achieve this goal?",
        "204.0": "How do we do that?",
        "205.0": "And at the same time, not forget that, hey, there are certain things that are important",
        "208.36": "to me.",
        "209.36": "You know, I love to drink tea.",
        "210.92": "I want to buy good teas.",
        "212.92": "I love to watch musicals and I want to be able to catch a musical a month.",
        "217.72": "I work hard for it and to me, cool, I want to do it.",
        "220.76": "So how do I then balance this whole financial aspects of achieving my savings goal but at",
        "228.64": "the same time taking good care of myself?",
        "230.44": "And today, I'm going to share with you three tips that I thought long and hard and I use",
        "234.96": "them actively.",
        "235.96": "So it's cool.",
        "236.96": "If you have any other tips on your end, I want to hear from you.",
        "240.12": "How do you become a smart saver?",
        "242.8": "And the first thing that I'm going to share with you is to automate your savings contribution.",
        "249.12": "Save before you spend.",
        "250.72": "This is extremely important.",
        "252.28": "I know in Singapore, there's this shop and save.",
        "254.68": "I used to have this supermarket called shop and save.",
        "257.64": "But if you think about it, if you shop, you're not actually saving, you're shopping.",
        "262.56": "What you need to do is save and shop, right?",
        "265.8": "You want to be able to commit to your savings goal or any of these other big ticket purchases",
        "271.88": "whether it's your further development fund or whether it's your mortgage fund, right",
        "276.36": "from the beginning, right from the start.",
        "278.08": "So every month when the money comes into your paycheck bank account, you want to be able",
        "282.92": "to automatically transfer all these money to your savings account or to your various",
        "287.88": "funds accounts.",
        "289.44": "So that is not difficult these days because it's getting really easy to set auto transfers.",
        "294.56": "The banking back ends are a lot easier.",
        "297.64": "So do it.",
        "298.64": "Automated transfers will help you to stay committed to whatever you want to do.",
        "303.2": "So if you want to save money, go and open a new bank account and set that as a savings",
        "307.84": "account and create an auto transfer from your paycheck account.",
        "311.84": "I think that is cool.",
        "312.84": "And one extra tip I'm going to give it to you is that I personally use Maybank for my",
        "318.52": "savings account.",
        "320.44": "I'm going to show you why it's really cute.",
        "322.4": "Because if you think about it, it's very tough to find a Maybank account, right?",
        "325.48": "Really really tough to find a Maybank outlet in Singapore.",
        "330.08": "There are only a few of them, one in Chinatown, one in Raffles Place, you know, in the heartlands",
        "335.12": "it's very difficult to find them.",
        "337.0": "So it makes it tougher for me to go and withdraw money from Maybank.",
        "342.68": "So to me, I think that it was a good shot back then when many things were operating",
        "347.28": "in cash.",
        "348.28": "But I still use this strategy because I want to make it difficult for me to touch my savings.",
        "353.84": "I don't want to make it so simple.",
        "354.92": "If I open a POSB account or a DBS account just for savings, chances are they have easy",
        "359.64": "access all across the island.",
        "361.2": "I could easily get money with that card.",
        "363.84": "And to me, that is just making it difficult for me to save when I could just take a bank",
        "371.56": "that is very scarce in terms of the outreach for money.",
        "376.08": "And then I'll be like, hey, okay, Maybank, right?",
        "378.88": "Very difficult for me to draw money.",
        "380.48": "Cool stuff.",
        "381.48": "I'm going to make it easier for me to save.",
        "383.48": "Which brings me to my second point, is that if you have a savings plan this year, that",
        "387.84": "means you want to save a certain amount of money, share it with the people you trust.",
        "391.64": "How much you want to share for them to keep you accountable.",
        "395.48": "So if you want to save $2,000 this year, share it with the people you trust, share it with",
        "400.52": "your parents, share it with your loved ones, share it with your friends.",
        "403.36": "And then, because you trust them and you want them to keep you accountable.",
        "408.2": "To me, that is extremely important.",
        "409.6": "Because when you do something on your own, especially when you're new and you've not",
        "414.08": "done it before, you've not created a habit to it.",
        "417.0": "Whereas if everyone does it as a collective or someone else keeps you accountable to your",
        "420.8": "promise, that makes it a lot easier for you to do it because you have this emotional binding",
        "427.04": "to get this to work.",
        "428.28": "If you want to take this one step further, you can consider passing your savings bank",
        "433.08": "card to that person.",
        "434.96": "Of course, you don't give them the passcode, right?",
        "436.68": "You just give them the card.",
        "438.84": "And you will create a list of requirements for when these savings can be activated.",
        "444.24": "So they are kind of like your gatekeeper.",
        "447.2": "Give them 5 questions, like, when can you withdraw a savings?",
        "452.08": "When you lose your job.",
        "453.08": "When you lose your job, that means you lose your income, you need your savings to come",
        "455.56": "and back you up.",
        "456.56": "Or when you fall sick or something like that.",
        "460.28": "So you just need to create a list of requirements for when you can touch the savings and pass",
        "464.92": "that to your gatekeeper at the same time when you pass them the card.",
        "468.68": "So that they can keep you accountable and it creates a barrier for you to touch that",
        "473.04": "savings just for splurging, just for spending.",
        "477.36": "And I recommend this person that it's the best for everyone, which is your mother.",
        "482.96": "It doesn't matter how good your mom is financially, how well is she measuring, how well is she",
        "488.48": "managing her finances, but just pass her the card and have her be accountable to you and",
        "493.88": "you be accountable to her.",
        "495.32": "Don't give her the money, don't give her the password, just give her the card and engage",
        "500.8": "her within this accountability process.",
        "504.56": "If you do well this year, that means you manage to hit your savings goal, then buy her a meal.",
        "509.42": "She has done her part in helping you achieve this savings goal for the year.",
        "513.66": "So cool stuff, right?",
        "514.66": "First thing, you automate your savings contribution.",
        "518.18": "Use Maybank or some bank that is not prevalent in everywhere.",
        "521.9": "Next thing is you can pass this bank card to someone that you love and create this accountability",
        "528.58": "element for yourself and for them to keep you accountable too.",
        "532.42": "And of course the third thing which many people don't think about when they think about savings",
        "536.74": "is that maybe you want to set a budget for splurging.",
        "541.58": "So that is what I do and it made it very comfortable for me to save.",
        "546.02": "Because when you are always stuck in this idea that I got to cut back expenses, I got",
        "550.62": "to cut back expenses, I got to save, save, save, it makes it very uncomfortable because",
        "554.34": "you are always thinking of how to spend less.",
        "557.3": "But in actuality, there are certain things that will help you and certain things that",
        "560.82": "you like and you want to do and that's up to you.",
        "563.22": "It's cool stuff.",
        "564.7": "And why not let's factor that in into our expenses which is what I call the splurging",
        "569.26": "account.",
        "570.34": "So I have a bank account which I use for splurging and it depends on how you define splurging.",
        "575.26": "It can be buying new fashion, going to a restaurant, trying new experiences, catching a musical,",
        "582.14": "things that are not vital for your day-to-day survival but may help you to raise your quality",
        "588.16": "of life.",
        "589.82": "And to me that is maybe something like a splurge and I enjoy that.",
        "594.46": "I want to be able to enjoy spending and I want to be able to factor all these kind of",
        "598.58": "random spending and all these kind of random bursts of energy to buy something or do something",
        "603.78": "within my financials.",
        "606.18": "So it makes it a lot easier for me to save, for me to invest when I have a separate fund,",
        "612.34": "a separate account that is dedicated to spending.",
        "616.78": "And emotional spending or splurging or all these different kind of ad hoc expenses.",
        "622.18": "So let's say you set 10 to 15% of your income, maybe about $300, $400, $500 a month on splurging.",
        "629.94": "It's going to make it a lot easier for you to have fun because you are going to be targeting",
        "634.62": "to have fun and splurge and go and do all these things.",
        "638.28": "So it makes it emotionally comfortable to save.",
        "641.66": "And I hope these answers your questions as to how can we be smarter with savings and",
        "646.62": "More often than not, nobody really thinks about savings and spending actually are very connected.",
        "653.06": "So when you create that splurging account, it's going to help you and I hope it helps you.",
        "657.26": "So today I shared with you a few strategies to become a smart saver, to reach your savings",
        "662.26": "goals this year.",
        "663.26": "I'm sure maybe you have some interesting strategies or your friends have executed some interesting",
        "668.02": "strategies and feel free to talk to me.",
        "669.78": "I want to hear from you.",
        "671.58": "And to sum it all up, the three savings, the three smart saving strategies for the year",
        "676.14": "is to automate your savings contribution, save before you spend.",
        "680.02": "Number two, to share your plan with people you trust to keep you accountable.",
        "683.74": "And if you want to take it one step forward, you know, hand the bank card to someone, well",
        "688.54": "maybe your mother.",
        "690.38": "She will be extremely rigorous gatekeeper for you.",
        "693.06": "And the third is to set a budget for splurging so that you become very comfortable with spending",
        "698.9": "and very comfortable with savings because everything is budgeted and is strategized.",
        "705.38": "I want this to make it, I want to make this an easy journey for you.",
        "709.98": "And I hope that this helps and I hope you learn something today.",
        "712.86": "See ya!",
        "713.86": "Hey, I hope you learned something useful today and truly appreciate that you took time off",
        "718.9": "to better your life with the financial coconut.",
        "721.34": "Knowledge is that much more powerful and interesting when shared, debated and discussed.",
        "725.5": "I hope you will share what you have gained with people you love and I want to hear from",
        "729.14": "you.",
        "730.14": "Give me some questions and help me along with building a community of financially savvy",
        "733.46": "coconuts.",
        "734.66": "Email me at thefinancialcoconut at gmail.com or message me at Facebook at the Financial",
        "740.18": "Coconut.",
        "741.18": "I will do my best to address your questions in future podcast series, especially if many",
        "745.06": "people are concerned about the same topic.",
        "748.02": "With that, have a great day ahead, stay tuned next week and always remember, personal finance",
        "753.66": "can be chill, clear and sustainable for all."
      }
    },
    {
      "id": "4",
      "title": "Dating On A Budget",
      "url": "https://www.youtube.com/watch?v=H2G_sKB6yyY",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "So many people have this idea that you know to date you gotta spend a lot a lot of money",
        "4.36": "And you know it's gonna cost you a bomb and no matter how prudent you are the moment you start dating",
        "9.8": "Oh my goodness your bank account is gonna like go for a free fall",
        "14.84": "Maybe you're not wrong because relative to being alone",
        "18.9": "You're gonna be spending a little more, but how do we then be smarter?",
        "22.64": "You know with our finances when we are going for dates",
        "26.92": "That is the question and recently I have been dating so it's really really cool and",
        "32.08": "Yeah, I've been learning along the way. I've been single for a really long time",
        "36.4": "So I'm glad that I'm finally in a position that I can share with you a little bit more",
        "42.28": "About how do you then be financially smart when you date?",
        "46.0": "That is the topic for today three financially smart tip when it comes to dating",
        "52.64": "It's a good morning everyone",
        "54.8": "I welcome you to another day with the financial coconut in our podcast we debunking financial myths discovering best financial practices",
        "62.88": "Discussing financial strategies that fits our unique life you get it ultimately empowering us to create a life",
        "69.2": "We love while managing our finances well and today's topic three financially smart dating tip",
        "77.24": "So",
        "79.76": "Yeah, I firstly do not proclaim to be like some dating guru",
        "83.8": "I like like I don't know a lot of stuff still learning along the way picking up the ropes",
        "88.76": "But I thought you know since many of us are like in our 20s and our 30s and you know",
        "94.2": "Relationship and money is the topic for this month",
        "96.56": "I thought yeah, maybe we should talk a little bit about dating especially when the dating climate has changed so much",
        "101.96": "You know in our generation, you know",
        "104.92": "We so I'm in my 20s so late 20s",
        "108.04": "We are the millennial generation and we are born into this like rapid change",
        "114.36": "Kind of generation where we started out without computers and then with an internet came and then like social media",
        "121.64": "So we're not like our friends in like 20s like now right like people in the 20s or late teens",
        "129.08": "They are born into the internet age. They're born into smartphones",
        "132.88": "And we are not like the really old people. Okay, maybe not really old and a very polite but",
        "138.12": "When you get it, huh? Yeah, those people that like in the 40s 50s our parents era",
        "142.96": "They had a long period of time when you know technology wasn't that much of a thing and yeah dating has their own style",
        "150.24": "So we are in this like changing dynamics, right?",
        "154.36": "it's this period of change and dating has definitely changed over this course and",
        "159.88": "You cannot deny that, you know digital dating is a thing",
        "163.44": "People use tinder people use like coffee bagel people use like grinder people use all sorts of different apps",
        "170.6": "you know that",
        "172.08": "You go and date and then that that is that is you know, it's one",
        "177.28": "Inevitable reality today where you just have to use apps because it just makes it very efficient",
        "184.88": "Actually if you think about it",
        "187.24": "So, yeah, if you're already attached cool stuff, but I hope you listen on, you know",
        "191.08": "Let's just you know",
        "192.36": "Pick our brains and see if we can have more tips for everyone else and you know",
        "196.4": "If you're in this process of dating trying to find that person, you know",
        "199.52": "I've collected some points for all of us and yeah three points as usual and the first point I'm gonna share with you is",
        "206.44": "First dates must always be short and low budget. Okay. What does that mean?",
        "211.96": "So essentially I picked this thing up from this lady called Christina Wallace",
        "217.4": "So if you go to YouTube or you go to Spotify listen to podcast, you know",
        "222.44": "I'm sure everyone knows Ted right Ted talks on Ted talks",
        "226.36": "They're like tons of people talking about like dating, you know, whether it's online dating offline dating or all sorts of stuff. So",
        "234.68": "If you really want to learn more in depth about how to be better data, you know, go go there",
        "240.12": "I think there are a lot of cool stuff",
        "242.12": "But there's this one lady, which is Christina Wallace that left, you know",
        "247.04": "Something that I actually end up adopting which is called a zero date like a zero date, you know",
        "252.92": "Like the first date and then there's a zero of date like the date before essentially it is one hour one drink",
        "259.0": "That's what she said. That's a zero date and her port her video on Ted",
        "263.92": "It's titled how to stop swiping and find your person on dating apps",
        "269.34": "Right, so I thought it was really cool and I actually used it",
        "272.38": "I adopted it and I recommend to a lot of friends this strategy of zero date",
        "277.02": "Essentially, it is low commitment low budget",
        "280.46": "One hour one drink. I don't really like to drink so one hour one scoop of ice cream",
        "284.98": "But maybe you want cup of espresso or whatever, you know, can I always ice cream not getting fatter and fatter and tougher to date?",
        "292.98": "But yes, so that's the whole idea one hour one drink why because",
        "298.62": "You realize that online, you know a lot of times whatever you you you put online",
        "304.66": "You write your bio you write your description and algorithm picks it up",
        "308.86": "But it never really exactly prompts you that kind of person that you really want to have, you know",
        "315.14": "Or some would say like online, you know, you never know who you're really meeting, right?",
        "318.98": "So don't bother chatting with someone for too long",
        "321.8": "If someone seems like they can chat decently then let's try to zero down and get a zero date",
        "327.02": "Meet one-to-one honestly, right if you meet someone for the first time in a few minutes",
        "331.9": "You kind of already get the vibe right and in a few exchange of conversation",
        "336.82": "You will be able to tell like okay this person we can continue to chat or like this person, you know a little awkward",
        "343.06": "I want to go so yeah",
        "345.1": "I think this is a great way of dating very very financially smart and in fact just very smart whether you put it financially",
        "352.5": "or not, right so",
        "354.78": "Arrange to meet the person at your convenience and at their convenience, you know, just for short like coffee or like a you know",
        "362.7": "Ice cream, you know short odd hour one hour kind of thing like 8 o'clock 9 o'clock",
        "368.94": "After work or like 2 p.m",
        "371.9": "Post lunchtime or you know",
        "374.24": "You want to have very very low kind of commitment to this kind of dates because come on man",
        "381.14": "Open up, you know your time",
        "382.66": "You gotta open up your your custom net wider so that you can meet more people right and at the same time",
        "387.34": "it's honestly super awkward, right if",
        "390.66": "You arrange to meet someone to have the first date, which is the Makan, you know",
        "395.42": "You sit down together you expect a one to two hour to three hours kind of kind of thing and then the first five minutes",
        "400.78": "You're really super turn off because you know the photo and the person looks like a different",
        "405.18": "I",
        "406.5": "Just look super nice, you know can chat but you know when when it comes to real life, you know, it's just so bad",
        "412.82": "and it's pretty common so",
        "414.78": "Yeah, we want to be smart go for the zero date one hour one drink right low commitment",
        "420.46": "High frequency kind of thing right just do it",
        "423.46": "Everyone does that and I recommend that to quite a few of my friends and actually quite a few of them used it and you",
        "429.8": "Know some of them actually dating now like serious dating, you know",
        "433.4": "and and it's really really cool because it works and",
        "436.36": "And when I see it is like financially super smart because you know, how much can a cup of coffee cost $6?",
        "443.12": "Ice cream is $6",
        "444.24": "You know",
        "444.64": "It's just very very very easy way to verify the individual to then decide whether you want to further invest",
        "450.96": "Right rather than you arrange for a meal. Oh my goodness. So expensive is so awkward",
        "455.24": "Right, so, you know do it right zero of date first date must always be low budget and sure which brings me to my second point",
        "462.8": "The second point to be financially smart when we are dating is to always a a always go Dutch",
        "470.0": "But at least for the first few times that you guys are meeting right first ten times",
        "474.2": "Let's let's do ten times why because I think that you know",
        "479.44": "Society has reached a level where you know, it is kind of given for both parties to be working",
        "486.4": "Right, and we all want this",
        "489.16": "Ultimately, we all want to have like a financial",
        "492.24": "Healthy financial life together. I want a beautiful life. We want a dream life. I want to create a family, etc",
        "499.24": "Whatever you want to do it. You cannot run away from finances. So right from the get-go",
        "503.6": "I feel that we need to set the expectations, right a lot of guys, especially",
        "508.68": "till today have a lot of you know have this kind of",
        "513.88": "Perspective that you know guys need to treat girls, right?",
        "516.16": "You know, if you're in a guy-guy relationship go-girl relationship, whatever it is, you know, there's always this like masculine",
        "523.96": "Partner that needs to be the one treating, you know, or in general. Okay these days I'm relationship",
        "529.66": "Have to define but the idea is about adjusting expectations because right from the very very start",
        "535.86": "you don't want to be on the grounds that you're always treating and it's it's a it's firstly a very bleeding process and",
        "542.7": "Secondly, it's like you want the other party to also be committing, you know",
        "547.54": "Financially because it is it is true that when someone commits financially that they feel, you know",
        "553.64": "They feel the pinch and when they feel the pinch they actually do more, right?",
        "557.66": "I think that is extremely important and I'm not being like sexist or something",
        "562.82": "But you know if especially ladies right when we talk about what I know a lot of ladies these days",
        "568.3": "Talk about like, you know, you want to be the independent women equal rights, etc, etc",
        "573.14": "Which is beautiful by the same time if that is the case, right then, you know",
        "578.3": "Please don't expect guys to treat because across the board",
        "581.98": "I still hear a lot of people telling me the guy must treat my first time I must treat one",
        "586.74": "I was like my goodness seriously times have changed you are making money. The guy's making money",
        "591.7": "Everybody's you know, we're all making about the same and we're all trying to create a life together",
        "596.38": "So right from the get-go set the expectation right always a but of course if you're together and it's a stable relationship already",
        "603.42": "Then yeah, you will be less calculative, you know, that's kind of how it works",
        "607.7": "But right from the start don't bother treating right don't if money it's what impresses the other person",
        "614.34": "You know then and I don't know what to say right if someone say but treat very gentleman",
        "619.38": "But okay, there are many other ways to show that you are a gentleman open that door, you know",
        "623.78": "Pull that seat usher her in usher him in whatever, you know, just",
        "629.94": "Yeah, it's not about paying for the bills, right?",
        "632.26": "So always a right remember that and brings me to my third point which is practice",
        "638.06": "small random gifting",
        "640.9": "I think this is very interesting and you know",
        "644.94": "Very smart if you ask me because you realize that you know these days there are like a lot of events right a lot of my",
        "651.38": "Holidays you have Christmas your Valentine's Day",
        "653.94": "You have you know all sorts of activities to try to get you to spend and a lot of these things right honestly have been",
        "661.9": "over-commercialized a lot of all these holidays and it forms this",
        "666.42": "Expectation that you need to gift",
        "668.78": "But you also realize that during the holiday",
        "671.22": "Everything is very expensive",
        "672.94": "You go to the restaurant is two three times the price you buy a bouquet of flower is like ten times the price",
        "678.62": "You know why because people only buy flowers during that period of time, you know, at least that's that is the common understanding",
        "685.94": "So everything becomes super expensive and it's not like it's it's honestly just a flower. It's a meal, right?",
        "693.14": "It's not gonna like change this impression change the impression of of the individual to you and I'm gonna build really deep relationships",
        "700.54": "but what I observed is that",
        "703.18": "When you start to gift, right gifting is beautiful",
        "706.46": "It's a great way to show that you can show that you know",
        "709.74": "the person that you are interested in is within your you know sphere of thought and",
        "715.98": "When you start to give at random, right? You just buy like a pair of socks, you know buy like",
        "721.66": "You know a pen you see something interesting buy a bag of chips, you know",
        "726.38": "Because he or she said that they like that, you know",
        "729.66": "And then you just buy it because you just remember and you're really near of course",
        "733.56": "Don't do it every day because it becomes be crazy. But you know do it random small",
        "739.02": "Gifting it really makes an impact because the person",
        "742.58": "Realizes that you remember them and you are listening to what they say when someone say they like something",
        "748.02": "You know like they really like garret popcorn they just buy garret popcorn",
        "752.3": "Right. It's not very expensive by odd periods of time and then just small little pack give it to them",
        "757.66": "And yeah, they will remember you because you remember them. So practicing small random gifting adjusts the whole game",
        "765.7": "There's no longer this expectation",
        "767.82": "Building up to like holiday, you know",
        "769.94": "Valentine's need to give something know because you're already randomly gifting a lot of stuff and it can be made known in this",
        "777.16": "Relationship that you know, we're not gonna be funneling into consumerism, right? We we care for each other. We want to get to know each other and",
        "784.84": "Yeah, it's not about subscribing to this kind of holidays",
        "788.96": "All right, so let them know that you care let him or her know that you care true random small gifting",
        "795.68": "It's got to be super helpful for your day",
        "797.68": "And at the same time it's gonna be financially super smart compared to like you wait until Valentine's Day",
        "802.76": "I think the whole world is expecting a gift of Valentine's Day and then yeah, you're gonna cause a bomb is gonna be crazy",
        "809.08": "So yes, three short tips for today, and I hope you learn something right? I'm gonna sum it up three",
        "815.48": "Financially smart dating tip and the first tip is on the first dates",
        "819.52": "It must always be short and low budget practice zero date",
        "823.36": "All right practice the zero date if you want to hear more",
        "825.92": "Please go to TED talk and search for Christina Wallace how to stop swiping and find your person on dating apps",
        "832.64": "I think that is really really cool",
        "833.96": "And the second tip is always a at least for the first few times that you guys are meeting, you know",
        "839.32": "You want to adjust adjust expectations right from the get-go, you know, I'm not sure if it really fits",
        "845.24": "You know the kind of description that you want",
        "847.44": "But in my view, I want to build a relationship where both of us are carrying the financial load in this in this relationship",
        "854.92": "So to me right from the start we got a practice a a just expectations and the third point is practice small",
        "861.92": "Random gifting right these will let the other party know that you actually care about them and you're listening to them",
        "867.96": "Right and not build this expectation that you need to be gifting on special days and it will not burn your wallet",
        "873.6": "Right. So these are the three financially smart tip smart dating tip and I hope you learn something useful today. See ya",
        "884.2": "Hey, I hope you learn something useful today and truly appreciate it",
        "888.0": "It took time off to better your life with the financial coconut knowledge",
        "891.72": "Is that much more powerful and interesting when shared debated and discussed?",
        "895.6": "I hope you will share what you've gained with people you love and I want to hear from you",
        "899.4": "Give me some questions and help me along with building a community of financially savvy coconuts",
        "904.2": "I hope together we can fulfill our curious minds and our desire for clarity",
        "908.28": "Email me at a financial coconut at gmail.com",
        "911.48": "Message me on Facebook or join our telegram group. Just search the financial coconut",
        "917.04": "I will do my best to address your questions in a future podcast series",
        "921.24": "Especially if many people are concerned about the same topic with that",
        "925.56": "Have a great day ahead stay tuned next week and always remember",
        "929.6": "Personal finance can be chill clear and sustainable for all",
        "947.04": "You"
      }
    },
    {
      "id": "5",
      "title": "Budgets For A Relationship",
      "url": "https://www.youtube.com/watch?v=KzMJSFXqTgQ",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "Hey, good day everyone once again welcome back to the financial coconut and today",
        "5.6": "We're going to talk a little bit more about you know the different kind of",
        "9.36": "Budgets that I think it's great to have in a stable relationship because you realize that you know many people",
        "18.48": "They quarrel and they have disputes over spending habits",
        "23.04": "They have disputes over like you know I want to do this, but you know my boyfriend girlfriend doesn't want to do that",
        "28.52": "You know etc etc and all these kind of different things actually",
        "32.84": "Will build up into a future when you when you guys get married",
        "38.0": "Right and you start to see a lot of families have a lot a lot of financial issues",
        "43.8": "Whether is it a difference in financial lifestyle?",
        "47.08": "What is it you know actual financial breakdown because you know they're not been doing all that",
        "53.04": "They need to do to build their financial safety net to invest into the future and do all those different things",
        "58.12": "What is it just because recession hits loss of income and then something happens?",
        "63.52": "so all those",
        "65.12": "Little little stuff that you know we're gonna talk about when it comes to marriage",
        "69.94": "We're gonna do it next week with our special guest in-house how to create a successful",
        "75.96": "Marriage while managing finances well, but today today",
        "80.4": "We're gonna focus on if you are in a stable relationship already that means you guys have been together for a while",
        "87.24": "No longer dating. It's like exclusive and it's stable",
        "91.08": "What are some of the budgets that will help you to further flourish your stable?",
        "97.52": "Relationship so today. It's about three budgets to have in a stable relationship",
        "104.0": "So good morning everyone. I welcome you to another day with a financial coconut in our podcast",
        "110.04": "We'll be debunking financial myths discovering best financial practices",
        "113.88": "Discussing financial strategies that fits our unique life you get it ultimately empowering us create a life",
        "120.56": "We love while managing our finances well today's topic is three budgets to have in a stable",
        "129.56": "relationship",
        "132.12": "So yes after you date",
        "134.28": "You know you go through all these you know crazy period of trying to find someone that is worthy of",
        "141.88": "Developing further you wanna then you move into this phase of what many people will call a stable relationship",
        "149.48": "But in actuality is not very stable",
        "153.36": "Both trying to understand each other you're still going through this period of",
        "157.44": "Connecting and discovering and trying to get to know each other better all the nooks and crannies of an individual",
        "163.6": "But one thing is certain is that you both of you are ready to invest that means you have already",
        "170.16": "You know reach a point where you decide that okay?",
        "173.36": "We can invest in this relationship that we want to take this further doesn't mean is marriage",
        "178.8": "There is still very further down the road, but it's like we are ready to commit",
        "185.0": "Yes",
        "185.5": "What is commit to each other and ready to start to get to know each other on a much deeper level that is a stable?",
        "192.72": "relationship",
        "193.8": "At least in my view yeah",
        "196.48": "I mean if you are like super modern like polyamory or like",
        "202.92": "You know whatever then then that is a whole different ballgame. You know it's like I can't",
        "208.0": "Whoo whoo? I don't know man, but yes if you are in a stable relationship",
        "213.36": "I feel that there's certain things that we can do to you know get to know each other better and really just",
        "219.16": "Dive deeper and dig deeper into this relationship to then ultimately decide that you know",
        "225.24": "Do we want to bring this even further to get married or to?",
        "229.92": "Confirm that this will be our life companion whether or not you get married",
        "234.68": "Okay, so the first thing that I feel the first budget that I feel you should have in a stable relationship is a common",
        "242.52": "household budget I",
        "244.84": "Get it a lot of people when they are still dating not married yet, right?",
        "248.68": "There isn't this idea of a common household budget because you're not a household yet",
        "253.96": "Right and then suddenly when when you get married",
        "257.24": "Out of a sudden there needs to be a common household budget because you live in the same house",
        "261.64": "You're gonna commit to many different things",
        "264.0": "but if we think about it to be able to get to that phase of like marriage and",
        "271.16": "Managing money together why don't we roll back a little bit slightly before marriage when things are stable?",
        "277.84": "to actually create a common household budget that we can you know use it to",
        "283.36": "Buy daily monthly kind of boring needs right like your shampoo like your grocery",
        "291.36": "You know all those very",
        "293.48": "mundane day-to-day kind of stuff of course if",
        "297.16": "Both of you are not together yet like you're not living together yet",
        "301.24": "That is more accurate if you're not living together",
        "303.08": "Then it can be a more creative way of managing a common household budget like a common Makan budget law",
        "310.12": "Right that means everybody commit to maybe $300 to $500 of Makan budget",
        "314.88": "And then you know we'll just draw down from here as we go along the important part is really about",
        "321.4": "managing money to get the managing small sums of money together to ultimately lead to",
        "328.0": "Managing money to get there because when you get married",
        "331.6": "I feel that you know it is it is a it is a given that you should manage money together as a collective",
        "338.2": "I don't really subscribe to the idea that you know you pay this I pay that and then just kind of point fingers at each",
        "345.16": "Other is like why you never do this why you never do that?",
        "347.2": "but actually when we are in when we are team when we are married when we are together when",
        "352.76": "You know for whatever reason that you ultimately decide to settle down this person",
        "357.04": "The goal is to support each other and not blame each other so in my view we need to manage money",
        "362.48": "Collectively so pre-marriage in a stable relationship state right you should already start to look at how to",
        "369.4": "manage a common budget",
        "372.04": "Right and I will just call it a common household budget",
        "375.32": "So of course it will be great if you shift in together",
        "378.04": "And you know start to get to know each other's day-to-day life because it is very different a weekend you go to",
        "384.44": "Your partner's place to you know have fun have sex right then",
        "387.72": "Then life carries on on the weekday, and then you meet up one of the nights",
        "391.0": "You know it's very different compared to when you live day to day together, and I understand that in Singapore",
        "396.88": "It is very expensive. You know rental prices are like just rent a room rise like six hundred dollars seven hundred eight hundred",
        "402.72": "Or depending on where you are at of course",
        "406.52": "You know it is very expensive, and I get it, but I highly recommend you to do it",
        "412.56": "you know whether or not it is expensive because",
        "415.64": "To me it is like yeah, you can see the renting a space together",
        "420.24": "It's very expensive, but when I look at it to commit to a life together. It is more expensive",
        "425.96": "Right so there must be a precursor and that precursor will be great if you know you can live together for a year",
        "433.32": "Just kind of do it",
        "434.8": "You know try it and see whether you can live together and manage that kind of common household budget",
        "439.88": "But if you are not at the level where you are staying together you can still manage a common household budget like what I just",
        "446.36": "recommend you to like you know manage a",
        "449.56": "Common Makan budget right so every time we go out together",
        "452.72": "We will draw down from this budget that will be great for everybody to start to learn and you know",
        "458.08": "Do this thing as a team rather than an individual which brings me to the second budget that you should have in a stable",
        "466.56": "Relationship and this budget is called the his or her budget",
        "470.6": "Essentially you realize that in this process of getting to know each other",
        "474.76": "There will be a lot of differences definitely there will be some similarities a common interest etc. But there are a lot of differences",
        "482.68": "you may be born into a different kind of family structure very you know dynamic by itself and",
        "490.72": "There will be lifestyle differences because you are brought up in a different",
        "494.6": "Structure you're brought up in a different culture so everyone is different you come together",
        "498.52": "That is definitely differences and the common difference and some of the common differences is you know one person wants to spend on",
        "506.64": "This thing and the other person does not want to spend on that same thing like maybe some like the lady like to spa like",
        "512.48": "She really loves to go to the spa, but a guy looks at is like wish amore",
        "516.12": "Why you know so boring or like the you know like the guy really likes to travel",
        "521.88": "But the lady doesn't like to travel or maybe the guy likes to travel and the other guy likes to travel also",
        "526.92": "You know so you realize that there are many different dynamics. You know between partners and different kind of lifestyle",
        "534.48": "Differences right and if you don't manage this properly it can become a problem, but when I look at it",
        "540.5": "How do I do it? It's like I always dedicate a certain amount of budget to his or her budget",
        "547.04": "Essentially is I know that if my partner likes to eat at a restaurant",
        "552.6": "I'm not a huge fan of restaurants",
        "554.8": "Especially where I live I'm living in subang now and in KL a lot of restaurants are not good enough",
        "560.96": "Because for the price you pay the things that they provide you is just not exciting enough for me because I cook really well",
        "567.64": "Okay, okay, at least everyone say I cook very well",
        "570.24": "But so that is how I look at it when my partner likes to go to the restaurant, but I personally don't like it",
        "577.04": "but it is it is a",
        "578.96": "It is a torn in the eye you know when when one one person really likes to go to restaurant the other person really just",
        "583.88": "Don't want to go so what I do I set a budget for it, so I know that",
        "589.04": "You know my partner likes likes to likes to go to the restaurant",
        "592.24": "I set a budget and when I look at it, so okay",
        "595.04": "I become a lot more emotionally calm to you know go on that",
        "601.28": "Direction of spending when it is not my interest right to me that is very important because sometimes",
        "607.04": "You know you never know what you learn in that process. You know like",
        "611.84": "There must be a reason why him or her likes a certain thing",
        "616.52": "So why not you know give yourself the little bit of budget to then explore that interest of them",
        "623.76": "With them so then you can you know get to know each other better and talk about it",
        "628.08": "It's like why you actually really like to come to restaurants",
        "630.72": "And then they will share with you and that is a great way to learn about each other and to manage that kind of lifestyle",
        "637.36": "Differences because you bound to have lifestyle differences right and trust me everyone likes to spend okay",
        "642.52": "They just like to spend on different things like my lot my friends think I don't spend money",
        "646.8": "It's not because I don't spend money",
        "647.84": "I just like to spend on certain things like I love to go backpacking and travel and get a new",
        "652.84": "Experiences and that is not something that everyone likes so there's always",
        "657.48": "Differences in spending different kind of things that you like to spend on so set a budget his or her budget",
        "664.2": "Specifically to cater to their needs right so if he him or her really likes to go rock climbing",
        "669.72": "You don't like it right",
        "670.72": "But you know you just dedicate a small budget and time to go and do do with him or her so that you get to",
        "676.28": "Know each other better so to me that is extremely important and the third budget",
        "680.68": "I'm gonna share with you is something that I feel everyone should have whether or not you're in a relationship",
        "686.92": "But in a relationship, this is you know especially important. It is what I call the",
        "692.88": "exploration budget",
        "694.92": "So many people stop exploring right they did you know a lot of people always say well. I'm very boring",
        "699.68": "I really do the same thing then I'll say what have you done differently",
        "702.84": "What have you tried differently you realize that many people's are no law",
        "706.44": "I just go back what go back home after work, and then you know the cycle just repeats",
        "710.72": "And of course you will never get new new experiences. You'll never see new insights because you stop exploring",
        "717.32": "When we're younger we are always exploring trying new things pushing boundaries, but as we go along somehow another",
        "724.04": "You know for whatever reason we go into repeat mode repeat repeat repeat",
        "728.84": "Which is fine because repeat creates something if you think about it right civilization only grew when",
        "735.36": "Nomads decide to sit down stay at one place and repeat built built built farm farm farm grow grow grow",
        "742.08": "But the reality is it gets boring because you're doing the same thing again and again and again so in a relationship",
        "748.12": "This happens also right you're always doing the same thing because after a while if you reach your equilibrium",
        "753.52": "You know what they like they know what you lie, and then you're always doing the same thing",
        "756.56": "It gets a little bit boring",
        "759.64": "So why not both of you set a common budget called exploration budget and do it set a time set a set a budget",
        "766.84": "And you don't go and try something different like go and go for a hike",
        "770.56": "You know go and try this new",
        "773.2": "Experiential dining place, so I'll go and pick up like art together",
        "777.32": "Go for a dance class together try things that you guys will never do in in",
        "783.24": "For for the eternity of your life so far and that will be very very fun because you share common experiences you build common",
        "790.64": "Experiences and in my view that is one of the best way to you know build",
        "794.6": "Understanding and build the relationship and get to know each other better to ultimately decide that do you want to take this even further?",
        "801.84": "right so",
        "803.56": "Do it man",
        "805.36": "Exploration budget and if you try something new try something interesting and you found that really really useful",
        "811.04": "You know between your partner, please share with me. Please share with us",
        "814.72": "We all want to build better relationship, and we are all looking for interesting activities to go for so with that",
        "821.16": "I'm gonna sum up today three budgets that you should have in a stable relationship number one is a common household budget to test run",
        "829.16": "Before you get married together right try to manage a common budget together",
        "833.88": "Before you know you take on this one step further on marriage and the next budget is a his or her",
        "839.24": "Budget because you both have lifestyle differences you want to be able to you know feel emotionally calm when you spend in their interest",
        "847.52": "And not yours, but through this process you will learn a lot of things about him or her right so that will be fun",
        "852.92": "And the third budget is exploration budget where both of you will try something that both of you never done before",
        "858.84": "To experience new new aspects of life and get to know each other better, so I hope you learn something useful today. See ya",
        "869.16": "Hey, I hope you learn something useful today and truly appreciate a two-time off to better your life with a financial coconut",
        "875.92": "Knowledge is that much more powerful and interesting when shared debated and discussed",
        "880.44": "I hope you would share what you've gained with people you love and I want to hear from you",
        "884.52": "Give me some questions and help me along with building our community of financially savvy coconuts",
        "889.56": "I hope together we can fulfill our curious minds and our desire for clarity",
        "893.8": "Email me at the financial coconut gmail.com message me on Facebook or join our community telegram group the financial coconut",
        "901.72": "I will do my best to address your questions in future podcast series",
        "905.92": "Especially many people are concerned about the same topic with that have a great day ahead stay tuned next week and always remember",
        "913.8": "Personal finance can be chill clear and sustainable for all",
        "923.28": "You",
        "953.28": "You"
      }
    },
    {
      "id": "6",
      "title": "Maximize Your Budget Travels With These Tips",
      "url": "https://www.youtube.com/watch?v=_kt-cshQv3w",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "Everyone gets AT&T's best deal on the new iPhone 14 Pro with the incredible camera.",
        "5.44": "So, people currently listening to comedy podcasts, and people listening to political podcasts,",
        "12.0": "and people listening to true crime podcasts who actually can't stop listening to true",
        "15.64": "crime podcasts and it's ruling their lives.",
        "17.82": "The point is, everyone, new and existing customers.",
        "21.88": "Ask how to get up to $800 off the new iPhone 14 Pro with eligible trade-in.",
        "26.16": "Visit att.com or our stores for details.",
        "28.92": "Terms and restrictions may apply.",
        "58.92": "Good morning everyone.",
        "64.8": "I welcome you to another day with The Financial Coconut.",
        "67.32": "In our podcast, belonging financial myths, discovering best financial practices and discussing",
        "71.32": "financial strategies that fits our unique life.",
        "74.88": "You get it.",
        "75.88": "Ultimately, empowering us to create a life we love while managing our finances well.",
        "80.04": "So we are back today and I'm going to talk a little bit about some of these budget travel",
        "83.64": "ideas, some of these budget travel tips.",
        "87.2": "And like I've established in the early part of the podcast, it is not about spending very",
        "92.36": "little without some sort of context.",
        "95.04": "Because the basics here is that budget travel, it's about getting the most for the least",
        "100.32": "that you spend.",
        "101.32": "And to be fair, actually even people who have spent a lot of money, they also want to get",
        "105.44": "the most out of what they spend.",
        "107.96": "It's just about how do you then see what do you want?",
        "112.04": "What do you value?",
        "113.44": "So I think that's kind of where things are.",
        "116.44": "But okay, let's just go simple and just the idea of budget travelling where you spend",
        "120.64": "the least, try to get a lot.",
        "122.92": "And of course, the standard culprits are there, travel off-season, travel longer.",
        "128.36": "Because those are like, you amortize, right?",
        "130.68": "Essentially, if you travel for one week, your air ticket, you divide by seven days, that",
        "134.6": "is the cost of travelling.",
        "135.6": "But if you travel a month, then the air ticket divided by 30 days, your per day ticket price",
        "140.24": "is a lot lower.",
        "141.32": "So those are the usual culprit.",
        "143.24": "You can use your mouse, don't stay hotel, stay Airbnb.",
        "149.88": "Pretty much those are the standard culprit and I am not interested in repeating what",
        "154.16": "people are talking about.",
        "155.16": "I'm sure there are a lot of other content out there and you really don't need me to",
        "158.24": "tell you to travel off-season.",
        "159.24": "It's like June holidays, everyone's flying, of course it's very expensive.",
        "163.24": "But of course, if you are a parent, then it's a bit problematic, I get it.",
        "167.28": "But for every one of you that have the optionality and the ability to move around and travel",
        "171.84": "and are looking for some insightful tips and tricks, I'm here to share with you today.",
        "177.16": "Okay, but before I begin sharing with you my tips and tricks and ideas, I must establish",
        "184.8": "my legitimacy that I actually know how to do these things.",
        "188.04": "So this is my passport.",
        "189.68": "I'm just looking through and I have been to 2019, May, I've been to Japan.",
        "195.56": "Of course, frequent Malaysian travel.",
        "198.0": "I was staying in Malaysia for a while, so you get the idea.",
        "201.64": "Where else have I been to?",
        "203.56": "I have definitely been to Korea, but probably not in this passport.",
        "206.6": "I've traveled to Turkey, Georgia recently.",
        "210.2": "This is my Istanbul check-in.",
        "213.32": "So yeah, for all of you that are listening in through audio, then you cannot tell that",
        "218.28": "I'm flipping through my passport.",
        "219.28": "Okay, but the idea here is I'm trying to establish that I know my shit.",
        "222.8": "I've been traveling around and I have tried many different ideas and I've kind of just",
        "227.48": "think of all these things a little bit better.",
        "229.28": "How do I squeeze the most out of my money?",
        "233.24": "So barring aside traveling long-term, that means you're going to just be on the road,",
        "237.2": "you're going to travel and have fun and work along the way.",
        "239.92": "Barring aside all those things, these are some of the ideas that I have.",
        "243.76": "And it brings me to point number one.",
        "246.88": "And point number one is to watch out for airport taxes.",
        "251.28": "Okay, a lot of people tell you travel off-season, travel budget, use miles, all that aside.",
        "256.44": "But just a very basic idea that if you travel out from Singapore's airport, there is quite",
        "262.64": "a heavy airport tax as compared to if you fly from Johor.",
        "267.36": "You don't believe me, you go and try.",
        "268.92": "I've talked to a lot of friends about this thing.",
        "271.88": "Instead of flying out from Singapore, which a lot of people maybe stay in the West, stay",
        "275.84": "in the North, then they come all the way to Changi to fly out of, which okay, to be fair,",
        "279.84": "there are a lot of options.",
        "281.2": "But if some of the places you are trying to fly to, let's say Guangzhou, some of the other",
        "284.68": "places that I cannot remember exactly where, but Johor does provide.",
        "288.2": "I think Bangkok, the airport has a few of these kind of airlines, at least these kind of routes.",
        "294.28": "So if you stay in Woodlands, Jurong, all those places, actually you can consider taking a",
        "298.6": "day trip to Johor and just take this as a way of travelling.",
        "303.44": "Because when you do that, actually save a lot of money from flights.",
        "306.8": "Go and take a look at Johor.",
        "308.88": "Another data point I've gathered is recently I'm planning my trip to London.",
        "313.52": "So flying into London from KL's airport is not that expensive, right?",
        "318.72": "It's cheaper, a few hundred dollars.",
        "320.28": "But flying out of London directly is very expensive.",
        "323.8": "Of course, I've done some Googling here and there, and you realise that all these hub",
        "327.6": "places, right, whether it's Dubai, whether it's London, Singapore, Hong Kong, all these",
        "331.4": "airport hubs, they make money from the airport.",
        "333.8": "And how do they do that?",
        "334.8": "Airport taxes.",
        "336.24": "So after a while, I've learned to be able to plan my trip and take that travel as part",
        "341.98": "of the trip itself.",
        "343.48": "So going to Johor one day, then I fly out from Johor.",
        "346.76": "Let's say my plan this time round is to fly from KL to London.",
        "351.8": "This is my July trip, KL to London.",
        "353.76": "And from London, I'm going to move all the way down to Barcelona.",
        "356.52": "And then from Barcelona, I'm going to fly out.",
        "358.4": "So some people will be like, oh, this is so tiring, got to move around so much.",
        "361.88": "So okay, on average, maybe two weeks, three weeks trip, these kind of things make a lot",
        "366.4": "of sense.",
        "367.4": "So you kind of plan your route along with this idea that, oh, I can save a few hundred",
        "373.02": "dollars just to fly out of a particular airport.",
        "375.98": "And you can always make the trip a fun trip.",
        "378.66": "Don't think of travel as this, like, oh, I'm going to get from one spot to the next spot",
        "382.98": "to the next spot.",
        "383.98": "And definitely, you'll feel very tired.",
        "385.94": "And it doesn't help that there's a lot of travel agency in the past that make you do",
        "389.86": "that, right?",
        "390.86": "You hop on the bus, you go to the next stop.",
        "391.86": "It's very irritating, very annoying.",
        "393.46": "But if you think of this as a way of moving from point to point, as part of the travel,",
        "399.92": "as part of the journey, as part of experiencing new things, then this idea of, oh, maybe I",
        "404.72": "can move to another airport that's a little bit cheaper, you know, it's not that much",
        "408.92": "of a problem anymore.",
        "410.72": "And of course, some cities have multiple airports, so you can check all of their routes.",
        "415.32": "Just watch out for airport taxes.",
        "416.84": "Rule of thumb, air hubs always very expensive because that's the way they make money.",
        "423.04": "Which brings me to point number two, and that is to stay further away from the city center.",
        "429.34": "It's very intuitive and it's like, do I really want to do that?",
        "432.82": "I'm going to expand.",
        "433.82": "I'm going to expand this idea after a word from our sponsor.",
        "442.18": "So okay, I'm not like some kampung traveler.",
        "446.14": "I always go to the kampung, I always go to the outskirts of the city.",
        "450.3": "I'm a big fan of living in like slightly more outside because it's quieter.",
        "455.42": "You get to see more of the local life.",
        "457.66": "You get to experience the way of life of the local people.",
        "461.72": "Like a lot of people travel to Bangkok, okay, very common, but how many of you actually",
        "466.36": "been to this place called Talaplu?",
        "468.16": "Right, so I stayed there because my friend was staying.",
        "471.36": "I was sort of bunking with a friend.",
        "472.36": "Of course, that's another tip, right?",
        "474.22": "Have a lot of friends and bunk in with them.",
        "476.44": "You save a lot of money on lodging.",
        "478.36": "Thank you, friends.",
        "481.36": "That aside, because I did that, I get to experience the life of the local.",
        "485.7": "Apparently, Talaplu, which is a place in Bangkok, was where the Cantonese people and the Hokkien",
        "491.46": "people, essentially the Chinese people, when they first landed in Thailand, that's one",
        "495.3": "of the big places where they gathered.",
        "497.54": "So when you go there, you can still hear Cantonese, Hokkien, you know, just some dialect.",
        "501.94": "A lot of old people there are still speaking in that way.",
        "504.98": "It's very interesting.",
        "505.98": "It's like a Chinatown.",
        "506.98": "There are a few streets, a lot of food around.",
        "509.78": "It just feels super, super local.",
        "511.9": "Some of the best kueh shop, the best wonton mee shop I had in Bangkok itself is there.",
        "518.16": "So go and check that out.",
        "519.16": "Check that out.",
        "520.16": "It's an interesting, fun place.",
        "521.16": "But the idea here is first you need to understand how tourist places are developed and how do",
        "527.56": "they come about.",
        "528.56": "Barring aside all those big capital injection right from the get-go like your Disneyland",
        "533.76": "or in China, they have all these very ugly touristy spots that are like out in the weird",
        "539.62": "mountains and then you have to drive all the way there.",
        "541.98": "You go there and very cheesy, very old school.",
        "543.82": "Nobody goes there anymore.",
        "544.82": "Barring aside all those spots that are specifically made for tourism, most other tourist spots",
        "551.26": "like your Osaka walking shopping street or your Jonker street or even Chinatown in Singapore,",
        "557.7": "they all started as a place where the locals will go to.",
        "561.66": "So they were interesting, they were fun, the locals go there, a lot of people go there.",
        "565.3": "So other tourists start to come in, right?",
        "566.96": "So this is where all the locals hang out, everybody go there.",
        "570.0": "And then what's the next step?",
        "571.0": "The next step is money will come in.",
        "574.36": "Capital will start to come in to capitalize on this place, right?",
        "577.44": "So that they can open their shops, sell to the tourists because the tourists will give",
        "581.72": "them a bigger margin, blah, blah, blah.",
        "583.44": "And then it will squeeze out all these smaller merchants, right?",
        "586.16": "Because they cannot afford on the main street now.",
        "588.6": "So what happens?",
        "589.6": "They will shift to the sides of the streets or even further out.",
        "593.16": "But the fun part lies here.",
        "594.6": "The fun part is if you only go to the main tourist street, you will not be able to see",
        "600.06": "where the original merchants are.",
        "601.5": "Try to go to the left, to the right, go to the side streets that are around the area.",
        "605.22": "They tend to hover around the same place because they want to cater to the same crowd that",
        "609.34": "they've always catered to but they cannot afford the rent in pretty much the prime street",
        "614.3": "where they started.",
        "615.46": "So go to the side streets, you'll see a lot of local stuff, very fun, very interesting.",
        "620.22": "And why do I put it that way, right?",
        "622.16": "So when you understand how capital comes into, capitalise on this kind of tourist destination,",
        "627.64": "then you start to realise that at some point, the whole touristy area is built for tourists,",
        "633.16": "like Istanbul.",
        "634.16": "So if you go to Istanbul and you stay where the big mosque is, the Blue Mosque, you stay",
        "639.36": "where the Constantinople Wall is, everywhere is extremely touristy.",
        "643.8": "The Grand Bazaar, blah, blah, blah.",
        "646.6": "Honestly, as someone that travels frequently and is trying to go there and understand local",
        "651.22": "culture and understand how people live, what is it like here, it's horrible.",
        "657.5": "Touristy spots are horrible.",
        "658.5": "I know it's very convenient, you go down there, you get all these things but they are all",
        "662.18": "very artificial and is that really the kind of travel experience that you want?",
        "667.14": "Like I said, back to the point number one, which is travel can be part of your plan.",
        "671.5": "And I know a lot of people are very annoyed because every morning, I work, I shower, I",
        "677.3": "carry my bag, 7, 8am, I go on the MRT, I get to my workplace, I'm done, I come back.",
        "682.32": "So a lot of people have this annoyance about travelling but if you move around in a new",
        "686.44": "place, that's actually very fun, very interesting.",
        "689.52": "You're seeing all these, wow, what's that, what's that, what's that.",
        "692.32": "So there's a lot of things to discover on the go.",
        "695.68": "Do not let the jadedness that you have in your routine in your current life affect the",
        "700.4": "way you travel.",
        "702.66": "So big fan of staying in the outskirts of the city, especially when I was in Osaka.",
        "707.74": "I did stay in the prime area, in the middle of the city but after a while, I was like,",
        "712.06": "you know, and then I went all the way out nearer to this other shrine, I can't remember",
        "716.18": "the name but that was when I felt the way of the life of the locals.",
        "721.74": "And I would say for more of you, if you're listening in, please try to travel and please",
        "727.5": "try to live in the outskirts.",
        "729.14": "It's definitely more affordable, more fun, more interesting.",
        "732.32": "What I just wanted to tell you was to think about how capital then takes over touristy",
        "735.92": "spots and how if you want to enjoy a different way of life and try to understand the local",
        "741.08": "way of life, then you got to go out.",
        "742.68": "Go where the locals are, okay.",
        "745.2": "I've given you a few good spots to travel, they're all very affordable.",
        "748.32": "So check them out.",
        "750.92": "Which brings me to point number three on how do you get the most budget, most bang out",
        "756.0": "of your budget when you're travelling, that is to plan your days with multiple combination.",
        "762.74": "What does that mean?",
        "763.74": "A lot of times we travel, when I first started, of course I travelled in a group, friends,",
        "768.9": "bunch of us, we went and then after that I started travelling alone and I felt like,",
        "772.54": "oh, travelling alone is quite fun because I could just focus on myself, I do what I",
        "776.42": "want to do, I don't really need to care about whether my friend wants to go here.",
        "779.94": "But eventually it became a little bit more problematic in the sense of, I'm limited as",
        "784.68": "to the places that I can stay because if you stay alone, if you want to take the whole",
        "787.48": "apartment, it's very expensive.",
        "790.48": "And I'm also limited by the kind of dining options and the kind of activity options that",
        "794.32": "I can do.",
        "795.32": "Honestly, why would you want to go to a place and be like, you know, selfie on your own,",
        "798.8": "a bit lame.",
        "799.8": "So a lot of people take photos because it's a group, there's a memorial in it, you know,",
        "803.32": "but okay, if you want to take on your own, fine, do it, I'm not judging you.",
        "806.44": "But what I found out eventually as I've travelled to many places is you can travel as a group",
        "811.56": "but do not be stuck within the group.",
        "813.98": "So travel as a group plan, four of you can go on a trip together, share the apartment,",
        "818.34": "great, do your thing.",
        "819.74": "But you should have that one or two days of your own, right, or maybe one or two days",
        "823.7": "just you, okay, either can be a split up, three people, one people, or even you can",
        "828.1": "meet local people, right, and that's a great way, great fun, meetup.com, you know, go to",
        "832.66": "the local communities, there are a lot of ways to go about doing that, Facebook.",
        "836.26": "I think Facebook is still one of the most amazing places to kind of meet a bunch of",
        "839.78": "people, right.",
        "841.12": "So the idea here is instead of definitely travelling alone or travelling with your partner",
        "846.4": "or travelling as a group, what you can do is to kind of merge them together with the",
        "851.16": "core spine when you travel, right.",
        "853.12": "So seven days, 12 days, 15 days, when you guys travel, there's a core spine, what are",
        "857.96": "we going to do, what are we going to do, what are we going to do, what do we want to achieve.",
        "860.78": "And then in between, you can always do your own thing, right.",
        "863.96": "So it could just be like, oh, today we're going to have breakfast together, after that",
        "866.28": "do your thing, go to your library, do what you want to do, go and hipster, you know,",
        "870.14": "go and visit.",
        "871.14": "Like for me, I'm becoming a big fan of visiting universities and I'm going to try to interview",
        "874.66": "some of these university professors with leading ideas, right.",
        "877.26": "So yeah, it becomes a very interesting way of getting the most out of the budget because",
        "884.58": "firstly you're safe on renter because you're not renting alone, you get the freedom to",
        "889.22": "move around on your own whenever you want to, and also you can dine as a group which",
        "894.82": "gives you more options and more activities to choose from as a group.",
        "899.66": "So I think there is value in travelling as a collective without being bound to the collective,",
        "905.36": "right.",
        "906.36": "So chill with a few friends, you know, go and travel together but don't have to everything",
        "911.08": "do together.",
        "912.08": "I think that's a big part of how I look at it these days.",
        "915.2": "Of course, of course, travelling with friends can be very scary, can break relationships.",
        "921.28": "So my biggest recommendation to all of you is to try to travel to Melaka, right.",
        "926.64": "Go somewhere near, somewhere affordable, test out the friend, right, test out whether",
        "931.18": "you can actually travel together.",
        "933.66": "Some friends can hang out together, have a good drink, have a good laugh, play sports",
        "937.14": "but doesn't mean you can live in the same apartment for 20 days together or 15 days",
        "941.26": "or 7 days together, right.",
        "944.06": "So if you are testing out some friends, great, Melaka is always my top choice.",
        "948.62": "Go there, have a good time and then eventually when you feel more confident with that, you",
        "952.36": "can go further and travel further and travel as a group, multiple permutation, great, great,",
        "958.44": "great value for your budget.",
        "960.24": "Okay, so yeah, simple episode today.",
        "963.64": "I just wanted to share with you my tips and thoughts because firstly, I'm moving around",
        "967.4": "and secondly, I see a lot of people trying to move around.",
        "969.64": "So barring aside all your travel off season, Airbnb, all those stuff which a lot of people",
        "974.16": "talk about, these are the three pointers that I have for you to get the best of your buck",
        "978.16": "when you're travelling.",
        "979.46": "Number one is to watch out for airport taxes.",
        "981.62": "A lot of air hubs, very convenient to travel to but they usually charge you a lot and when",
        "986.22": "you fly in, it's fine because they're not taxing you to fly in.",
        "989.42": "When you fly out, it's a bit more expensive.",
        "992.74": "So what I tend to do is I fly into the air hub and then I'll try to find another way",
        "997.54": "to get back to where I started.",
        "999.94": "So that's great.",
        "1000.94": "A lot of nomads do that also and they move around but yeah, because you're not a nomadic,",
        "1004.02": "you just want to do a two-week trip, just watch out for airport taxes.",
        "1006.8": "Try to make that journey into a cheaper airport part of the journey.",
        "1012.04": "It is quite fun.",
        "1013.56": "Number two is to stay further away from the city.",
        "1017.12": "Of course, a lot of people have this annoyance, oh yeah, if I stay far away from the city,",
        "1021.72": "I got to move in and out.",
        "1022.72": "But hey, if you're travelling, you're having fun, the movement about is an experience in",
        "1028.04": "itself.",
        "1029.04": "And also, you don't need every day stay out of the city.",
        "1031.12": "You can stay two or three days within the city, get talk, talk, talk as a tourist and",
        "1034.98": "then you move out and go and experience life of the local.",
        "1038.94": "I think that's great value, great cultural insights.",
        "1042.06": "You get to see more things and everything is local price.",
        "1044.86": "It's much, much more affordable, like way more affordable.",
        "1048.3": "I just came from Turkey.",
        "1050.26": "In the heart of Istanbul where Constantinople is, it's easily two to three times, in fact,",
        "1056.18": "maybe three to four times the price of what I pay for the same thing in the local areas",
        "1061.04": "which eventually I spend a lot of time in.",
        "1063.32": "So yeah, think about that.",
        "1065.04": "And number three is plan your days with a multiple permutation in mind.",
        "1070.92": "So travel as a group definitely saves you an apartment.",
        "1073.56": "Eating together definitely gives you more options and activities.",
        "1075.92": "But sometimes you want your own time, you want your own experience.",
        "1078.96": "You just want to go to this library, then all your friends want to go, they want to",
        "1082.2": "go somewhere else.",
        "1083.2": "It's fine, go on your own, separate it out.",
        "1084.92": "So instead of saying, I have to solo travel or I have to go in a pair, I have to go in",
        "1087.96": "a group, you can always have multiple permutation as you move along.",
        "1092.02": "This gives you a lot of bang for your buck while meeting all the needs that you have",
        "1095.58": "that other people may not have.",
        "1098.54": "So with that, I hope you learn something useful today and have a great trip, right?",
        "1101.62": "Go and have some fun.",
        "1102.62": "I think two years of pandemic, very stressed.",
        "1104.86": "Go out, enjoy yourself, watch your budget, have a good time.",
        "1108.1": "I hope you learn something useful today.",
        "1109.38": "See ya!",
        "1118.26": "Hey, I hope you learn something useful today and truly appreciate that you took time off",
        "1121.48": "to better your life with The Financial Coconut.",
        "1123.96": "Knowledge is that much more powerful and interesting when shared, debated and discussed.",
        "1127.8": "Join our community telegram group, sign up for Instagram, follow us on our socials.",
        "1131.4": "We have TikTok now, YouTube.",
        "1133.0": "5-star rating everywhere.",
        "1134.68": "I'm expecting that I'm watching you.",
        "1135.84": "I don't want you to give me 5-star rating.",
        "1137.2": "5-star rating.",
        "1138.2": "If you give me the 1-star, I will...",
        "1140.96": "5-star rating.",
        "1142.96": "I hope to hear from you, right?",
        "1144.36": "So email to us, hello at thefinancialcoconut.com or DM us.",
        "1148.08": "There are many ways to go about doing it these days.",
        "1151.26": "And if you have any other tips and tricks and also any other people that you would like",
        "1155.02": "us to interview and talk to, you can drop us a comment section, email us, DM us.",
        "1159.02": "I will see you soon.",
        "1168.46": "Okay, so I wanted to talk a little bit about work, you know, but I know, you know, it's",
        "1174.66": "like, like, you know, people are coming out like, whoa, travel now.",
        "1178.44": "So, yeah, I just felt like, yeah, maybe I should put some travel stuff into the catalogue",
        "1183.68": "rather than this whole like work, work, work thing.",
        "1186.44": "Okay.",
        "1187.44": "Next week, I want to also take a little bit of a pivot away from my original plan.",
        "1193.92": "I wanted to talk a little bit about something else but I have decided, I have decided to",
        "1201.68": "talk a little bit about Boomer Financial Advice, right?",
        "1206.22": "So, I'm seeing a lot of those things online and I thought I will chime in and add my viewpoint",
        "1211.66": "on it, right?",
        "1212.66": "So, some financial advice from boomers are great, good stuff, right?",
        "1217.42": "But there are many that have been taken out of context or the context have changed.",
        "1221.98": "So, when the context have changed and you don't keep up, it becomes very problematic.",
        "1226.02": "So, next week's episode, next two weeks episode or maybe even three weeks depending on how",
        "1230.74": "much I can get out of this.",
        "1232.96": "So, next two weeks at least, Toxic Boomer Financial Advice.",
        "1236.8": "I've consolidated some of these thoughts and I hope you find them useful.",
        "1239.92": "So meanwhile, go have fun first, travel, do your thing and I will see you next week."
      }
    },
    {
      "id": "7",
      "title": "Is Budgeting The Only Way To Manage Your Money",
      "url": "https://www.youtube.com/watch?v=h_cYbRS80W8",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "Like two different...",
        "1.0": "My husband will just give me a sum",
        "2.2": "and then I will just check in with him before I deploy.",
        "4.92": "Yeah, but I still have a lot now.",
        "7.12": "And he's like, why you never spend my money?",
        "8.68": "I'm like, well, there's no compounding investment right now.",
        "11.16": "I need to wait.",
        "11.92": "Right?",
        "12.28": "It's not about just buying all.",
        "14.64": "Yeah, kind of.",
        "15.8": "That's why I said I'll never start a hedge fund.",
        "17.16": "It's hard enough to manage my own family's one.",
        "19.12": "And then for my kids, I have stock picks as well as index funds.",
        "23.4": "And robos.",
        "24.4": "Yeah.",
        "25.04": "Okay, so you have your kids.",
        "28.32": "Industry is changing.",
        "29.8": "From electricity generated like this.",
        "32.4": "To sustainable alternatives, optimized and distributed by AI.",
        "36.24": "From cars assembled like this.",
        "38.4": "To greener vehicles delivered efficiently with cloud-based insights.",
        "42.28": "At Aviva, we're helping industries lead this change.",
        "45.36": "By connecting their teams with trusted insights,",
        "47.76": "they're operating smarter,",
        "49.12": "engineering better,",
        "50.16": "and finding new ways to provide life's essentials.",
        "52.84": "Find out more at takesyouthere.aveva.com.",
        "56.84": "Aviva. We'll take you there.",
        "60.68": "Investments account.",
        "61.48": "Then you put them into index funds.",
        "63.44": "Yeah, because I think for kids,",
        "65.12": "I have a lot more leeway because",
        "67.24": "I want to also...",
        "68.6": "Hello and welcome back to Chill With TFC,",
        "70.36": "where we look for the quirkiest and geekiest people",
        "72.76": "to share with you their views on money and on life.",
        "75.76": "This week, we continue our two-part interview",
        "77.92": "with financial influencer and mother of two,",
        "80.48": "SG Budget Babe.",
        "82.04": "Her name is Dawn.",
        "82.96": "We'll learn about how her relationship with money",
        "85.12": "has changed throughout her career.",
        "87.24": "And don't forget to stay till the end",
        "88.52": "for our rapid questions on money.",
        "90.24": "If you'd like to learn more about what Dawn's",
        "91.8": "best and worst investments are.",
        "101.76": "Yeah, and I think also like,",
        "102.84": "maybe when you reach a certain age,",
        "104.12": "now that we're in our 30s, right?",
        "105.56": "You realise there's just not so much you can budget anymore",
        "108.08": "because, you know, unlike in your 20s",
        "109.84": "when it's just you, you, you, you, you.",
        "111.4": "There's only so many cups of Starbucks",
        "113.12": "that you can stop drinking.",
        "113.88": "Yeah, exactly.",
        "114.6": "To save money.",
        "115.64": "And then when kids come to the equation,",
        "117.8": "there's just so many other things",
        "119.0": "that you just can't control already.",
        "120.84": "Yeah, so you used to keep a lid on all this",
        "123.28": "because you're financially savvy, right?",
        "124.84": "So with kids, how many kids do you have now?",
        "126.36": "I have two kids now.",
        "127.04": "Two kids. How old?",
        "128.6": "They're four this year and one.",
        "131.08": "Son, daughter?",
        "132.32": "Both boys.",
        "133.0": "I want a daughter.",
        "133.8": "So I don't have.",
        "134.56": "No, I'm done. I'm done.",
        "135.6": "Two boys, I'm good.",
        "136.52": "Close shop already.",
        "138.16": "Four and one.",
        "138.92": "Oh, the one is like, you know,",
        "140.4": "okay, the four years old have been through a terrible two.",
        "143.08": "But the one year old is like,",
        "143.92": "oh, you know, so still very young.",
        "145.88": "And obviously,",
        "147.6": "well, I think maybe they're a bit too young",
        "149.08": "to learn about financial knowledge, right?",
        "150.76": "But I'm sure at some level,",
        "152.04": "you're going to train them for it.",
        "153.6": "Yeah, I'm starting to teach my four years old already.",
        "156.4": "Actually, since he was maybe three years old,",
        "159.08": "we're starting to show him that money is not finite.",
        "162.68": "Yeah.",
        "163.36": "Sorry, I mean, money is finite.",
        "164.64": "Because he keeps thinking like,",
        "165.8": "you know, he just asked people for money,",
        "168.4": "like buy new toy.",
        "169.28": "He keeps saying, I don't have this, so I must buy this.",
        "171.84": "I'm like, wow, if you don't,",
        "173.0": "you want to buy everything that you don't have.",
        "175.04": "Even the world is not enough.",
        "176.32": "You are the richest person in the world.",
        "177.6": "You still cannot buy everything, okay?",
        "179.84": "So we're trying to explain to him that it's finite.",
        "182.44": "Yeah, and that we have to work in order to earn money",
        "184.72": "to buy him the things that he wants.",
        "186.12": "So he can't just ask us to keep playing with him as well.",
        "188.88": "Yeah, and then we come up with a reward system.",
        "191.36": "So like, for instance,",
        "192.44": "I remember one very memorable thing was that I actually,",
        "196.32": "he has like coins that we give him",
        "198.64": "and he keeps it in this wallet.",
        "200.16": "So one day I told him, hey, I think you have enough money.",
        "201.88": "Why don't we go and buy some toys?",
        "203.6": "Yeah, you can choose your own.",
        "204.6": "He was like, okay.",
        "205.2": "He got really excited.",
        "206.28": "Went to the shop and he chose a $27 bus.",
        "209.48": "$27?",
        "210.4": "Yeah, but his coin had $27.",
        "212.24": "Or a bus that cost $27.",
        "213.24": "Yeah, a toy bus that cost $27.",
        "215.0": "It was a big toy bus.",
        "216.36": "Yeah, and then I didn't want to,",
        "218.88": "I wanted him to learn a lesson.",
        "220.4": "So I let him, I said, okay, bring the cashier.",
        "222.84": "See what she says.",
        "223.88": "Obviously the cashier told him that it wasn't enough.",
        "226.6": "The cashier like, oh, this mom trying to use me.",
        "228.48": "I'm very busy already.",
        "230.16": "Trying to use me to teach your kids about money.",
        "231.68": "She was just like, a boy bukoh leh.",
        "233.32": "Then I explained to him, you see, it's not enough.",
        "236.2": "You need to choose something that's within the budget.",
        "238.12": "Let's see how much you have.",
        "239.24": "You have $2.",
        "240.12": "Why don't you look for, no, you have $2.50.",
        "241.88": "Why don't you look for something that's within the budget?",
        "243.8": "So then he picked a $180 bus.",
        "245.76": "He was happy that he had money left over still.",
        "248.24": "Then he was like, next time I can buy more bus.",
        "249.8": "Like, okay, that's good.",
        "250.92": "You can go back and collect more coins.",
        "252.84": "Keep and save more coins.",
        "255.0": "And then come back and buy the next toy.",
        "256.6": "So like, teaching him to realise that there are budgets.",
        "261.08": "And then I'll use books to also illustrate him the concept.",
        "263.72": "So I recently bought this book from Amazon.",
        "265.56": "And I asked him, which brother do you want to be?",
        "268.88": "And it's one about a Spendthrift brother.",
        "271.6": "And one about a Saver brother.",
        "272.96": "Yeah. And then like, and the Saver then invests as well.",
        "276.48": "To become a millionaire.",
        "277.48": "So I keep asking him, which one do you want to be?",
        "279.76": "And he says, he wants to be the Saver.",
        "281.24": "Who becomes the rich one.",
        "282.52": "Then I say, why?",
        "283.36": "So I can buy many, many things.",
        "284.68": "Okay.",
        "285.56": "Okay.",
        "286.24": "What were some of the values that you want to instil in your kids?",
        "288.64": "Your two boys.",
        "289.76": "Greed.",
        "290.56": "Greed.",
        "291.16": "What about greed?",
        "291.96": "Greed.",
        "292.44": "I feel like hard work is kind of overrated.",
        "295.24": "It's important.",
        "295.96": "But greed is really the one that leads almost every single successful person to success.",
        "301.24": "Okay.",
        "301.84": "Yeah.",
        "302.36": "Because like, you can work hard.",
        "303.96": "But if you don't persevere through the tough times,",
        "306.36": "then you'll never have that breakthrough.",
        "307.68": "And I feel for me, like when...",
        "310.12": "I mean, if I look back at my journey, right?",
        "311.96": "I was a straight A student, but I'm not smart.",
        "313.68": "I don't think I'm smart.",
        "314.76": "You work hard.",
        "315.28": "Yeah, I work hard.",
        "316.2": "And I work smart.",
        "317.08": "Okay.",
        "317.36": "And my IQ, when I eat, confirm, okay, I do IQ test.",
        "319.88": "I don't score very high one.",
        "320.96": "So I know I'm not smart.",
        "321.96": "But because I know I have a goal and I persevere through it.",
        "325.76": "So that's how I got my straight A's.",
        "327.56": "And then like, same thing when I set my sights on something,",
        "330.56": "no matter how difficult.",
        "331.48": "I took my real estate exam when I was pregnant.",
        "334.24": "Yeah, it was difficult.",
        "335.84": "Because imagine being pregnant and handling a kid",
        "338.16": "and still having to study and work at the same time.",
        "341.44": "But I persevered.",
        "342.44": "And I really think it was just greed that got me through.",
        "344.36": "Same thing when it came to losing weight.",
        "345.96": "I lost 19 kg till date.",
        "347.48": "I really think it was all about greed.",
        "349.24": "Yeah, greed, perseverance, working hard,",
        "351.44": "but not like repeating things that don't work also.",
        "354.64": "And I really wish to instill this in my kids.",
        "357.8": "So that whatever comes in life,",
        "359.2": "because we cannot control when bad things happen.",
        "361.48": "But if they have these values,",
        "363.0": "I believe they'll be able to overcome anything",
        "364.96": "that life throws at them.",
        "365.96": "Mm-hmm.",
        "366.72": "So now that we know a bit about your family situation.",
        "369.48": "So I'd like to ask about family financial planning",
        "373.2": "and all that, because we've had couples on the show,",
        "375.04": "share their thoughts.",
        "376.04": "And you know, some people will put their bank accounts together,",
        "379.2": "put their money together.",
        "380.2": "Some people keep it separate.",
        "381.56": "Some have a hybrid way of doing it.",
        "383.92": "So how do you do it in your own household?",
        "385.92": "With two kids and a husband.",
        "387.44": "We have our own accounts.",
        "390.04": "And then we don't like go and gamble",
        "393.92": "what each other spending on.",
        "395.2": "So I would say sometimes,",
        "397.36": "but we weren't like, you know, neck or skull.",
        "400.0": "And then we also have a joint account,",
        "403.84": "but we don't use that for joint expenses.",
        "405.56": "Although I recommend couples do that.",
        "407.08": "Yeah. And the only reason why we don't is because like,",
        "409.36": "the truth is to get the most out of a lot of things.",
        "412.6": "It's not about gyro-wing your expenses.",
        "414.76": "Yeah. Gyro-wing doesn't get you a lot of like cashback or rewards.",
        "418.04": "Yeah.",
        "419.6": "Correct. Correct.",
        "420.76": "But if you do that way,",
        "421.68": "then you need someone to manage and track it and expense it.",
        "424.76": "So we chose that way to get more out of what we have to pay.",
        "428.12": "And then I just had to do the extra legwork of like,",
        "430.8": "expensing it back from my husband.",
        "433.84": "Okay. I mean, it's a mean thing that you do to manage your account and all that.",
        "438.28": "Yeah.",
        "438.96": "You manage the family investments?",
        "440.68": "Yes.",
        "441.08": "Like do you have your personal investments and then the family investments?",
        "443.64": "I do. So my husband will just give me a sum",
        "445.52": "and then I will just check in with him before I deploy.",
        "448.64": "Yeah. But I still have a lot now.",
        "450.4": "And he's like, why you never spend my money?",
        "452.16": "I'm like, well, there's no compelling investment right now.",
        "454.44": "I need to wait.",
        "455.2": "Right. It's not about just buying.",
        "457.48": "Oh yeah. Kind of. Kind of.",
        "459.08": "That's why I said I'll never start a hedge fund.",
        "460.44": "It's hard enough to manage my own family's one.",
        "463.12": "And then for my kids, I have StockPicks as well as Index Funds and Robos.",
        "467.84": "Yeah.",
        "468.48": "So you have the kids' investments account.",
        "470.24": "Then you put them into Index Funds.",
        "472.16": "Yeah. Because I think for kids, I have a lot more leeway because",
        "475.92": "I want also for them to see the impact of different decisions over time.",
        "480.88": "Yeah. So when I allocate to StockPicks versus Index Funds and Robos,",
        "486.56": "then they can track 18 years later, how does that look.",
        "489.44": "And it's more tangible to see.",
        "491.32": "We can always teach them.",
        "492.72": "But when you actually have skin in the game, it's a different thing.",
        "496.4": "Yeah. So I want to use that to show them the different paths",
        "500.08": "and let them choose how they want to invest on their own",
        "502.88": "or manage their money in the future.",
        "504.32": "Okay. So when they inherit the so-called investment account",
        "507.28": "and they're going to see that, okay, this is the Index Funds,",
        "509.64": "how it has been doing and then these are Active StockPicks",
        "511.36": "and how it has been doing and all that.",
        "512.88": "Correct. Correct.",
        "513.6": "Prior to that, because the skin in the game so far is you, right?",
        "516.04": "I mean, prior to that, they got to be built up with that knowledge.",
        "518.64": "Correct. Correct.",
        "519.56": "So it's a journey.",
        "520.44": "So they don't know they have an investment fund for now.",
        "523.2": "Of course they don't.",
        "524.2": "And that will change over time.",
        "525.72": "And also like we're off the mindset that, you know,",
        "527.96": "a lot of parents, they want to pay for their kids' university.",
        "530.72": "But like my husband and I feel that in the future,",
        "533.56": "a uni degree won't be as valuable as it is now anymore.",
        "536.16": "So if they don't want to go to university,",
        "539.16": "they want to go and start a business, then why not?",
        "542.12": "So we would rather have like a sum of money that's being invested.",
        "545.76": "And when we give it to them when they turn off age,",
        "547.84": "it's up to them how they want to spend it.",
        "550.12": "How about putting money into their CPF, the kids' CPF?",
        "552.96": "Oh yeah, we would.",
        "554.28": "Just that for now, we're trying to max out taxes.",
        "556.64": "So we have to top our own first.",
        "558.56": "Yeah, we top our own first.",
        "560.8": "Later on, then we do the kids.",
        "562.32": "Yeah.",
        "562.92": "So how does the investment family fund look like,",
        "566.24": "you know, in your own personal household?",
        "568.12": "Family fund.",
        "568.92": "Is it more risk averse?",
        "571.72": "You know, because it's, well, you got to plan for the future.",
        "574.56": "Uh, no, I think it's fair.",
        "577.0": "I would say moderate risk.",
        "579.16": "So we do have a longer time span, right?",
        "582.52": "Because it's all the way until retirement.",
        "584.72": "So if I gauge, we're in our 30s,",
        "586.56": "we have about like 20, 30 years of investments at least.",
        "589.56": "So I can afford to take a bit more risk",
        "592.0": "than someone who only has like a 5, 10 year time frame there.",
        "595.0": "So for the kids, it's even longer.",
        "597.16": "So we get to play around even more.",
        "598.68": "But because the kids, we want to teach them that thing that I mentioned also.",
        "602.28": "That's why we have different paths allocated for them.",
        "604.76": "So how do you allocate, um,",
        "606.32": "between active stock picking and index funds?",
        "608.76": "Based on opportunity.",
        "609.84": "Based on opportunity.",
        "611.12": "Yeah. Like if market crash, then easy.",
        "612.96": "More on indexes.",
        "614.44": "Yeah. Unless the active stock pick crash a lot as well.",
        "617.56": "Yeah. But if the outlook for the active stock pick don't look as good",
        "620.96": "and I feel it could continue to be depressed,",
        "623.52": "then I won't act so fast.",
        "624.64": "I might just deploy more on index funds first.",
        "626.72": "Okay. So personally, what are you doing right now?",
        "629.04": "In given the market crash, things are picking up again.",
        "631.76": "People are saying some would think that it's going to be a",
        "634.16": "further crash down the line.",
        "635.56": "You should have some more chance, right?",
        "637.48": "And you're just looking at opportunities?",
        "639.36": "We do.",
        "640.92": "I think it's hard to predict where the future goes.",
        "643.28": "So I'm just deploying.",
        "644.28": "But I also do think that",
        "645.52": "we came out of a period of unprecedented gains.",
        "649.04": "If you look at the S&P, right,",
        "651.12": "at all the decades in the last 40 or 50 years,",
        "655.8": "the one that we just came out of was 400 plus percent.",
        "660.2": "All the others, right, so it was 400 plus.",
        "662.4": "Then you go back another 10 years, it was 200 plus.",
        "664.56": "Then it was like negative 14 or something.",
        "667.16": "Then 200 plus again and 200 plus.",
        "668.92": "But the one we just came out of, 400 plus.",
        "671.16": "That's because of the 2020 jump, right?",
        "674.16": "No, it's also because of the",
        "676.76": "flash money that's going into the system.",
        "680.04": "Quantitative easing.",
        "681.16": "Correct, the QE.",
        "682.0": "When you go up so fast,",
        "683.24": "you will have to come down also before it continues.",
        "685.88": "So I feel like the down hasn't really been down yet.",
        "689.04": "Yeah, that's why I'm taking a more",
        "690.88": "cautious wait and see approach.",
        "692.88": "And we have slowed down the pace",
        "694.52": "at which I'm deploying our money.",
        "696.08": "Okay, so you're still deploying at some level,",
        "698.4": "but you're slowing it down.",
        "699.44": "Slowing it down.",
        "700.24": "Yeah, you just don't know if there's gonna be",
        "702.92": "a further crash down.",
        "704.2": "Of course, nobody can predict anything.",
        "705.4": "Yeah, like if my trend was X dollars each time,",
        "707.88": "now I'm reducing it to X divided by two.",
        "709.88": "So I can make it last twice.",
        "711.24": "Okay.",
        "712.08": "Yeah, you're not waiting by the sidelines totally.",
        "713.96": "No, no, no.",
        "714.8": "Because some people are holding cash, you know.",
        "715.64": "I think it's so hard to wait on the sidelines",
        "717.44": "because the market can turn against you so fast.",
        "719.64": "And unexpectedly.",
        "720.72": "And then you'll be like, when you see it turn,",
        "722.04": "you're like, is this a dead cat bounce?",
        "724.04": "Or is this a really good turn?",
        "725.48": "You won't know.",
        "726.32": "Really rarely.",
        "727.16": "Exactly, exactly.",
        "728.0": "Then when it goes up and if it continues going up,",
        "729.64": "you're like, no, I think it's fake.",
        "731.08": "I'll come back down.",
        "732.04": "So it's very hard.",
        "732.88": "The psychology works against you.",
        "734.68": "Yeah, so I feel like just deploying actively makes sense,",
        "737.6": "but you can afford to slow down",
        "739.48": "if you're of the view that it could get worse.",
        "742.16": "Yeah, it's so hard to read the markets nowadays.",
        "743.68": "It is.",
        "744.52": "I look at it, I know.",
        "745.36": "I'm like, what is happening?",
        "746.2": "What's going on, man?",
        "748.08": "Yeah, but okay, so we don't know.",
        "750.16": "You just deploy.",
        "751.2": "Yeah.",
        "752.04": "Maybe you deploy a bit less,",
        "753.16": "but that's your strategy going forward.",
        "755.32": "Okay, so that's investments.",
        "757.24": "And yeah, you talk about investments on the blog too, right?",
        "760.0": "Yeah, I do.",
        "760.88": "It's just that I no longer put the whole thesis.",
        "763.56": "I used to when like, you know, things go IPO",
        "766.52": "or I'll write like my entire stock thesis on the blog.",
        "769.12": "But then there were a couple of instances",
        "771.36": "when I just overheard people talking about me in public",
        "773.88": "and they didn't know who I was, right?",
        "775.84": "And then they'll be like, yeah,",
        "776.68": "I saw a budget-based book that she invested in this stock.",
        "779.24": "Yeah, I'm going to buy.",
        "780.44": "And that's all I heard.",
        "781.28": "And then I got very worried.",
        "782.12": "I'm like, oh, shucks.",
        "782.96": "People just-",
        "783.8": "People might not read your thesis.",
        "784.76": "Yeah, they're just scrolling all the way to the bottom",
        "787.08": "and just seeing whether is it a buy or don't buy",
        "789.76": "and then make a snap judgment based on that.",
        "791.92": "And I felt like that was very irresponsible.",
        "794.36": "I didn't want to contribute to that.",
        "796.72": "So I stopped putting up full thesis on my blog",
        "799.92": "and I moved it to Patreon",
        "801.04": "whereby I get to have more conversations with the people.",
        "803.72": "Yeah, and because like, it's not,",
        "805.28": "when it's free and public, right?",
        "807.04": "You cannot control who's looking at it.",
        "808.68": "It could be a 17 year old.",
        "809.8": "It could be a 40 year old who is experienced.",
        "811.6": "It could be someone who doesn't know anything",
        "813.48": "but respects you a lot.",
        "814.56": "And I cannot control what they do",
        "816.4": "if they don't talk to me about it.",
        "818.16": "Yeah, whereas on a more private platform,",
        "820.68": "people can engage me and they'll ask questions",
        "822.72": "and all and I can reply them.",
        "823.8": "So there's a bit more control in that way.",
        "825.76": "And there's also with lesser audience,",
        "827.32": "you only get those who are willing to support you",
        "829.4": "and pay for the work, the in-depth research that you do.",
        "832.44": "So I run a subscription service.",
        "834.04": "And on that platform, right, it's easier for me to cut",
        "838.44": "compared to on the blog where it used to be all free and all.",
        "841.0": "And, you know, I used to do that a lot",
        "843.16": "during the 2016 to 2018 period.",
        "846.6": "And then I just stopped.",
        "847.64": "Because on Patreon, you can filter out the people.",
        "849.68": "Correct.",
        "850.28": "Yeah, and you're in closer communication with them",
        "852.96": "instead of like, you know, somebody just",
        "854.88": "follow your buy and sell recommendation.",
        "856.52": "Exactly.",
        "857.04": "And I know who's on my Patreon.",
        "858.64": "So, you know, they are also open",
        "861.24": "to have a communication channel with me at any time.",
        "863.64": "And it's really a lot better, I feel, in that way",
        "866.16": "versus always just publishing on...",
        "868.92": "I mean, free is great.",
        "870.12": "I like free too, right?",
        "871.36": "But I think being in a position where I have realized",
        "874.88": "the impact that my words can have on others,",
        "877.32": "I'm a bit more cautious now.",
        "879.48": "I don't want people to be misled into it.",
        "882.0": "So even when like, you know, during the whole crypto bull run",
        "884.92": "and everyone was trying to get into crypto",
        "887.24": "and trying to open accounts at all different places, right?",
        "889.84": "I was very cautious about the ones that I pick and wrote about.",
        "893.48": "Yeah, some had affiliate, some didn't.",
        "896.28": "Even if they were good but didn't have an affiliate,",
        "898.12": "I would just talk about it anyway.",
        "899.72": "Yeah, and if they were not so good",
        "901.64": "but offered really good affiliate fees,",
        "903.72": "I would eliminate them.",
        "905.2": "Yeah, so that's the back end thing",
        "906.84": "that I think people don't really see.",
        "907.96": "Yeah, I think crypto is a bit more F-y, do you feel?",
        "910.28": "Like writing about crypto.",
        "911.64": "Yeah, but we do need more content about crypto",
        "913.76": "so people can make better informed choices as well.",
        "916.2": "Good point.",
        "917.0": "But the authorities aren't doing that.",
        "918.76": "Are they not?",
        "919.64": "They're not.",
        "920.08": "They're not putting out enough content about crypto.",
        "921.72": "You think there's a lack?",
        "922.96": "There's a huge lack, man.",
        "924.0": "Okay.",
        "924.64": "Yeah, so it really all boils down to people like us",
        "927.88": "and the few crypto publications to do that education.",
        "955.36": "Ask how to get up to $800 off the new iPhone 14 Pro",
        "958.56": "with eligible trade-in.",
        "959.88": "Visit att.com or our stores for details.",
        "962.6": "Terms and restrictions may apply.",
        "984.6": "So content has been evolving",
        "999.48": "because your own life has been evolving as well.",
        "1001.48": "You're adding in new stuff.",
        "1002.8": "There's always new things to learn on SG Budget Bit, right?",
        "1005.12": "What do you think your personal relationship with money",
        "1008.28": "has been like throughout this whole journey?",
        "1010.6": "I mean, from single, you were dating your damn boyfriend",
        "1013.0": "and then you got married, now you have two kids.",
        "1015.0": "What's your personal relationship with money like",
        "1017.88": "throughout this whole journey?",
        "1018.88": "I think it's grown from what you described,",
        "1021.6": "from a scarcity mindset to a modernist mindset.",
        "1024.0": "From really trying to save on almost everything I can",
        "1029.24": "to now being a bit more selective and focusing more on income.",
        "1032.76": "And then also, but at the same time,",
        "1035.08": "because of the position that I am,",
        "1036.96": "I want to make sure the income is earned from sources",
        "1039.92": "that give me fulfillment.",
        "1041.32": "Yeah, that don't jeopardize my future reputation",
        "1044.36": "because I feel that's more valuable than anything else",
        "1046.76": "that can be earned in the short term.",
        "1048.04": "Yeah, and really looking at money as a tool to empower",
        "1051.84": "rather than living on a budget.",
        "1053.84": "It's still about budgeting.",
        "1054.84": "But instead of budgeting within your means",
        "1057.28": "and just working on what you were given,",
        "1058.88": "it's now also about how can you then go out there",
        "1061.12": "and get more that you don't have or you need.",
        "1063.96": "Yeah, so that's the change.",
        "1066.12": "That's nice.",
        "1066.72": "Well, but I guess SG Abundance Bit doesn't have that.",
        "1069.24": "It doesn't have that catchy.",
        "1070.24": "Yeah, it's not catchy.",
        "1071.76": "It's not catchy.",
        "1073.12": "The brand name stays.",
        "1074.4": "Yeah, budget babe.",
        "1075.6": "And it's all still in the budget anyway.",
        "1077.2": "We always have to operate in a budget, isn't it?",
        "1079.2": "Yeah, it's just how much your budget is can grow over time.",
        "1082.52": "Alright, okay.",
        "1083.4": "So, I have three questions for you.",
        "1084.52": "The last three questions at the end.",
        "1086.36": "What has been your best and worst investments?",
        "1088.8": "It doesn't have to be a financial one.",
        "1091.88": "My best and worst?",
        "1093.44": "Hmm.",
        "1095.28": "I think my worst is easy.",
        "1097.8": "It was my very first stock pick.",
        "1101.04": "And it was really because I just relied on a tip from my broker.",
        "1104.04": "Yeah, first lesson.",
        "1105.52": "Don't just rely on broker tips.",
        "1107.52": "And I remember how my broker pitched it to me.",
        "1110.24": "Hey, this is a very good stock man.",
        "1111.56": "It's riding on e-commerce wave.",
        "1112.96": "You know, everyone is buying more e-commerce now.",
        "1114.56": "And that was even before Shopee was around.",
        "1116.24": "So, the stock was seeing posts.",
        "1117.96": "Okay, and they were building all these logistics and all.",
        "1120.64": "And even my parents bought.",
        "1122.84": "You think I will hide my parents?",
        "1124.4": "My own parents.",
        "1125.96": "My parents bought at $2 plus.",
        "1127.24": "Now, you're buying cheaper than my parents.",
        "1129.04": "And you think that I will hide my parents?",
        "1131.04": "I listened to him and he said,",
        "1132.36": "I have more experience than you.",
        "1133.72": "I'm older and smarter and more experienced.",
        "1135.92": "You should listen to me.",
        "1136.72": "Really, this is a good pick.",
        "1137.92": "Okay, so I said, okay.",
        "1139.4": "Listen, you won't hide your own parents, right?",
        "1141.56": "I go in and I bought and...",
        "1143.56": "We all know where Singtel is.",
        "1145.44": "It's not $2 anymore.",
        "1146.76": "It's like what, 40 something cents now?",
        "1148.28": "Then, you mentioned broker like,",
        "1149.44": "wow, so old school.",
        "1150.24": "Back then, we still have brokers.",
        "1151.28": "Yeah, I remember.",
        "1152.16": "The younger generation may not know about it now.",
        "1154.2": "Now, it's like, the commissions are so low.",
        "1155.88": "I mean, brokers get a fee, right?",
        "1157.96": "Now, it's brokerage platform.",
        "1159.36": "Not broker anymore.",
        "1160.48": "Exactly.",
        "1161.32": "So, yeah.",
        "1161.8": "I think the young people already have it good.",
        "1163.28": "Yeah, I know.",
        "1164.36": "So, that was my biggest financial mistake.",
        "1167.04": "Not in terms of the dollars lost.",
        "1168.84": "But really, in terms of the lesson I learned.",
        "1171.48": "Yeah.",
        "1172.12": "How about best one?",
        "1173.0": "Best one, I think would be",
        "1176.0": "investing my time to go in and read up on",
        "1179.0": "all the different investment books.",
        "1181.68": "And later on, also being open-minded",
        "1184.24": "to go for investment courses.",
        "1186.24": "You know, courses get a lot of hate, right?",
        "1188.16": "Especially the expensive one.",
        "1189.24": "People think it's a rip-off.",
        "1190.2": "They don't really teach you.",
        "1190.92": "But I do think there are really good courses out there.",
        "1193.32": "And I have mentioned and paid tribute",
        "1195.28": "to some of them on my blog.",
        "1197.2": "So, I actually went for some of these courses",
        "1199.64": "and paid also.",
        "1200.92": "Because I felt like I could learn",
        "1202.48": "from the trainers' experience.",
        "1204.2": "And it could also validate if what I was learning",
        "1206.48": "from the books is correct.",
        "1207.96": "Because books are great.",
        "1209.16": "But a lot of them are outdated.",
        "1211.08": "Yeah, some concepts just don't work anymore.",
        "1212.88": "There are very few good books on growth investing.",
        "1215.44": "Sometimes, you just need a course",
        "1216.72": "that's a bit more updated.",
        "1218.16": "With people who have been doing this",
        "1220.2": "for the last few years.",
        "1220.88": "But just haven't sat down to write a book",
        "1222.88": "because it's so time-consuming, right?",
        "1225.24": "And it doesn't...",
        "1226.12": "Authors don't earn much anyway.",
        "1227.52": "So, it makes more sense for them to do a course",
        "1229.72": "rather than a book.",
        "1230.4": "And I went for those courses to learn and reaffirm",
        "1232.68": "what I was learning and picking up from the books.",
        "1234.96": "And I don't think those were really good investments.",
        "1237.08": "Mmm.",
        "1237.72": "You mentioned you've always wanted to write a book.",
        "1239.44": "Have you thought about it?",
        "1240.64": "So, the joke was,",
        "1241.64": "I actually said when I got pregnant, right?",
        "1243.48": "I was like,",
        "1243.8": "Oh, I'm going to have 4 months maternity leave.",
        "1245.6": "I'm going to use that 4 months to write a book.",
        "1247.96": "No one told me that my 4 months",
        "1249.6": "would be spent breastfeeding",
        "1250.68": "with every 2 to 3 hours with zero break time.",
        "1253.24": "And when I came out of my maternity,",
        "1254.72": "I was like, it's a joke, man.",
        "1255.84": "Why did I even say it at all?",
        "1257.28": "Think that I'll be free during my maternity leave.",
        "1259.4": "Yeah, so I never got around with it.",
        "1260.72": "And now, with 2 young kids,",
        "1261.92": "I still don't have time.",
        "1262.92": "Maybe in the future when I'm retired,",
        "1264.6": "I don't know, man.",
        "1265.84": "Okay, sometime down the road,",
        "1267.48": "you could possibly spend some time, you know,",
        "1269.08": "writing about all your insights",
        "1270.64": "and experiences in finance.",
        "1272.24": "Yeah, I think for now, it's not.",
        "1273.92": "Because it's really about the time trade-off, right?",
        "1276.16": "And it's easier to write articles now",
        "1278.92": "or do social media content,",
        "1280.24": "short-form content,",
        "1281.0": "than to really sit down and write a book.",
        "1282.92": "Usually, the process of writing a book,",
        "1285.16": "if you really want to do it,",
        "1286.2": "and when I do things,",
        "1287.0": "I want to do like 120%.",
        "1288.52": "I don't want to do like a half-hearted job.",
        "1290.2": "So, if I were to really sit down,",
        "1291.92": "I think it would at least take me like a year.",
        "1294.48": "Yeah, or even more.",
        "1295.92": "But that's not the kind of luxury of time",
        "1298.28": "I have right now.",
        "1299.08": "Yeah, so maybe in the future, who knows?",
        "1300.8": "What's something under $100 that you spend on",
        "1303.84": "that has been a game changer for you?",
        "1305.52": "Harry Potter.",
        "1306.52": "Yeah.",
        "1307.24": "All seven books, less than $100.",
        "1309.04": "No, no, no.",
        "1309.8": "Maybe the...",
        "1310.32": "Then I count the first one, Ken.",
        "1311.6": "The first one was like $70-something.",
        "1314.24": "Yeah.",
        "1314.76": "Okay, yeah.",
        "1315.56": "Wow, okay, okay.",
        "1316.24": "Books.",
        "1316.76": "Yeah, yeah.",
        "1317.88": "Because like, okay, I feel...",
        "1319.6": "Harry Potter really shaped me a lot",
        "1321.8": "because of the stories.",
        "1323.44": "It taught me imagination.",
        "1324.84": "It taught a lot of values.",
        "1326.0": "Friendship, greed, hard work.",
        "1328.04": "Not the smartest person.",
        "1329.16": "Hermione was the smartest,",
        "1330.32": "but she wasn't necessarily the richest, right?",
        "1333.16": "So, about being smart,",
        "1334.92": "being willing to break the rules where it matters.",
        "1337.96": "Learning how to respect authority",
        "1339.8": "when it is good authority.",
        "1342.6": "All of that and also just the whole imagination,",
        "1345.4": "that rich imagination in the story,",
        "1347.64": "that really left an impact on me.",
        "1349.28": "And of course, I was very inspired by J.K. Rowling herself",
        "1351.64": "because we all know about how she got rejected",
        "1353.88": "so many times, right?",
        "1355.72": "And then finally, was it Bloomsbury",
        "1358.28": "or the publisher name?",
        "1359.92": "I forgot.",
        "1360.56": "Right, they gave her a chance.",
        "1362.64": "And wow, it became like a worldwide phenomenon, man.",
        "1365.96": "Yeah, so she flipped her status as well.",
        "1367.76": "Exactly, exactly.",
        "1368.76": "And I thought that was very inspiring.",
        "1370.12": "I really lived...",
        "1372.8": "I kept thinking about those dreams",
        "1375.0": "and it showed that, you know,",
        "1377.08": "like even when life sucks",
        "1378.96": "or when you're not getting recognition,",
        "1380.28": "it doesn't mean that it's not good.",
        "1381.88": "You just need a lucky break.",
        "1383.2": "You just need to continue working hard",
        "1384.84": "and doing what you think is right,",
        "1386.28": "what you think gives added value",
        "1387.88": "and everything else will just fall into place.",
        "1390.32": "Yeah, and that's with Harry Potter, right?",
        "1391.64": "He didn't always know what he was doing,",
        "1393.64": "but he just lived to his values",
        "1395.84": "and he didn't compromise on some things",
        "1397.56": "even when he was put in some precarious situations",
        "1400.48": "that required him to choose.",
        "1402.28": "And it came out good in the end.",
        "1404.92": "Yeah, and I felt that was very impactful,",
        "1406.8": "especially as a kid.",
        "1408.12": "I think when you read those",
        "1409.56": "and you grow up with that mindset,",
        "1412.04": "plus Harry Potter made me love the English language.",
        "1415.56": "Yeah, and I think that led me to where I am now.",
        "1418.16": "Yeah, I love writing.",
        "1419.44": "So, that was pretty much the most impactful,",
        "1422.44": "less than $100.",
        "1423.56": "And it makes me feel even better",
        "1424.92": "that I earned it by myself",
        "1426.72": "because I saved that money to buy my own Harry Potter books.",
        "1429.56": "Yeah, there's an achievement of that as well.",
        "1430.96": "Yeah, it wasn't my mom who bought it for me.",
        "1432.48": "It was me saving up by myself.",
        "1434.24": "Through your own efforts.",
        "1435.2": "Exactly, exactly.",
        "1436.64": "Alright, so you've mentioned you've attended seminars,",
        "1440.48": "you read books.",
        "1442.04": "Is there a place that you learned from",
        "1443.68": "that you could recommend to our listeners?",
        "1446.4": "A book, a podcast?",
        "1447.44": "Okay, you don't listen to podcasts.",
        "1448.44": "Oops.",
        "1450.6": "A seminar, you know, something.",
        "1452.52": "Something, a recommendation for us.",
        "1454.4": "I feel books are super underrated.",
        "1456.8": "Do you have a specific book?",
        "1457.56": "And causes as well.",
        "1458.96": "I have a list of books.",
        "1460.12": "So, if you Google SG Budget-Based Investment Books,",
        "1462.72": "there's a list where I've curated from beginner",
        "1464.84": "to middle level to advanced.",
        "1467.84": "And I think going through that whole list",
        "1469.92": "will really make you a better investor.",
        "1471.84": "And then after that is figuring out",
        "1473.84": "how to adjust it to today's time.",
        "1476.48": "Because some investment concepts are timeless.",
        "1480.8": "But a lot of things that have changed also.",
        "1482.76": "Like in the past, right,",
        "1484.0": "if you look at a lot of investment books,",
        "1485.36": "they go for investments and businesses",
        "1487.48": "with a lot of assets.",
        "1489.08": "But today, we don't want.",
        "1490.56": "Yeah, we want asset-light industries.",
        "1492.84": "Because they're the ones who can scale and grow the fastest.",
        "1495.24": "Yeah, so there's that change.",
        "1496.64": "But if you just read books",
        "1497.6": "but don't know how to adapt that,",
        "1498.72": "then that's a problem.",
        "1499.6": "So, I think everyone should really start by reading books.",
        "1501.84": "And then YouTube, I feel, is great",
        "1504.36": "because there are a lot of gems.",
        "1505.4": "But there's also a lot of noise.",
        "1507.12": "So, if you're someone who feels very overwhelmed,",
        "1509.6": "I think we just need to play at where we learn best.",
        "1512.64": "Like, you know, I was telling you guys,",
        "1514.24": "I don't learn very well on just audio.",
        "1516.64": "Yeah, so while people say podcasts",
        "1519.84": "and clubhouse discussions",
        "1521.12": "and all can be very enlightening for them,",
        "1523.0": "it's not something that will help me grow.",
        "1525.08": "So, for me, it's really about words and videos.",
        "1527.96": "And that's where I go for resources.",
        "1529.8": "What was something you've read or are reading recently?",
        "1532.12": "Um...",
        "1534.12": "Let me think.",
        "1536.12": "I've read a lot of books recently",
        "1537.32": "but I think the most impactful one that I recommend",
        "1539.64": "is the Psychology of Money by Morgan Hosea.",
        "1542.72": "Have you read that?",
        "1543.32": "Yeah, I haven't fully read it.",
        "1544.72": "Ah, you should. It's a really great book.",
        "1546.52": "It talks about money as a means,",
        "1550.76": "as investments, expenses.",
        "1552.76": "It covers the mindset.",
        "1554.28": "It's really the psychology of money.",
        "1555.88": "And it's very enlightening.",
        "1557.8": "There were so many parts of the book where I was like,",
        "1559.64": "Yeah, screenshot.",
        "1560.92": "Yes, yeah, yeah, yeah.",
        "1562.36": "And then you realise you screenshot the whole book.",
        "1563.56": "Yeah, yeah, yeah.",
        "1564.36": "Because it's that good.",
        "1564.92": "There's just so much jam in there.",
        "1566.92": "And I think that's a classic that I will reread",
        "1569.16": "and reread for years to come.",
        "1570.52": "Any blogs as well?",
        "1571.48": "So, you can...",
        "1572.28": "Blogs? Mine?",
        "1573.16": "Ah, shameless, Shireen.",
        "1574.84": "Okay, okay.",
        "1575.32": "Let's talk about SG Budget, babe.",
        "1577.64": "Yeah, so there's...",
        "1578.68": "Your blog is still there.",
        "1579.8": "You're venturing out into YouTube.",
        "1581.48": "What else are you doing?",
        "1582.2": "TikTok, you know?",
        "1583.0": "Have you ever done TikTok?",
        "1583.88": "No, I tried but it's so hard.",
        "1586.52": "I put a lot of in-depth content on my blog.",
        "1588.68": "Yeah, and I think people now are like",
        "1590.12": "looking more at my social media on Instagram.",
        "1592.52": "I do put stuff on Instagram as well.",
        "1593.96": "But those are like news, right?",
        "1595.72": "Or very quick stuff or like short form content.",
        "1598.52": "But a lot of the gems are still in my blog.",
        "1601.64": "Yeah, and...",
        "1602.76": "Okay, there are a lot more sponsored posts on my blog now.",
        "1605.88": "But I'm very selective about how I take those on.",
        "1608.68": "And I direct the direction.",
        "1610.92": "Yeah, the clients don't always get to pick.",
        "1612.84": "In fact, most of the discussions which nobody hears.",
        "1615.32": "It's actually me telling the client,",
        "1616.84": "I want it to be in this angle.",
        "1618.36": "I propose this direction.",
        "1619.88": "If they fight back, then I will argue back.",
        "1622.36": "Unless their angle makes sense.",
        "1624.2": "Yeah, and I really get to go into",
        "1626.2": "super a lot of detailed content",
        "1628.44": "that wouldn't otherwise go out.",
        "1629.8": "I get to speak and vet and double confirm a lot of things",
        "1633.24": "that people normally wouldn't get assessed to.",
        "1636.04": "Yeah, so a lot of the gems are in there.",
        "1638.28": "People are not reading it as much as they used to anymore",
        "1640.76": "because I think a lot of the attention is going to",
        "1642.92": "short form content like TikTok and YouTube and Instagram.",
        "1645.24": "You see the views going to your other channels, right?",
        "1647.64": "Instagram and all that.",
        "1648.76": "But my blog really has...",
        "1649.96": "It's where like the in-depth thinking and details.",
        "1652.6": "Like, you know, just now I was just telling you",
        "1654.28": "about the last 10 years of the S&P thing, right?",
        "1656.6": "The 400%, 200% and all.",
        "1658.44": "There's actually an upcoming blog post",
        "1659.88": "that will come up this weekend.",
        "1661.4": "Oh, and it's not sponsored, right?",
        "1663.32": "It is sponsored.",
        "1664.2": "But I came out with that content.",
        "1665.88": "The client didn't tell me to look back.",
        "1667.64": "Yeah, so I was actually the one who looked at the brief.",
        "1670.04": "I was like, I think we should really talk about",
        "1671.96": "how, why the macro scene currently looks the way it is.",
        "1676.36": "And this is what we just came out on.",
        "1677.88": "History is not gonna repeat itself.",
        "1680.04": "But in my mind, these are the trends that we're starting to see.",
        "1682.52": "So yeah, I was directing like 90% of the whole article.",
        "1686.6": "And that is really where I put a lot of effort in.",
        "1689.96": "I spent at least a good 6 to 20 hours each week on my blog.",
        "1695.56": "Yeah, and maybe just like...",
        "1697.32": "So many bloggers have stopped blogging, you know?",
        "1699.24": "I mean, they went on to TikTok, IG, YouTube already.",
        "1701.96": "But they're still working on it.",
        "1703.24": "Yeah, because like also, I feel like when I sit down",
        "1706.2": "and I work on a blog article, right?",
        "1707.56": "That's where I get to, you know, open like 200 tabs",
        "1709.88": "and look at a lot of research and then pull and consolidate and all.",
        "1712.6": "And that whole curation and crafting of a direction,",
        "1716.92": "a story and angle, there's a lot more effort",
        "1720.12": "and there's more direction.",
        "1723.24": "There's more focus.",
        "1725.8": "It's hard to get that on TikTok or Instagram.",
        "1728.52": "The medium doesn't allow for depth.",
        "1730.12": "Correct. Correct. Yeah.",
        "1731.4": "So I'm really proud of the work that I have on the blog.",
        "1734.04": "Yeah, and I think people should really, really learn.",
        "1736.12": "So I have almost 500 articles on the blog.",
        "1738.28": "No, I think people don't realize.",
        "1739.64": "Yeah, but if someone just reads through all my old content, right?",
        "1743.32": "And you just eliminate those that are time-sensitive",
        "1745.48": "like promotions and stuff like that, which are very rare anyway.",
        "1748.28": "There's a lot of insights and gems that can be learned from there.",
        "1751.24": "Yeah, and I think there are also a lot of local blogs",
        "1753.48": "that we can learn from.",
        "1754.6": "Also a lot of US blogs.",
        "1756.44": "There are great writers on Substack, Seeking Alpha,",
        "1760.6": "where else? Medium, Twitter.",
        "1763.96": "It's really about finding the ones that you resonate with.",
        "1767.56": "The ones whom you respect them and you like the way they think",
        "1771.8": "and analyze businesses and investments.",
        "1774.2": "And then following them.",
        "1775.4": "Because there's just so many writers out there.",
        "1777.48": "It's just like how it's impossible to read the works",
        "1779.8": "of every single author in the world, the world's library.",
        "1783.24": "It's very hard to read all the blogs out there",
        "1785.24": "on investing and finance as well.",
        "1786.84": "So, it's really about picking those that resonate with you",
        "1789.32": "and then sticking with them.",
        "1791.08": "Yeah, feel free to switch if you suddenly think",
        "1793.48": "that the author has deviated.",
        "1795.4": "Because we invest differently, right?",
        "1797.16": "If all along you will grow, but now you feel that you got burnt in growth",
        "1801.08": "and you want to go more towards like index funds,",
        "1803.32": "then go and find an index writer.",
        "1805.24": "Yeah, I'm sure there's lots of great ones out there.",
        "1807.56": "All right. Thank you.",
        "1808.68": "Thank you, Dawn.",
        "1809.4": "Welcome.",
        "1809.9": "Yay!",
        "1839.9": "And remember, personal finance can be chill, clear and sustainable.",
        "1869.9": "ClickUp's massive unlimited plan for a year,",
        "1871.9": "meaning you can start reclaiming your time for under $5 a month.",
        "1874.94": "Sign up today at ClickUp.com and use code BizTech.",
        "1877.74": "Hurry, the software ends soon."
      }
    },
    {
      "id": "8",
      "title": "What’s The Best Way To Budget Your Salary",
      "url": "https://www.youtube.com/watch?v=ZZUb95pjgBQ",
      "content": "This is a placeholder summary text.",
      "transcript": {
        "0.0": "It's an ongoing cycle.",
        "1.36": "You're wanting the thing and then you're buying the thing.",
        "3.92": "But if you interrupt that cycle, you stop at the buying part,",
        "7.68": "then you can analyze the wanting part",
        "9.56": "and why you want something.",
        "11.04": "That's what I'm doing with this no buy or low buy.",
        "13.6": "I am interrupting that thought process",
        "15.44": "so that I can better understand myself.",
        "17.4": "So I am stopping the car and seeing",
        "19.48": "how I can change certain things or repair certain things.",
        "25.4": "Everyone gets AT&T's best deal on the new iPhone 14 Pro",
        "29.32": "with the incredible camera.",
        "30.88": "So people currently listening to comedy podcasts,",
        "34.6": "and people listening to political podcasts,",
        "37.12": "and people listening to true crime",
        "38.68": "podcasts who actually can't stop listening to true crime",
        "41.16": "podcasts if it's ruling their lives.",
        "43.04": "The point is everyone, new and existing customers.",
        "46.96": "Ask how to get up to $800 off the new iPhone 14",
        "49.88": "Pro with eligible trade-in.",
        "51.48": "Visit att.com or our stores for details.",
        "54.16": "Terms and restrictions may apply.",
        "59.32": "Hello, my name is Andrew and welcome to another episode",
        "62.32": "of Chill with TFC, where we chat with the geekiest",
        "65.16": "and quirkiest minds to learn how they think",
        "66.96": "about money and life.",
        "68.44": "Today, we'll be chatting with Lisa.",
        "70.24": "You might know her from her YouTube channel,",
        "72.08": "Lisa's Adulting in Singapore.",
        "74.44": "And she has viral videos like,",
        "76.0": "how I bought a resale HDB at 24 years old.",
        "78.64": "She talks about her finances and her budget",
        "80.68": "on her YouTube videos.",
        "81.92": "And if you're curious about how I bought",
        "83.84": "a resale HDB at 24 years old,",
        "85.48": "you can check out her YouTube channel",
        "87.04": "on her YouTube videos.",
        "88.28": "And if you're curious about how talking about",
        "90.24": "your finances openly changes your relationship",
        "92.84": "with money, stay tuned.",
        "94.28": "Don't forget to stay to the end",
        "95.36": "for our rapid fire money questions.",
        "101.04": "Hello, Lisa, welcome to TFC.",
        "102.76": "Hello.",
        "103.6": "So Lisa, Lisa runs a channel, YouTube channel,",
        "105.96": "and it's called Lisa's Adulting in Singapore.",
        "108.0": "Tell us about the channel.",
        "109.24": "When did you start it and why did you get started on it?",
        "112.04": "Yes, so I started my channel at the beginning of this year,",
        "115.04": "towards the end of last year.",
        "116.64": "So I, at the end of the year,",
        "118.24": "I resolved to do a low buy year,",
        "120.44": "which I'll talk about in detail later.",
        "122.04": "But as part of the low buy year,",
        "123.36": "I wanted a place to document my progress with it.",
        "126.32": "And so I watched a lot of YouTube videos.",
        "128.88": "I watched people talk about their low buy",
        "130.44": "or their no buy project on YouTube.",
        "132.28": "And so I thought, it's like two birds with one stone, right?",
        "135.52": "I want to share my progress with this project.",
        "139.56": "And then it was also something for me to do on the side,",
        "142.0": "outside of work.",
        "143.96": "And yeah, so I started the YouTube channel.",
        "147.2": "There were different options, right?",
        "148.04": "So I could have done a blog,",
        "148.88": "I could have done a YouTube channel,",
        "149.72": "but it felt like a lot of the people I was watching",
        "151.36": "was on YouTube.",
        "152.2": "And I wanted to do a bit of video editing,",
        "154.72": "see what I can learn from the work of producing a video,",
        "158.6": "which is why I went with YouTube.",
        "161.0": "And as for the content of the channel,",
        "162.88": "I meant for it to be,",
        "164.44": "and I still mean for it to be like a video journal",
        "166.68": "of my journey with adulting and all the work",
        "171.56": "that is involved, like from managing personal finance",
        "174.36": "to housing, what it's like to, in my case,",
        "178.36": "live in a HDB flat and manage the HDB flat.",
        "180.88": "I also wanted to go into things like mental health,",
        "184.16": "some behavioral things,",
        "185.76": "but so far it's been quite a slow start.",
        "188.04": "My content has been quite focused on personal finance,",
        "190.52": "but that is the overall plan for the channel.",
        "194.44": "Yeah, the main series on my channel is the money diaries,",
        "197.0": "which is like a month by month recap",
        "199.04": "of how the low buyer is going.",
        "200.8": "And I literally just tell everybody",
        "202.08": "what I've bought for the month.",
        "204.48": "And also my channel name is Adulting in Singapore, right?",
        "207.72": "So I thought the including that Singapore",
        "209.72": "was quite important because it contextualizes",
        "212.32": "everything that I'm talking about.",
        "213.84": "It's a bit clunky, like the whole channel name,",
        "216.68": "Lisa's Adulting in Singapore, but it's stuck.",
        "218.6": "And when I thought about it, it's stuck.",
        "220.0": "And yeah, I think for now that is the name I wanna go with.",
        "223.6": "It makes sense.",
        "224.44": "I mean, adulting is a phrase",
        "226.2": "that's been talked about in recent years",
        "227.76": "and on your channel, we don't get to see your face.",
        "231.08": "So it's actually, it does read like a blog",
        "233.72": "because you've written the script, you structure it,",
        "237.12": "and then you present it, but your face is behind the camera.",
        "240.16": "So if you're watching this on YouTube right now,",
        "241.56": "this could be the first time that Lisa has revealed her face",
        "245.92": "on the internet and all that.",
        "248.16": "So adulting in Singapore, first, how do you define adulting?",
        "251.68": "And since we're on the financial coconut,",
        "253.56": "you can define it in relation to money,",
        "255.52": "of course, other aspects as well.",
        "256.76": "And what are your first few steps to adulting?",
        "259.2": "How do you get started in adulting?",
        "261.12": "I guess if you look online,",
        "262.52": "the definition is something like the assumption of tasks,",
        "266.72": "responsibilities, or behaviors that you associate",
        "270.16": "with what a mature grownup or adult will do.",
        "273.96": "For myself, if I think working backwards",
        "276.36": "with your questions, like how do I,",
        "277.92": "what are the first steps to adulting?",
        "280.2": "When did you first like, okay, I'm adulting.",
        "282.68": "Now I'm an adult and I have adult responsibilities.",
        "285.24": "I think it comes with, and the realization can happen",
        "287.8": "at any point of your life, right?",
        "289.68": "It's not really tied to an age, like when you graduate,",
        "290.88": "although that's when it happens for most people.",
        "293.36": "You come to the realization that you are responsible",
        "296.6": "for your own life and for sustaining that life.",
        "299.2": "And it can also come together with realizing",
        "301.28": "that you might be responsible for someone else's life.",
        "303.64": "It could be your parents.",
        "305.32": "It could be your children, if you're in that stage already.",
        "308.76": "So it's like understanding that you have that burden",
        "311.92": "of responsibility on you, and then taking steps",
        "314.88": "to do the things that would help you support",
        "319.68": "and sustain that life.",
        "320.76": "A big part of it is knowing for yourself",
        "323.08": "that you cannot really live",
        "324.24": "in the blissful ignorance anymore.",
        "327.28": "And I think many associate adulting",
        "329.68": "with very straightforward, like financial related tasks",
        "332.88": "or like knowing what phone plan to choose",
        "335.2": "or understanding CPF or knowing what the heck are taxes",
        "338.24": "and how much you have to pay.",
        "339.64": "And these are for sure like the low hanging fruit",
        "342.04": "of things that you should ideally seek to know more about,",
        "346.56": "not for its own sake, but because these are things",
        "349.12": "that you have to do in the context of the society",
        "352.44": "that you are in.",
        "353.28": "It's part of you having to be, part of you wanting",
        "356.84": "to be a functional member of society in the context",
        "359.84": "of the place that you live in.",
        "362.04": "And so this can differ from place to place.",
        "365.0": "Yeah, were there any skills that you have to pick up?",
        "366.92": "How did you get started?",
        "368.28": "When did you realize that, okay.",
        "369.48": "For myself, I think the financial management came",
        "373.0": "before the concrete realization",
        "375.2": "that I have to be the adult now.",
        "377.28": "And that was when I was in JC,",
        "379.68": "I, for the first time, I got my own money",
        "382.92": "through a scholarship when I was in school.",
        "384.76": "So that wasn't money that I got from my parents",
        "386.96": "as allowance, that was money that was mine.",
        "389.64": "So that was the first time I thought,",
        "390.96": "okay, I have to manage this somehow.",
        "392.96": "And then I was 16 at the time,",
        "394.2": "which is when you can get an ATM card.",
        "395.96": "So that's when I started tracking what I was spending on.",
        "399.56": "And a lot of it was like food and whatever other things",
        "402.44": "that I could buy online.",
        "404.2": "Of course, at that time, I didn't know about investing.",
        "406.4": "I didn't know about any sort of budgeting framework.",
        "408.88": "All I knew was that I needed to write down",
        "411.16": "what I was spending on and also how much money I had left.",
        "414.76": "So that was the very, very foundation.",
        "417.2": "And then that feeling of adulting,",
        "419.64": "which is also about maturity, right?",
        "422.88": "And not just about the things that you do,",
        "424.4": "but your relationships with people",
        "426.12": "and how you treat them and how you are around them.",
        "429.08": "That maturing is part of the adulting journey, I think.",
        "432.8": "So that came to me much later after I graduated,",
        "436.04": "when I had to start supporting my family.",
        "438.48": "And I knew that I needed to carry myself in a certain way",
        "441.4": "and make decisions in a certain way",
        "442.92": "that is influenced by my circumstances",
        "445.44": "and wanting to have the best possible situation for them",
        "448.72": "with whatever resources we had to work with.",
        "450.88": "You definitely started relatively younger.",
        "453.0": "You're already tracking your expenses at the age of 16.",
        "455.88": "I mean, well, I wasn't doing that for sure at 16.",
        "459.28": "I was still getting pocket money, spending with it,",
        "461.92": "but I didn't know where the money was going.",
        "463.76": "So it started relatively young.",
        "465.32": "And then you mentioned that as you grew up,",
        "467.96": "you have to also take care of some responsibilities at home.",
        "471.88": "Could you share a bit about that?",
        "473.36": "Right, and give us an idea of what that is like.",
        "477.2": "When I was in my final semester, my father passed away.",
        "481.08": "So he was the primary breadwinner",
        "483.88": "and manager of the household in that sense.",
        "487.76": "So after he passed away, I am the oldest in the family.",
        "491.56": "So I took over because my mother is not educated",
        "495.24": "and she's also not Singaporean.",
        "497.52": "So there were a lot of things that I had to learn.",
        "500.0": "The worst case scenario is of course,",
        "501.76": "she cannot stay in the country.",
        "502.88": "So that was my perspective.",
        "504.44": "How do I keep her here with my family so that we...",
        "508.16": "Can stay together as a family unit, right?",
        "511.04": "And how, at the time we were staying with my father's sister.",
        "515.6": "So in terms of having a roof over our heads,",
        "517.56": "having food on the table,",
        "518.92": "that wasn't really the issue immediately.",
        "521.88": "And so I was kind of shielded from that also.",
        "524.24": "So I assumed responsibility, but I think only in name",
        "528.48": "with the understanding that, okay,",
        "529.88": "the responsibilities maybe will come later",
        "532.04": "in terms of the actual work that I have to do.",
        "533.72": "And it did come later.",
        "534.64": "It came in 2020 when I made a decision to move my family out.",
        "538.6": "And so from there,",
        "539.84": "I had already been working for about six months.",
        "542.16": "I was also at the time reading a lot about personal finance.",
        "545.92": "Now that I had an income, now that I had a family to support,",
        "548.44": "I was wondering what is the best way to work with what I had",
        "552.0": "to support my mother.",
        "553.56": "And at the time also my brother was just finishing up",
        "556.64": "his junior college.",
        "557.76": "And then from there, it's just like a ongoing list",
        "560.68": "of things that I am learning about and executing.",
        "564.24": "So having to buy the house, that was a big thing.",
        "566.52": "And I did it at my...",
        "567.4": "I had to do that by myself because I was...",
        "569.8": "My mother couldn't buy a house, obviously.",
        "571.6": "And I'm the one with the job.",
        "573.76": "And then after getting the house,",
        "575.36": "okay, how do I make the house livable?",
        "577.2": "How do I renovate it?",
        "578.68": "And then what electricity retailer do I go with?",
        "581.56": "I mean, even before the house,",
        "582.88": "I was reading up on investing and,",
        "585.88": "oh, what the heck are ETFs and unit trust?",
        "587.8": "And where do I put my money?",
        "589.28": "What is trustworthy?",
        "590.36": "It's just an ongoing list of things",
        "591.8": "that you move forward to learn about",
        "594.16": "because with knowledge comes power to make educated",
        "598.0": "and intentional decisions.",
        "600.0": "So I was just absorbing everything that I could,",
        "602.64": "learning everything that I could",
        "604.0": "in order to live what I thought was",
        "606.6": "the best life within my means right now.",
        "609.16": "So the situation with your mom and the passing of a dad,",
        "613.28": "and that is really a level up in terms of adulting.",
        "615.76": "And you mentioned about a house,",
        "616.96": "you spoke about it in detail in one of the videos.",
        "619.48": "It's very in-depth, about 15 minutes long, if I...",
        "622.4": "Yeah, if I do not remember wrongly.",
        "623.6": "And it was, okay, the title of the video,",
        "625.52": "if you want to look it up,",
        "626.36": "is how I bought a resale HDB at 24 years old as a single.",
        "631.52": "So that's very impressive.",
        "632.96": "And it's a very popular video.",
        "634.6": "Many people clicked on it.",
        "636.28": "All the details are in there,",
        "637.24": "but could you give us an idea",
        "639.2": "so that we can get an idea of what is it about?",
        "641.24": "And then we can look into the video",
        "642.6": "for the rest of the details.",
        "644.6": "The video itself is titled",
        "646.0": "how I bought a HDB at 24 years old.",
        "648.44": "So I mentioned it in a previous video",
        "651.12": "that how I budget my 3.2K salary, something like that.",
        "654.56": "So a lot of people were already asking,",
        "656.52": "can you make a follow-up?",
        "657.44": "Like how the heck do you get a HDB at 24 years old?",
        "660.28": "So it starts out with intriguing situation,",
        "663.28": "because the general belief is that",
        "665.56": "unless you are 35 years old,",
        "667.96": "you cannot buy a house,",
        "669.04": "you cannot buy a HDB as a single.",
        "671.64": "The thing is you can, and...",
        "673.84": "So you need to get resale, then you need capital.",
        "676.04": "Yeah, only resale and you need money.",
        "678.96": "But in terms of the application process,",
        "681.64": "I didn't appeal to anybody in terms of buying the house.",
        "684.84": "I appealed for other things,",
        "685.96": "but buying the house was not one of them.",
        "687.56": "There's a whole list of schemes",
        "689.6": "that determine whether or not you're eligible.",
        "691.52": "And I happened to be eligible through one of the schemes.",
        "694.96": "And because of course there are going to be",
        "696.92": "exceptions to the norm,",
        "698.48": "and like the most common exceptions,",
        "700.08": "they will have a scheme for it.",
        "701.76": "Like if you're a, say a divorced parent with children,",
        "705.0": "or you're an orphan.",
        "706.28": "So for myself, it was the non-citizen family scheme",
        "708.68": "where I was applying with a non-citizen parent.",
        "711.48": "So yeah, so that was definitely something that was not known.",
        "716.92": "And so it became an interesting situation,",
        "719.2": "which I put in the title,",
        "720.28": "and I think that's why people clicked on it.",
        "721.64": "The how of it, I covered very clearly in the video,",
        "724.8": "in terms, and also what the process was for buying the house.",
        "727.88": "But I think more interestingly,",
        "729.36": "the why of it is also something that I covered",
        "732.16": "and is in the video.",
        "733.76": "Right, you were forced by circumstances in a way.",
        "736.04": "I think when people saw the title, it feels aspirational.",
        "738.72": "Yeah.",
        "739.56": "What can I do to buy a HDB at 24 years old?",
        "742.76": "I think I shattered that.",
        "744.16": "Yeah, exactly.",
        "745.0": "I undercut that.",
        "745.84": "And then it's like the bait and switch,",
        "747.0": "and you went into something deeper.",
        "748.28": "Yeah.",
        "749.12": "So you ended up telling me how you really share",
        "751.04": "your own personal situation.",
        "752.48": "And my takeaway was that it's really personal.",
        "755.16": "Everybody's situation is different.",
        "757.2": "And so this is what you have to go through",
        "759.6": "as compared to someone who aspires to get a HDB",
        "762.4": "at a young age, but you were forced by circumstances.",
        "765.48": "I didn't think about it as being aspirational, actually.",
        "768.12": "Like the whole time when I was going through the process",
        "769.8": "and even making the video, in my head, it was like,",
        "771.68": "oh, it's a heavy story,",
        "773.16": "like a lot of regret and frustration.",
        "775.64": "Like the thought of it being aspirational or inspiring",
        "778.16": "came a lot later.",
        "779.88": "After I published the video,",
        "780.72": "even the thumbnail, I remember I took a picture",
        "783.92": "and I put a black overlay on it",
        "785.2": "so that the text can appear more,",
        "786.64": "but basically it didn't look like,",
        "788.08": "wow, look at me, I did this.",
        "790.4": "Exactly.",
        "791.24": "Because that's more of your style, actually,",
        "792.96": "which is why you so don't appear in the videos.",
        "794.52": "Oh, yeah, yeah.",
        "797.36": "Everyone gets AT&T's best deal on the new iPhone 14 Pro",
        "801.24": "with the incredible camera.",
        "802.8": "So people currently listening to comedy podcasts",
        "806.32": "and people listening to political podcasts",
        "808.96": "and people listening to true crime podcasts",
        "811.08": "who actually can't stop listening to true crime podcasts",
        "813.48": "and it's ruling their lives.",
        "814.88": "The point is everyone, new and existing customers.",
        "818.8": "Ask how to get up to $800 off the new iPhone 14 Pro",
        "822.0": "with eligible trade-in.",
        "823.32": "Visit att.com or our stores for details.",
        "826.0": "Terms and restrictions may apply.",
        "830.12": "You also mentioned in another video",
        "831.12": "how you live on a $3,200 monthly salary in Singapore",
        "834.72": "and that did well too, right?",
        "836.6": "That is still the best video on my channel.",
        "839.12": "Awesome.",
        "839.96": "Goat.",
        "840.8": "Yeah, yeah, yeah, the goat.",
        "842.12": "The goat of your channel, right?",
        "843.4": "So what is it about?",
        "844.68": "Could you share with us how did you live",
        "846.0": "on your $3,200 monthly salary?",
        "848.24": "I think that's my second video on the channel",
        "851.04": "and when I made the decision to start my YouTube channel,",
        "855.56": "that was one of the first videos I planned to make",
        "857.88": "because it contextualizes everything, right?",
        "860.24": "Like what's my monthly income, what I'm working with",
        "863.84": "and why is the lifestyle that I'm living now.",
        "866.6": "Why do you think it blew up though?",
        "868.72": "Oh, why I think it blew up?",
        "871.08": "So a combination of two things.",
        "872.72": "Firstly, I think it was about February or March",
        "875.6": "that it started blowing up.",
        "877.56": "Like I was getting thousands of views each day",
        "880.8": "and also a lot of people subscribing, which was insane",
        "883.32": "because from December, end of December",
        "885.32": "when I created the channel to February,",
        "888.72": "I think I had like 30 subscribers and a few hundred views",
        "892.96": "which already felt like a lot.",
        "895.48": "But when it blew up, I think is",
        "897.52": "when the Singapore budget 2022 came out.",
        "900.04": "So I'm thinking with the algorithm and the keywords",
        "902.72": "because I kind of had all the keywords, I had budget,",
        "904.76": "I had Singapore, I had 2022.",
        "906.72": "So YouTube and Google itself was already, okay,",
        "909.36": "maybe my video time to push out now",
        "911.2": "because it intersects with the Singapore budget",
        "912.8": "that was coming out at the time.",
        "914.12": "And then the second thing that happened was",
        "915.64": "there was this really nice guy called Christopher.",
        "917.52": "I don't know him personally,",
        "918.4": "but there is this personal finance group",
        "920.4": "by Seedly on Facebook, right?",
        "921.88": "So he posted my video on there",
        "923.12": "and a lot of people found me through that Facebook group.",
        "926.32": "So those two things I think led to my video",
        "929.48": "being pushed by YouTube.",
        "931.36": "Really? You think it's the keyword?",
        "933.72": "It was the budget period?",
        "935.12": "I think so.",
        "935.96": "Are you just now playing yourself?",
        "937.4": "Really?",
        "938.24": "I mean, why else?",
        "939.08": "Because until February, nobody was looking at it.",
        "942.08": "And so it just so happens.",
        "943.36": "And I thought about it, like it crossed my mind.",
        "945.12": "Like, do you think maybe during the budget",
        "946.8": "with the algorithm, YouTube will push my video out?",
        "949.6": "Because I'm sure there are other channels",
        "951.12": "that are really budget related.",
        "952.2": "Yours is not even about the Singapore budget.",
        "953.72": "It's a personal budget.",
        "954.8": "Just that the keyword is the same, right?",
        "956.0": "Budget.",
        "957.16": "Contact location also the same.",
        "958.88": "Yeah, Singapore, Singapore.",
        "960.56": "I'm sure there are other videos with the word budget in it,",
        "962.84": "but they did not go up.",
        "963.76": "Plus the Christopher sharing on there.",
        "965.36": "Yeah, plus Christopher sharing on Seedly.",
        "967.84": "And okay, maybe if we look at my content,",
        "970.88": "the content of the video,",
        "972.28": "I mean, people understand theory very well, right?",
        "974.4": "They understand, like if you read about it,",
        "976.32": "you know what the 50-30-20 rule is telling you to do",
        "979.88": "or advising you to do.",
        "981.36": "But my video itself,",
        "983.48": "I am fully transparent about where each dollar is going.",
        "986.32": "Like what am I putting towards investments?",
        "988.12": "What am I putting towards fixed expenses and bills?",
        "990.6": "Before that, could you tell us about the 15-30?",
        "992.76": "Oh, okay.",
        "993.64": "I read about it on Seedly.",
        "995.0": "I don't think they came up with it, but I'm not sure.",
        "998.12": "It's a framework where you budget 50% of your salary",
        "1002.12": "towards expenses, 20% to savings, I believe.",
        "1007.84": "Yeah, 20% to savings,",
        "1009.08": "which is like your immediate emergency savings.",
        "1011.72": "30% to wealth.",
        "1012.56": "I've seen it.",
        "1013.4": "Investments, right?",
        "1014.24": "Oh yeah, yeah, wealth investments,",
        "1015.84": "putting towards retirement",
        "1017.08": "or any sort of long-term goal that you have.",
        "1018.76": "I think buying a house can be considered wealth.",
        "1021.12": "So it's really up to you to define.",
        "1023.52": "There's so many frameworks out there,",
        "1024.92": "but of course you have to adjust the percentages",
        "1026.8": "to your own scenario.",
        "1027.64": "Because sometimes expenses you cannot really change.",
        "1030.24": "So for me, I use that as a broad framework",
        "1032.84": "to think about how I should be budgeting my salary,",
        "1035.6": "because otherwise there's like a million different ways",
        "1037.88": "that you can organize your finances.",
        "1039.76": "So just having something as broad as that",
        "1042.24": "can help as a starting point.",
        "1043.64": "Yeah, and to keep you like in that general direction",
        "1046.48": "or trajectory.",
        "1047.8": "Yeah, I've seen like 10% for contributions,",
        "1050.4": "10% to parents, 10% that kind of thing.",
        "1052.8": "So there are just a bunch of different ways.",
        "1054.6": "I've also heard people saying that maybe 30% to wealth",
        "1056.8": "is too much and 50% is meant to be like for fixed expenses",
        "1061.0": "and then 20% for whatever you want to spend.",
        "1063.56": "Also, it's really up to you.",
        "1064.8": "It depends on your income as well.",
        "1066.2": "It depends on your income.",
        "1067.04": "3.2K is different from 10K, 20K.",
        "1069.32": "Yeah, for sure.",
        "1070.8": "So for myself, that's the framework that I go with",
        "1074.96": "because it's just easy to remember",
        "1077.0": "for where I am right now.",
        "1078.32": "And 3.2K, I think it's very relatable to many Singaporeans.",
        "1082.44": "Looking at this number,",
        "1083.6": "of course some YouTube channels or blog posts, articles,",
        "1086.92": "they will have like some crazy figure, right?",
        "1088.68": "But your content feels relatable.",
        "1091.4": "Something that, you know, yeah, this is my situation.",
        "1094.4": "And to add on to that,",
        "1095.8": "because people don't even talk about salary to begin with.",
        "1098.64": "So you don't even...",
        "1099.2": "It's a secret?",
        "1099.72": "You think that people don't share about it openly?",
        "1102.16": "Like, don't you think it's like a social thing?",
        "1103.56": "People don't really openly share how much they earn.",
        "1105.52": "Like they say, oh, like I'm quite well to do",
        "1107.92": "or like I earn high five figures, high four figures.",
        "1111.4": "I don't know.",
        "1111.76": "Like they put it in all these big terms.",
        "1113.52": "So even somebody telling you the exact numbers of",
        "1116.16": "their monthly income is rare, I feel.",
        "1119.44": "And on top of that, to so transparently share",
        "1122.56": "where that money is going, how that money is budgeted.",
        "1125.4": "Because context is very important here.",
        "1127.2": "Somebody, you can earn the same as your friend.",
        "1129.44": "Like both of you can be earning say 4.5K,",
        "1131.92": "but your material quality of life will look so different",
        "1134.36": "depending on your situation.",
        "1135.48": "Like if you're a single person living with your parents",
        "1137.64": "compared to if you're like a divorced mother",
        "1139.08": "with two children, both of you earning 4.5K,",
        "1141.6": "but your quality of life,",
        "1143.6": "your material quality of life can look so different.",
        "1145.92": "And so that was what I was hoping to share,",
        "1147.88": "like my salary, but also how I am working within",
        "1152.88": "this income to lead the life that I'm living now.",
        "1156.64": "And you need that kind of understanding of context",
        "1159.52": "to have empathy and to feel an emotional connection",
        "1163.48": "or like a connection that, you know,",
        "1165.44": "someone else is going through the same thing as you are.",
        "1168.0": "So that's like two sides I'm hoping to provide",
        "1171.28": "in this space, not just transparency about numbers,",
        "1173.72": "but also hopefully a more nuanced understanding of context.",
        "1177.52": "Yeah, I think the context is very important, right?",
        "1180.0": "Whether it's, we mentioned 3.2K or 10K,",
        "1182.44": "putting 50% of expenses would mean different things",
        "1185.08": "for different people.",
        "1185.96": "So about your standard of living,",
        "1187.24": "your personal choices in life.",
        "1189.56": "And, but what do you think about this whole trend",
        "1193.56": "that we are not willing to really share our income",
        "1198.72": "and you put your income out there openly?",
        "1200.72": "Yeah, yeah.",
        "1203.24": "Trend of not sharing income.",
        "1204.84": "I think that there are also some company policies.",
        "1207.04": "It's not a trend, it's a culture,",
        "1208.4": "culture would be a better word.",
        "1210.68": "Culture also reinforced by some company policies.",
        "1214.36": "I think you're not even allowed to talk about salary",
        "1216.32": "with your colleagues.",
        "1217.92": "So that one, I am for being open and transparent about it,",
        "1222.24": "but I've heard of company policy saying you cannot discuss.",
        "1225.16": "So I really don't know.",
        "1226.24": "I think the trend now compared to last time",
        "1230.04": "is more transparency, more openness to talking about it.",
        "1233.76": "Cause I think it's a negotiating point also.",
        "1236.2": "And you know, there was a whole thing where it was revealed",
        "1238.28": "that female employees are paid less",
        "1240.2": "and like the lack of transparency and discussion",
        "1242.96": "around salary contributes to that imbalance.",
        "1247.4": "So I see, I think the younger generation",
        "1250.72": "is more open to speaking about it, but it's not,",
        "1253.04": "I don't know, I guess people don't consider it",
        "1254.4": "polite conversation also to talk about how much you earn.",
        "1257.16": "Yeah, it's quite an individual personal decision",
        "1260.08": "for me to just like, you know what, I don't care.",
        "1261.44": "Like here's how much I earn.",
        "1263.08": "I see no shame in sharing it.",
        "1267.4": "Of course I've read articles that take the position",
        "1270.56": "of openness, transparency, because it like says",
        "1273.8": "a negotiating factor for companies, right?",
        "1275.8": "So when HR asks you, what's your previous salary",
        "1278.12": "and what's the expected salary,",
        "1279.32": "they have all the information,",
        "1280.2": "all the negotiating chips on their hands.",
        "1282.28": "Like you don't know anything, you don't know the budget,",
        "1283.88": "you don't know what was the previous person salary",
        "1286.32": "and you're just going blind.",
        "1287.68": "So, and there's this talk about that as well.",
        "1289.44": "And of course you mentioned about women's salary",
        "1291.84": "in a workplace being less than the male counterparts",
        "1295.12": "and it's being unfair.",
        "1295.96": "And that's because we don't have transparency",
        "1298.08": "on this whole situation.",
        "1298.92": "We don't have visibility on it.",
        "1300.56": "Yeah, it's very foggy right now.",
        "1302.76": "So that's one thing that we can really think about.",
        "1304.96": "And someone has to start, right?",
        "1306.36": "You put yourself out there first",
        "1307.52": "and you say this is your salary.",
        "1309.52": "How am I supposed to talk about my budget",
        "1310.96": "if I don't share my salary?",
        "1312.16": "I don't know, that was my thinking.",
        "1313.4": "Yeah, that makes sense.",
        "1315.4": "Maybe there is a very good reason",
        "1316.64": "why you shouldn't be sharing your salary to others,",
        "1319.12": "let alone online.",
        "1319.96": "But from where I am and where I was when I made that video,",
        "1323.36": "I'm still, I didn't see any other way.",
        "1326.24": "Okay, so two of your videos that blew up,",
        "1327.96": "one is on your monthly salary",
        "1329.24": "and the other one is on your HDB resale at 24 years old.",
        "1332.28": "How about something that you like among all these videos?",
        "1335.04": "Oh, um...",
        "1336.08": "You know, if something not blow up,",
        "1337.56": "the video is still there, but you love it so much.",
        "1339.16": "Like, so precious, why no one is clicking on it?",
        "1341.08": "For sure, for sure.",
        "1342.4": "Something like that.",
        "1343.68": "But I think it's also expectations versus reality.",
        "1346.12": "Okay.",
        "1346.96": "I mean, with the 3.2K video and the HDB video,",
        "1350.0": "I sort of knew that even beyond me,",
        "1352.44": "these videos would travel to a wider audience",
        "1355.92": "that is outside of the core audience",
        "1358.2": "that maybe cares about all the videos that I make",
        "1360.36": "or most of the videos that I make.",
        "1361.72": "The only series and the longest running series",
        "1363.8": "on my channel is my money diaries.",
        "1366.76": "Yeah, so that is the month by month follow up",
        "1369.12": "on the low buy project that I am doing, right?",
        "1371.96": "Maybe we can go into the low buy project at this point.",
        "1374.24": "So what is low buy and what is no buy?",
        "1376.4": "You know, the concept of it.",
        "1377.92": "So low buy is a variation of the no buy.",
        "1380.28": "So the no buy year is a project",
        "1383.04": "where you basically don't buy anything",
        "1385.72": "that is considered a non-necessity.",
        "1388.04": "Again, like definitions are all up to you here",
        "1390.04": "because what is a necessity to you",
        "1392.16": "is different to another person.",
        "1394.72": "But the gist of it is that you don't buy anything",
        "1396.8": "that is outside of the necessity category.",
        "1400.68": "And it could be that you do a no buy",
        "1403.16": "on certain categories as well.",
        "1404.56": "Like if you identify, say, clothing as your problem area",
        "1407.8": "that you want to do a no buy on,",
        "1409.04": "you can just restrict yourself in that category.",
        "1411.16": "And you don't buy anything for a certain period of time.",
        "1414.12": "It's not a lifestyle thing.",
        "1416.04": "Because if it's a lifestyle, then it's just your life.",
        "1418.0": "But it's more like a short-term project, I would say.",
        "1421.04": "It could be a month, it could be a year.",
        "1423.96": "And it's kind of like committing to an exercise regime",
        "1427.44": "or a specific diet for a certain period of time.",
        "1430.24": "So I see it in that kind of way.",
        "1432.48": "And then the low buy is a variation of that,",
        "1434.04": "which means that you impose a certain restriction",
        "1436.72": "on yourself.",
        "1437.56": "So for myself, it's $50 a month",
        "1439.04": "on what I consider is a non-necessity.",
        "1442.16": "And people do it for all kinds of reasons.",
        "1444.04": "It could be for something as simple",
        "1445.88": "as wanting to save money for that month.",
        "1447.8": "A lot of the times I see people doing the no buy",
        "1450.72": "because there is something in their behavior",
        "1452.68": "or their mindset that they want to change.",
        "1455.04": "Or like a no buy or a low buy,",
        "1457.6": "where there is a restriction on the amount",
        "1460.44": "or the quantity that you can buy, that you can purchase,",
        "1463.24": "that really helps with sort of maybe resetting",
        "1466.04": "or helping you reevaluate some of your beliefs",
        "1469.2": "and attitudes towards spending.",
        "1472.04": "The reason why you put the brakes on spending, right?",
        "1474.2": "Is because like, say you're driving in a car",
        "1476.16": "and you think that the car is faulty,",
        "1477.36": "you cannot repair the car and drive at the same time.",
        "1480.4": "So-",
        "1481.24": "You gotta stop.",
        "1482.08": "Yeah, you gotta stop.",
        "1482.92": "Look for help or just help yourself.",
        "1484.24": "The whole emotional process from like wanting the thing",
        "1487.52": "to actually buying the thing, it's an ongoing cycle.",
        "1490.28": "You're wanting the thing and then you're buying the thing.",
        "1492.88": "But if you interrupt that cycle,",
        "1495.2": "you stop at the buying part,",
        "1496.6": "then you can analyze the wanting part",
        "1498.48": "and why you want something,",
        "1500.88": "why you think you want something.",
        "1502.56": "So that's what I'm doing with this no buy or low buy.",
        "1505.48": "I am interrupting that thought process",
        "1507.32": "so that I can better understand myself",
        "1509.08": "and what my motivations are without like the end result,",
        "1514.12": "the consequence of already having bought the thing.",
        "1516.72": "So I am stopping the car and seeing how I can like",
        "1519.88": "change certain things or repair certain things.",
        "1522.64": "Okay, can I call it a detox in terms of a personal finance?",
        "1526.28": "Because you used the diet example just now, right?",
        "1528.16": "So it's a change of money habits",
        "1529.6": "and suspending habits.",
        "1531.2": "So essentially, like I mentioned,",
        "1532.68": "it's not a permanent thing.",
        "1533.56": "It's not a permanent lifestyle that you have to stick to,",
        "1536.28": "but you can try it for half a year, one year.",
        "1538.32": "So for yourself, it's been half a year?",
        "1539.96": "Yeah, I've been doing it for one year.",
        "1541.68": "One year, so you've been updating regularly",
        "1543.72": "the money diaries on YouTube channel.",
        "1545.16": "What has been your experience so far?",
        "1547.0": "Let's sum up half a year.",
        "1551.4": "Well, it's some of my most vulnerable videos",
        "1553.32": "because firstly, I'm sharing everything that I bought.",
        "1557.32": "So vulnerable.",
        "1560.0": "Yeah.",
        "1561.88": "So I'm sharing that.",
        "1563.48": "And then also the mindset changes over the last six months.",
        "1568.04": "I go into depth about that.",
        "1569.68": "So I did a mid-year check-in",
        "1572.16": "and something that has come up was",
        "1575.52": "me feeling quite out of place",
        "1578.96": "because shopping and spending money is so normal, right?",
        "1584.04": "But when I purposely take myself out of that cycle,",
        "1588.8": "when I stop driving,",
        "1590.04": "it gives you a different perspective.",
        "1591.76": "And if you're the only one who has stopped",
        "1593.52": "by the side of the road,",
        "1594.64": "then you're kind of lonely",
        "1595.48": "because everyone's going on without you.",
        "1597.56": "And something that I realized was that",
        "1599.96": "I don't really know what to do when I'm not shopping",
        "1602.12": "or when I'm not trying to actively desire things",
        "1605.04": "and work towards buying the thing that I desire.",
        "1608.24": "So I've been trying to read more, trying to work more,",
        "1611.68": "but I'm not used to not having this pastime.",
        "1615.64": "And so that has been something that I need to reflect on.",
        "1621.92": "Like imagine you've been a meat eater all your life",
        "1625.04": "and then suddenly you cut out meat.",
        "1626.4": "Then you're like, what do I put in my meals?",
        "1627.96": "Yeah. And then all your friends are meat eaters.",
        "1629.44": "When you go out for gatherings,",
        "1630.4": "they're still eating meat.",
        "1631.32": "Yeah.",
        "1631.92": "And leaving you behind.",
        "1633.44": "So what do you do with your time, right?",
        "1635.16": "Like when you're not shopping,",
        "1636.52": "when you're not actively participating in...",
        "1640.68": "No, I am still participating, but at a much reduced level.",
        "1644.04": "Do you think parts of our identity,",
        "1645.64": "I mean, in this modern society,",
        "1648.12": "what you spend on, it forms part of who you are.",
        "1651.44": "Yeah.",
        "1652.68": "So I'm trying to find how else I can reinforce my sense of identity",
        "1657.48": "without needing to buy the things to reinforce that identity.",
        "1660.2": "Right. So without all this, who are you?",
        "1662.36": "Do you have that thought?",
        "1663.4": "Who am I in this process?",
        "1665.88": "I think that's a really valuable part of the low buy",
        "1668.84": "because it really puts you through this grueling process of",
        "1671.56": "self-reflection and self-evaluation.",
        "1673.56": "And it's not fun.",
        "1674.48": "I mean, you're still mulling over it.",
        "1676.36": "You're still thinking about it.",
        "1677.76": "There's no answer.",
        "1679.4": "Yeah. I've never committed to this length of a project before.",
        "1684.56": "So we'll update at the end of the year what my feelings are.",
        "1687.76": "But right now, at the six month mark, this is where I'm at.",
        "1691.16": "And that wasn't what you were expecting when you started, right?",
        "1693.2": "This realization that you're having right now.",
        "1696.44": "Did it serve what you intended for in the first place when you started this low buy year?",
        "1701.64": "Yeah, but expecting it is not the same as going through it.",
        "1704.24": "Ah, you kind of knew that you would.",
        "1706.64": "I knew intellectually that I'm going to probably go through some hard shit,",
        "1709.88": "but going through it is another thing.",
        "1712.36": "OK, climbing the mountain itself is another thing.",
        "1714.48": "You know it's going to be tiring, climbing this mountain.",
        "1716.48": "That's right.",
        "1717.24": "Going through it is another thing.",
        "1718.32": "Yeah. And a worry that I had was that I'll just give in.",
        "1721.72": "I'm just going to give up.",
        "1722.6": "In public, because you're doing it online.",
        "1724.4": "Yeah, so I think having the public YouTube channel helps.",
        "1726.56": "Yeah, accountability.",
        "1727.84": "But I am committed to the outcome, whatever it is.",
        "1730.96": "Like whatever realization I come to, the person that I become at the end of this year,",
        "1735.12": "I'm committed to seeing it through.",
        "1737.16": "It's just hard.",
        "1738.04": "I'm really interested in this journey of yours.",
        "1740.28": "I mean, it reminds me of a friend who quit Facebook.",
        "1743.12": "You know, several people have done that, right?",
        "1744.48": "Closed their Facebook accounts.",
        "1745.68": "And then, but what fills up that extra time that you have?",
        "1748.12": "I mean, OK, social media detox.",
        "1749.76": "OK, I'm using the word detox again.",
        "1750.76": "Yeah, that's a really good comparison.",
        "1752.6": "Right. And then so what fills up the time?",
        "1754.52": "Like, is it, did you use something else that is the equivalent of Facebook to fill up the time?",
        "1759.12": "You know, if you do that, you know, then what's the point, right?",
        "1762.56": "OK, yeah, I don't really have a clear answer.",
        "1764.36": "I have a friend who did that and then she was like saying,",
        "1766.08": "Oh, I just read more books.",
        "1767.16": "But I don't know, is it what she wanted when she turned off her Facebook account?",
        "1772.28": "It's not a one for one replacement, right?",
        "1774.6": "Like you just because you quit one habit, you immediately find another habit",
        "1777.52": "that can substitute what that previous habit was.",
        "1780.44": "So like reading books is not the same as scrolling social media.",
        "1783.64": "So I'm sure there was something else in there.",
        "1786.08": "Yeah, I think this whole journey of like really...",
        "1788.72": "Another episode.",
        "1789.52": "It's another episode.",
        "1791.24": "And it's about knowing who you are.",
        "1792.6": "I think that that's what intrigues me and I might want to do it because of that.",
        "1796.8": "It's almost feel like meditation, a form of meditation.",
        "1799.64": "In a sense that meditation, you go deeper into yourself,",
        "1802.36": "kind of who you are.",
        "1803.12": "So this process, what it feels like you could reach that end point.",
        "1806.96": "Yeah, we'll check in with you at the end of your review.",
        "1810.64": "But you also have to put up all your expenses,",
        "1812.92": "everything that you bought online for people to see, right?",
        "1815.72": "People judge you for it or?",
        "1817.4": "Yeah, it makes you think twice about what you want to spend on.",
        "1819.68": "Oh yeah, everything you spend on, people will know.",
        "1822.8": "Yeah.",
        "1823.84": "So far, no, nobody has criticized me outrightly about the things that I spend on.",
        "1828.48": "I do get comments like, think about your necessities, think about your needs.",
        "1832.44": "But the interesting thing is I am living quite a comfortable life.",
        "1836.96": "Like all my needs of survival and safety and comforts are cared for.",
        "1843.0": "Like I have put aside money for those expenses.",
        "1847.48": "So the things that I do share, I really like,",
        "1851.28": "as in the expenses that I share, that I make from my sinking fund.",
        "1855.4": "Oh no, should I define that?",
        "1857.36": "The expenses that I do share that are the more frivolous things,",
        "1860.64": "they are meant to be frivolous.",
        "1862.28": "Because I don't want to cut off completely",
        "1866.2": "being able to spend my money on things that are purely to give me joy and enjoyment.",
        "1872.08": "Do you recommend people try it?",
        "1873.48": "Low buy or no buy for let's say half a year, one year?",
        "1876.76": "Would I recommend people do the no buy for sure?",
        "1879.8": "At the very least, it will save you money",
        "1881.76": "because you are restricting spending in a certain area,",
        "1884.52": "provided of course you are not redirecting that money elsewhere",
        "1886.8": "and spending more somewhere else.",
        "1888.52": "But the potential for behavioural and mindset shifts,",
        "1893.4": "I think is the most valuable part of doing the no buy project.",
        "1897.96": "Like being able to self-reflect and evaluate,",
        "1901.44": "it's like starting exercise or a certain diet,",
        "1904.92": "but it's not necessary for financial planning or financial management or anything.",
        "1910.72": "It's really like a self-improvement project.",
        "1913.04": "That's how I see it.",
        "1913.96": "So you really bear it all online, at least in terms of your financials.",
        "1918.56": "You put it online for people to discuss, to comment",
        "1921.76": "and you see all these YouTube comments coming in, right?",
        "1924.68": "So what is your experience of that been so far?",
        "1927.28": "Like have your perspectives changed because of what you share",
        "1930.24": "and then what you commented back to you in the YouTube videos?",
        "1934.12": "What did you learn from that?",
        "1935.2": "This whole process of putting yourself out there",
        "1936.88": "and having people look at your finances in a spotlight.",
        "1940.72": "In terms of my individual personal guidelines and principles",
        "1945.08": "to how I manage my finances and how I think about money,",
        "1948.64": "it hasn't changed very much.",
        "1949.76": "The difference is that now I have made it public.",
        "1952.64": "And so previously when I was just absorbing knowledge,",
        "1955.72": "I was absorbing privately, right?",
        "1957.24": "And seeing how I can implement it in my life.",
        "1959.4": "So now I see what people say about how I've implemented things.",
        "1963.32": "It's like suddenly inviting a lot of guests to your house",
        "1965.92": "and then having them comment on how you've decorated it.",
        "1968.32": "Yeah.",
        "1969.04": "Whereas before you're just living by yourself",
        "1971.52": "and maybe inviting a couple of friends in.",
        "1973.28": "And that you didn't sweep the floor, you know,",
        "1974.88": "did things out of place.",
        "1976.0": "Yeah.",
        "1976.68": "So that's been something to navigate.",
        "1979.72": "Like how much weight do I give these comments?",
        "1982.2": "The hardest comments are the ones that are like directed",
        "1984.6": "at a specific vulnerability, right?",
        "1986.76": "Do you have an example of that?",
        "1988.8": "Somebody commenting how little I give my mother.",
        "1991.48": "That's personal.",
        "1992.2": "Okay, okay.",
        "1992.72": "But I get what you mean.",
        "1993.4": "It hits you at a core.",
        "1995.12": "Yeah, yeah, yeah.",
        "1995.6": "It's something very, very targeted and personal.",
        "1998.52": "For all the negative comments that I get,",
        "2000.72": "I feel like I get a hundred more positive ones.",
        "2003.0": "That's what I try to focus on.",
        "2005.16": "Yeah, it's a lot of encouragement,",
        "2006.92": "a lot of empathy and connection from people.",
        "2010.56": "So it motivates me.",
        "2012.4": "Like it makes me feel happy that I shared what I shared.",
        "2014.96": "Your channel is a breath of fresh air to me.",
        "2017.32": "Thank you.",
        "2017.84": "Because, you know, it's about TikTok, right?",
        "2019.4": "It's about quick, snappy, you know,",
        "2021.92": "headlines that capture your attention.",
        "2023.72": "Whereas your videos could be 50 minutes to one hour long",
        "2026.12": "and it really goes in depth.",
        "2027.32": "And you really spend the time to go into it.",
        "2030.56": "So I think it's kind of different.",
        "2032.28": "But I'm sure you've been looking at other YouTubers",
        "2035.08": "or even other blogs, how they do their financial content,",
        "2037.92": "especially in a Singaporean context.",
        "2039.44": "What do you think about the whole financial community in Singapore?",
        "2042.84": "You've been on Sidley, you've seen all those posts.",
        "2045.6": "What do you think?",
        "2046.52": "Very diverse.",
        "2048.88": "And I don't know how much of what I've seen",
        "2050.6": "is representative of the actual community.",
        "2054.0": "Before, like back in 2020, when I first got my job",
        "2056.72": "and I was looking into all these personal finance blogs",
        "2061.04": "and channels.",
        "2062.4": "And so because of that, I started getting...",
        "2064.12": "All my YouTube ads were investment,",
        "2066.8": "passive income.",
        "2067.52": "Give me five minutes and I'll...",
        "2069.68": "Oh my gosh.",
        "2070.44": "So, and those were very off-putting, like,",
        "2073.52": "so irritating.",
        "2074.68": "And because I guess they were so irritating from the offset,",
        "2077.48": "I just ignored a lot of them.",
        "2079.4": "But all that was happening.",
        "2081.96": "And then there was also like the very nuanced",
        "2084.6": "and accessible blogs like Sidley, Singsaver.",
        "2087.4": "So these are very helpful.",
        "2089.12": "I'm a big fan of the Work Salaryman.",
        "2091.08": "I really enjoy their content.",
        "2092.52": "All the finance through Instagrams were starting",
        "2095.64": "and sharing these bite-sized, accessible pieces of information.",
        "2100.24": "So it's very diverse and...",
        "2102.76": "It's being made more accessible.",
        "2104.72": "So I think that's a very encouraging direction.",
        "2108.52": "I would... I have to say though,",
        "2110.24": "generally I think personal finance is still",
        "2113.08": "very male-dominated.",
        "2115.24": "A lot of perspectives and a lot of the people",
        "2116.68": "who are sharing are men.",
        "2118.52": "And it's a different lived experience.",
        "2122.0": "So I would love to hear more from women actually",
        "2125.72": "in the space.",
        "2126.68": "And yeah, like all the crypto bros.",
        "2129.8": "To the moon, yeah.",
        "2130.72": "Yeah, and the focus on investing and passive income.",
        "2135.8": "All of these are common patterns that I see recurring,",
        "2140.36": "which is not very aligned with my own values",
        "2143.52": "and perspective.",
        "2144.36": "So I'm always trying to find a way,",
        "2146.16": "find a place where I can sit comfortably",
        "2147.92": "and work on my own financial management",
        "2150.52": "outside of these voices and other perspectives.",
        "2154.84": "Your channel is where you really share your journey.",
        "2157.56": "It's relatively young and new channel.",
        "2159.84": "It's been half a year.",
        "2160.92": "So how has your personal relationship with money changed",
        "2165.44": "over the years?",
        "2166.8": "What's your relationship with money right now?",
        "2169.96": "My understanding of money has deepened.",
        "2173.2": "Like how money is generated, what role it plays in my life.",
        "2177.52": "And that deeper understanding is like positive",
        "2181.08": "in all the ways that you can imagine.",
        "2182.36": "I have better financial management.",
        "2184.32": "I have a sense of what is the best.",
        "2188.6": "I have a sense of what I think is the best thing to do",
        "2191.8": "with my money in my current context.",
        "2195.12": "I haven't asked this and I realized I have to ask",
        "2196.64": "because it contextualizes it.",
        "2199.76": "So how are you this year?",
        "2200.6": "I am turning 26 this year.",
        "2202.04": "Okay.",
        "2202.88": "So something that I'm still working on is like",
        "2205.64": "associating money's subjective worth",
        "2210.08": "to my sense of security and safety.",
        "2214.6": "Because there is like a baseline level of survival",
        "2218.44": "and sense of safety that money has to cover, right?",
        "2223.44": "But I think for a lot of us, that's already covered.",
        "2228.6": "There's this really good article by Lawrence Yeo",
        "2232.2": "called Money is the Megaphone of Identity.",
        "2234.88": "And he talks about money in three phases.",
        "2237.56": "More to that dot com.",
        "2239.16": "Yeah, yeah, yeah.",
        "2240.92": "So the first phase is security, I think,",
        "2244.2": "and then security and then freedom and then power.",
        "2248.04": "So in that first phase, security,",
        "2250.56": "the very bottom, the bottom end of that phase",
        "2253.04": "is of course like basic necessities, safety.",
        "2255.88": "But the higher end, where security moves into freedom,",
        "2260.4": "that is not so much about the amount of money that you have,",
        "2264.52": "but your mindset.",
        "2267.08": "So how much savings that you think is enough",
        "2269.28": "to guarantee that you can preserve your lifestyle",
        "2272.8": "the way it is like for the next few years.",
        "2275.56": "And that varies from person to person.",
        "2277.04": "So you could have $10,000 and feel very secure.",
        "2280.12": "You could have $100,000 and feel totally insecure.",
        "2283.72": "And I think that's the stage that I'm at now",
        "2287.92": "where I want to be in a healthier mental space with money",
        "2290.44": "and not tie it so much to my sense of security and survival",
        "2294.6": "because I know how much I depend on it.",
        "2296.56": "Like in my mind, like if I were to make a misstep,",
        "2300.36": "I feel like that could,",
        "2301.36": "I snowball into thinking like this could be,",
        "2305.16": "this could result in financial ruin for me.",
        "2307.52": "So I think I need to move into a healthier",
        "2311.92": "relationship with money.",
        "2313.84": "And just in the psychology of it,",
        "2315.2": "because I have done like the best I can,",
        "2319.08": "and I'm still trying to do the best I can",
        "2320.68": "with the technical aspects of it, the knowledge of it.",
        "2325.32": "But the psychological part of it is something",
        "2327.72": "that I would like to work on further.",
        "2329.88": "Is this where people's goalposts keep changing?",
        "2331.84": "Like you have a certain number in order to feel secure,",
        "2333.88": "but once you reach it, then you keep shifting it.",
        "2336.4": "There's also a situation whereby,",
        "2338.12": "I have this conversation with a married couple,",
        "2340.16": "Jingles and Yingying, you've met them.",
        "2341.96": "So the husband is doing his PhD right now.",
        "2344.88": "And so before that you have to discuss,",
        "2346.36": "because you're taking a pay cut to the PhD.",
        "2348.4": "And so logically you've worked out the finances,",
        "2350.96": "they work it out and it's okay.",
        "2352.84": "You know, they can get by,",
        "2354.88": "they can still not compromise on their standard of living.",
        "2358.4": "But emotionally, that's the hard part, right?",
        "2360.76": "Because Jingles will have to take a pay cut in his salary.",
        "2365.0": "So it feels, you know, like uncertain.",
        "2368.36": "There's the psychological aspects",
        "2369.64": "that's so hard to quantify.",
        "2371.84": "It's very nuanced, right?",
        "2373.2": "And this kind of thing,",
        "2374.04": "you want to talk to people about it,",
        "2376.04": "maybe talk to the therapist, talk to your friends.",
        "2378.28": "Because money is money.",
        "2379.12": "It's just dollar bills and numbers on a bank account,",
        "2382.08": "but how you manage it,",
        "2382.92": "all of that is emotional and psychological.",
        "2385.28": "So it's just as important.",
        "2386.6": "Money is money.",
        "2388.96": "How would you define money?",
        "2390.32": "Wow, it's just digital digits.",
        "2392.84": "Sorry, sorry.",
        "2393.68": "It's just numbers.",
        "2394.52": "Digits on a screen, that's how.",
        "2395.36": "Yeah, digits on a screen.",
        "2396.2": "Digits on a screen.",
        "2397.68": "Even the way money is right now, of course.",
        "2400.32": "Yeah, digits on a screen.",
        "2402.48": "That if you don't have it, you're screwed.",
        "2407.16": "Yeah, but hopefully let's not get these digits on a screen.",
        "2410.72": "Controlling our life.",
        "2411.96": "Use it as a tool.",
        "2413.2": "Exactly.",
        "2414.32": "Right, thank you.",
        "2427.64": "What has been your best and worst investments you've made?",
        "2454.2": "Doesn't have to be a financial one.",
        "2456.28": "Something that comes to mind?",
        "2457.2": "I've thought of a few.",
        "2458.04": "Oh.",
        "2458.88": "I'm just wondering.",
        "2459.72": "We have time.",
        "2460.56": "Okay.",
        "2461.76": "The first best investment, I think, was getting a laptop.",
        "2465.36": "So I got my first laptop in sec one.",
        "2467.04": "And that, the entire world was,",
        "2469.56": "I learned through my laptop.",
        "2471.0": "So I think just having that device,",
        "2472.88": "yeah, it opened my entire world.",
        "2474.56": "And I still think having a computing device is irreplaceable.",
        "2478.84": "Your phone cannot replace it.",
        "2480.56": "Maybe it can now, I don't know.",
        "2481.72": "But back then, getting a laptop",
        "2483.64": "was the most life-changing thing.",
        "2486.16": "The second thing I thought about was",
        "2489.44": "going on an exchange semester when I was in university.",
        "2492.48": "Best investment, because the returns are emotional",
        "2495.56": "and more to do with self-development and how I see myself.",
        "2500.24": "And it taught me a lot of independence,",
        "2503.16": "which has informed my life now.",
        "2506.24": "Yeah, two best investments.",
        "2507.44": "Best investments.",
        "2508.28": "Worst investments.",
        "2509.12": "Worst.",
        "2510.36": "A Time magazine subscription in JC.",
        "2514.16": "I might have one of those, though.",
        "2516.56": "So when I entered JC,",
        "2520.2": "there were Time magazine salespeople in my canteen,",
        "2524.64": "and they were just going up to students.",
        "2526.4": "We were, what, 16 at this time,",
        "2528.16": "trying to push for subscriptions of their magazine",
        "2531.96": "for like two years.",
        "2533.28": "I think it's a bi-weekly.",
        "2534.52": "So every two weeks you get a magazine, right?",
        "2537.56": "And it was, I think, $200, $300.",
        "2539.28": "And they were just,",
        "2540.12": "they were trying to sell it to the parents, to the students,",
        "2542.28": "and saying that it's good for GP, general people,",
        "2546.28": "you want to keep up to date with current affairs.",
        "2549.64": "So it was very much like fear-based,",
        "2551.64": "like FOMO-based kind of selling.",
        "2554.24": "And I think I spent $200, $300 of my own money.",
        "2557.8": "Worst investment.",
        "2558.64": "And it was not a good investment because?",
        "2561.32": "You didn't benefit from it, or?",
        "2563.0": "I did not have the time to read through the magazines",
        "2567.8": "for what they promised it to be.",
        "2570.76": "Yeah, but I thought it was quite, what's the word?",
        "2574.64": "Not very ethical, the way they did it.",
        "2577.32": "I think that's our first experience of sales pitchers.",
        "2579.52": "Yeah, yeah, yeah.",
        "2580.52": "That's the version of, give me five minutes back then.",
        "2583.68": "Yeah.",
        "2584.52": "And then we were like, oh, okay, I have to buy it",
        "2585.72": "because you said fear-based, right?",
        "2586.92": "And then they're like,",
        "2588.08": "like all your other schoolmates are buying it.",
        "2590.8": "You know, you want to know what's up with the world",
        "2592.96": "because this will be useful for your grades,",
        "2594.8": "for general people.",
        "2595.72": "You want to know what to talk about.",
        "2597.76": "Yeah, but you see, these tactics are still being used today.",
        "2599.92": "So it works at some level.",
        "2601.4": "Yeah, right. It's our first experience of hard selling.",
        "2604.28": "Yeah, it's a deeper psychological level.",
        "2606.88": "What's one thing under a hundred dollars",
        "2609.08": "that you think has been a game changer for you?",
        "2611.6": "I have a few.",
        "2612.64": "I thought of a few and I try to keep it",
        "2614.08": "in the hundred dollar range",
        "2615.16": "because like no use giving you something that's $20, right?",
        "2617.4": "A hand vacuum.",
        "2618.92": "So if you have long hair and you shed a lot of hair,",
        "2622.36": "a hand vacuum is so useful",
        "2623.84": "to just clean up your space a little bit.",
        "2626.68": "The second thing is a Fitbit.",
        "2628.8": "And I know this is like, can be 170.",
        "2631.72": "Yeah, you can get it at a discount.",
        "2632.56": "11.11 or whatever.",
        "2633.6": "Get discount, use all your Shopee vouchers.",
        "2635.84": "You can get it at about the $120 range.",
        "2638.56": "Before I got my Fitbit, and I'm not a very sporty person,",
        "2641.68": "but I happen to be doing like maybe some running at the time",
        "2644.56": "but now what I'm using it most for is to track my sleep.",
        "2648.16": "So now if I don't wear my Fitbit,",
        "2649.28": "how do I know how long I've slept for?",
        "2651.32": "So I think a Fitbit, game changer",
        "2653.84": "in terms of helping me track my sleep.",
        "2655.24": "And the next thing is a Hydro Flask.",
        "2658.36": "Sorry, this is not really in the spirit of the question,",
        "2661.0": "I'm just giving you things to buy.",
        "2663.6": "Doesn't fit into the low buy concept.",
        "2666.12": "My listeners are thinking, no, I'm gonna get this.",
        "2668.76": "Yeah, like a tumbler that, a vacuum seal tumbler.",
        "2672.44": "So that it keeps your cold water cold",
        "2674.44": "and your hot water hot.",
        "2675.48": "So I got my first vacuum tumbler in 2016",
        "2679.68": "and I've never switched back to a regular plastic bottle",
        "2683.08": "because I will never go out of the house without cold water.",
        "2685.36": "I will never drink room temperature water ever again.",
        "2687.76": "I will always just have cold water with me.",
        "2689.64": "Good for the weather.",
        "2690.48": "Yeah, save money.",
        "2691.72": "So you don't have to buy drinks outside.",
        "2694.16": "And you can put a lemon in there.",
        "2696.24": "And you drink more water.",
        "2697.08": "I don't know, do people drink enough water nowadays?",
        "2698.96": "I don't think so.",
        "2699.8": "I don't think I would drink the amount of water I do",
        "2701.88": "if I didn't have a tumbler.",
        "2704.08": "Okay, maybe I'll end it there.",
        "2705.92": "A good set of wireless earphones",
        "2708.08": "that you can get for $100 or more, $100 or less.",
        "2711.52": "What about you though?",
        "2712.64": "Cause I'm curious like what other people.",
        "2715.0": "I've been asked before, so my answer was a foam roller.",
        "2718.48": "So you massage on it.",
        "2719.84": "Yeah, it works very good.",
        "2720.88": "Is it very expensive though?",
        "2721.92": "No, you can get it for cheap at Decathlon.",
        "2723.96": "Oh, but you said $100.",
        "2725.48": "So I thought it must be.",
        "2726.52": "Oh, you were trying to feed in the question, right?",
        "2728.92": "Anything that under $100",
        "2730.4": "that has been really useful for you.",
        "2731.84": "There are so many.",
        "2732.68": "Yeah, you try it, you know,",
        "2733.72": "stretch out your muscles.",
        "2735.16": "Foam roller, yeah, it works really well.",
        "2737.16": "One place that you learn from",
        "2738.52": "that you think is underrated",
        "2740.0": "that you want to share with our listeners.",
        "2741.44": "It could be a book, a website, blog, podcasts.",
        "2744.64": "Yeah, many that I've learned from.",
        "2746.44": "And I feel like Seedly, I think it's not even underrated.",
        "2750.4": "It's deservedly rated",
        "2752.44": "cause they make it so accessible",
        "2753.96": "and still educational for people.",
        "2756.44": "I really like the Financial Diet.",
        "2758.28": "They're more based in the US,",
        "2760.16": "but they do more of the psychological",
        "2762.16": "and sociological analysis of managing personal finance,",
        "2765.2": "which I think is very helpful.",
        "2766.88": "There is also Smart Mamat, which is a Muslim.",
        "2770.76": "They talk about personal finance",
        "2772.48": "and investing specifically within the Muslim context.",
        "2777.4": "So Sharia compliant guidelines.",
        "2780.68": "I don't personally follow it,",
        "2782.32": "but the fact that it exists as a resource for people,",
        "2785.88": "I think is very helpful for those who want to follow",
        "2789.0": "the Islamic guidelines to investing.",
        "2791.24": "I think maybe it's underrated.",
        "2793.84": "Yeah, people can find out more about it.",
        "2795.08": "Yeah.",
        "2795.92": "And we've got our co-host for the Sharia investing episode.",
        "2798.48": "Oh, or me?",
        "2800.12": "Yeah, could I get you on the show",
        "2801.24": "to talk about investments?",
        "2804.24": "We're going to get people who knows about Sharia investing",
        "2806.88": "because I personally don't know a lot about it myself",
        "2810.0": "and I'm curious to find out more,",
        "2811.6": "but it'd be great to have you come on",
        "2813.2": "and ask questions as well.",
        "2816.24": "And we can find out more about Sharia investing together.",
        "2818.52": "And we can take it offline.",
        "2819.92": "Yeah, I'll think about it.",
        "2821.76": "All right, thank you, Lisa.",
        "2823.56": "Oh, thank you.",
        "2824.4": "Thank you.",
        "2825.68": "Everyone gets AT&T's best deal on the new iPhone 14 Pro",
        "2831.68": "with the incredible camera.",
        "2833.24": "So people currently listening to comedy podcasts",
        "2836.92": "and people listening to political podcasts",
        "2839.32": "and people listening to true crime podcasts",
        "2841.6": "who actually can't stop listening to true crime podcasts",
        "2843.96": "and it's ruling their lives.",
        "2845.4": "The point is everyone, new and existing customers.",
        "2849.28": "Ask how to get up to $800 off the new iPhone 14 Pro",
        "2852.52": "with eligible trade-in.",
        "2853.84": "Visit att.com or our stores for details.",
        "2856.56": "Terms and restrictions may apply."
      }
    }
  ]
}
